[
  {
    "title": "Report: WrestleMania 42 Two-Day Combo Ticket Prices",
    "summary": "WrestleMania 42 is months away, but tickets are on sale to the general public on Wednesday, September 24. Ahead of the on-sale date, PWInsider published the following report on the ticket prices for...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/report-wrestlemania-42-two-day-combo-ticket-prices",
    "publishedAt": "2025-09-22T19:09:44+00:00",
    "category": "wwe"
  },
  {
    "title": "Stephanie Vaquer Appearance, Roxanne Perez vs Bayley And No DQ Six Man Tag Set For Tonight's WWE RAW",
    "summary": "Several matches and segments have been added to tonight's edition of WWE Monday Night RAW. After a hectic weekend at WWE Wrestlepalooza and as WWE programming turns its attention to the upcoming WWE...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/stephanie-vaquer-appearance-roxanne-perez-vs-bayley-and-no-dq-six-man-tag-set-for-tonights-wwe-raw",
    "publishedAt": "2025-09-22T18:56:32+00:00",
    "category": "wwe"
  },
  {
    "title": "Kevin Nash Provides Health Update, Says He Has An Irregular Heartbeat",
    "summary": "WWE Hall of Famer Kevin Nash provided a significant update on his health during the latest episode of his “Kliq This” podcast. Responding to a fan’s question about a recent stress test he underwent,...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/kevin-nash-provides-health-update-says-irregular-heartbeat/",
    "publishedAt": "2025-09-22T18:53:04+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE WrestleMania 42 Insane Ticket Prices Revealed",
    "summary": "WWE is returning to Las Vegas next year for WrestleMania 42. But if you want to attend next year’s event, it’s not going to be cheap. A lot has been made of WWE’s rising ticket prices in recent...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1579422-wwe-wrestlemania-42-insane-ticket-prices-revealed",
    "publishedAt": "2025-09-22T18:51:19+00:00",
    "category": "wwe"
  },
  {
    "title": "AJ Lee Says Her Return Has Been 'A Chaotic Fairytale' So Far: I Guess I Still Got It",
    "summary": "AJ Lee has celebrated her return to the ring. At WWE Wrestlepalooza on September 20th, Lee would return to the ring for the first time in over a decade to team with her husband CM Punk against fellow...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/aj-lee-says-her-return-has-been-a-chaotic-fairytale-so-far-i-guess-i-still-got-it",
    "publishedAt": "2025-09-22T18:33:14+00:00",
    "category": "wwe"
  },
  {
    "title": "Cody Rhodes announced for tonight’s WWE Raw",
    "summary": "WWE has announced that Undisputed Champion Cody Rhodes will appear live at today’s episode of Raw, which takes… The post Cody Rhodes announced for tonight’s WWE Raw appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/top-story/362392-cody-rhodes-announced-for-tonights-wwe-raw/",
    "publishedAt": "2025-09-22T18:24:24+00:00",
    "category": "wwe"
  },
  {
    "title": "ESPN gives a low grade to WWE’s Wrestlepalooza",
    "summary": "ESPN’s Andreas Hale provided his overall review of this past Saturday’s WWE Wrestlepalooza, which ended up with a… The post ESPN gives a low grade to WWE’s Wrestlepalooza appeared first on WWE News,...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/362388-espn-gives-a-low-grade-to-wwes-wrestlepalooza/",
    "publishedAt": "2025-09-22T18:18:31+00:00",
    "category": "wwe"
  },
  {
    "title": "Nikki Bella Unhappy With Her WWE 2K25 Character: “I Look Like I Was Left In A Field For Years”",
    "summary": "During the latest episode of SiriusXM’s The Nikki and Brie Show, Nikki Garcia, aka Nikki Bella, shared her thoughts on her character model in the new WWE 2K25 video game, and she is not impressed....",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/nikki-bella-unhappy-her-wwe-2k25-character-look-like-left-field-years/",
    "publishedAt": "2025-09-22T18:18:00+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Star Built A 10th Century Langhús At His Home For Historical Reenactments",
    "summary": "Pro athletes and celebrities have flaunted some extravagant purchases over the years, but the War Raiders’ Erik might have one of the coolest ones to brag about. The War Raiders recently spoke to...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1563340-wwe-star-built-10th-century-langhus-for-historical-reenactments",
    "publishedAt": "2025-09-22T18:12:57+00:00",
    "category": "wwe"
  },
  {
    "title": "AJ Lee On Her WWE Return Match: “I Guess I Still Got It”",
    "summary": "Following her in-ring return at WWE Wrestlepalooza, AJ Lee has taken to social media to share her thoughts on the emotional experience. In a heartfelt post on her Instagram account, the former Divas...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/lee-her-wwe-return-match-guess-still-got/",
    "publishedAt": "2025-09-22T18:03:42+00:00",
    "category": "wwe"
  },
  {
    "title": "Cody Rhodes Appearance Set For Tonight's WWE RAW",
    "summary": "Cody Rhodes is set to appear on tonight's edition of WWE Monday Night RAW. At WWE Wrestlepalooza on September 20th, Rhodes would defend his WWE Championship in the main event against a man who took...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/cody-rhodes-appearance-set-for-tonights-wwe-raw",
    "publishedAt": "2025-09-22T17:58:41+00:00",
    "category": "wwe"
  },
  {
    "title": "Becky Lynch Claims She Was Attacked By A Bee At WWE Wrestlepalooza, Calls Jessika Carr A Crooked Referee",
    "summary": "Becky Lynch tapped out to AJ Lee in a mixed tag team match at WWE Wrestlepalooza. Or did she? Lynch claims she was attacked by a rogue bee, and pointed out that referee Jessika Carr was biased...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/becky-lynch-claims-she-was-attacked-by-a-bee-at-wwe-wrestlepalooza-calls-jessika-carr-a-crooked-referee",
    "publishedAt": "2025-09-22T17:21:06+00:00",
    "category": "wwe"
  },
  {
    "title": "D’Lo Brown On His WWE Career: “They Missed The Boat On A Lot Of Things”",
    "summary": "During a recent “D’Lo Brown Live” Q&A session on AdFreeShows.com, former WWE European and Intercontinental Champion D’Lo Brown reflected on his role within the company during the Attitude Era. When...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/dlo-brown-his-wwe-career-they-missed-boat-lot-things/",
    "publishedAt": "2025-09-22T17:19:34+00:00",
    "category": "wwe"
  },
  {
    "title": "Roman Reigns Confirmed For Big WWE Show",
    "summary": "An update has been revealed regarding the return of Roman Reigns, who has been absent from WWE television for over three weeks. Reigns is now officially advertised for the upcoming WWE Crown Jewel...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/roman-reigns-confirmed-big-wwe-show/",
    "publishedAt": "2025-09-22T16:48:23+00:00",
    "category": "wwe"
  },
  {
    "title": "Triple H Explains Stephanie Vaquer's Absence From WWE TV Leading Up To Wrestlepalooza",
    "summary": "The head of WWE creative detailed why the new Women's World Champion wasn't present for the build to its newest premium live event.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1975168/wwe-triple-h-stephanie-vaquer-tv-absence-wrestlepalooza/",
    "publishedAt": "2025-09-22T16:30:00+00:00",
    "category": "wwe"
  }
]