[
  {
    "title": "Report: Santos Escobar Slated To Be At 10/27 WWE Raw",
    "summary": "Santos Escobar will reportedly be at the October 27th episode of WWE Raw. Mike Johnson at PWInsider reports, \"Escobar is currently slated to be at this Monday's Raw taping in Anaheim, CA.\" It was not...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/report-santos-escobar-slated-to-be-at-10-27-wwe-raw",
    "publishedAt": "2025-10-21T18:13:57+00:00",
    "category": "wwe"
  },
  {
    "title": "Nathan Frazer Says Original Plans Called For Fraxiom Split, Hair vs. Mask Match At NXT Stand & Deliver 2025",
    "summary": "Nathan Frazer reveals the original plans for Fraxiom. At WWE NXT Stand & Deliver, Fraxiom (Frazer & Axiom) faced Hank Walker and Tank Ledger in a match for the NXT Tag Team Championships. Walker and...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/nathan-frazer-axiom-wwe-nxt-263457",
    "publishedAt": "2025-10-21T18:11:10+00:00",
    "category": "wwe"
  },
  {
    "title": "KC Navarro Says Killer Kross Helped Get Him 2022 WWE Tryout",
    "summary": "KC Navarro established himself as one of the top names on the independent scene before signing with TNA in 2024. Speaking on One Big Work, Navarro reflected on his journey, and explained how Killer...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/kc-navarro-says-killer-kross-helped-get-him-2022-wwe-tryout",
    "publishedAt": "2025-10-21T17:51:42+00:00",
    "category": "wwe"
  },
  {
    "title": "AJ Styles On John Cena’s Special Introduction: ‘It Definitely Caught Me Off Guard’",
    "summary": "Former WWE Champion AJ Styles recently spoke about the special customized ring introduction he received from John Cena before their match at the WWE Crown Jewel Premium Live Event in Perth,...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/styles-john-cenas-special-introduction-definitely-caught-off-guard/",
    "publishedAt": "2025-10-21T17:32:43+00:00",
    "category": "wwe"
  },
  {
    "title": "Chelsea Green Has More Issues With Hotel That Mistook Her For Being An Escort",
    "summary": "Needless to say, Fairmont hotels will not be a stop on Chelsea Green‘s presidential tour. Last year, Chelsea Green looked to celebrate WWE WrestleMania 40 week with a drink at The Plaza Hotel,...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585727-chelsea-green-issues-hotel-mistook-her-for-an-escort",
    "publishedAt": "2025-10-21T17:31:19+00:00",
    "category": "wwe"
  },
  {
    "title": "Samantha Irvin Reveals Extremely Long WWE Non-Compete Clause",
    "summary": "Former WWE Ring Announcer Samantha Irvin might’ve hinted that she’s honoring an extremely lengthy non-compete clause. Samantha Irvin made a name for herself in WWE with her unique and energetic style...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585729-samantha-irvin-extremely-long-wwe-non-compete-clause",
    "publishedAt": "2025-10-21T17:26:53+00:00",
    "category": "wwe"
  },
  {
    "title": "AJ Styles: I'm Not Sure There Is Anyone In The Ring I Trust More Than John Cena",
    "summary": "AJ Styles and John Cena met for one final time at WWE Crown Jewel, capping off a rivalry that dated back nearly a decade when Styles first entered WWE. Speaking to Justin Barrasso of the Boston...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/aj-styles-im-not-sure-there-is-anyone-in-the-ring-i-trust-more-than-john-cena",
    "publishedAt": "2025-10-21T16:55:39+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE’s Maxxine Dupri Says She’s Been Training Much More Than People Know About",
    "summary": "Maxxine Dupri continues to hone her in-ring skills. For the second straight time, Maxxine Dupri defeated Becky Lynch on WWE Raw, in this case by disqualification. Still, her increasing improvement...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585715-wwe-maxxine-dupri-training-much-more-people-know",
    "publishedAt": "2025-10-21T16:38:46+00:00",
    "category": "wwe"
  },
  {
    "title": "Samatha Irvin Has A Lot Of Time Left On Her Non-Compete Clause After WWE Exit",
    "summary": "Former WWE ring announcer Samantha Irvin recently marked the one-year anniversary of her departure from the company and confirmed that she still has one year remaining on a non-compete clause,...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/samatha-irvin-lot-time-left-her-non-compete-clause-after-wwe-exit/",
    "publishedAt": "2025-10-21T16:24:11+00:00",
    "category": "wwe"
  },
  {
    "title": "Natalya Highlights Why Debuting In WWE’s Divas Era Was So Difficult",
    "summary": "Natalya recalls the challenges she faced leading up to her WWE debut during the Divas Era. It may sound surprising, but WWE superstar Natalya is currently experiencing a career renaissance outside...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585700-natalya-highlights-why-debuting-in-wwes-divas-era-was-so-difficult",
    "publishedAt": "2025-10-21T16:03:31+00:00",
    "category": "wwe"
  },
  {
    "title": "Former Female WWE Star Was Pitched As Leader of Retribution Stable",
    "summary": "Mustafa Ali looks back on the initial plans, or rather lack thereof, for Retribution. While ill-fated, Retribution is still widely remembered for its run of tormenting the WWE locker room during...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585701-former-female-wwe-star-pitched-leader-retribution-stable",
    "publishedAt": "2025-10-21T16:02:39+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Star Has Classy Response To Fan Accusing Her Of Botching Move",
    "summary": "Zaria claps back on social media. Last Friday’s edition of WWE SmackDown featured a WWE Women’s Tag Team Championship match pitting Zaria and Sol Ruca against the reigning titleholders Alexa Bliss...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585685-wwe-star-classy-response-fan-accusing-botching-move",
    "publishedAt": "2025-10-21T15:06:17+00:00",
    "category": "wwe"
  },
  {
    "title": "John Cena Visits WWE PC, Goes Viral After NXT Superfan Blake Monroe Posts Photo",
    "summary": "Blake Monroe shares photo with 17-time World Champion John Cena, who stopped by the WWE Performance Center on Monday afternoon.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2003146/john-cena-wwe-pc-viral-nxt-superfan-blake-monroe-photo/",
    "publishedAt": "2025-10-21T14:47:19+00:00",
    "category": "wwe"
  },
  {
    "title": "Despite Creative Reshuffling, Austin Theory Still Has Strong Internal Support In WWE",
    "summary": "Austin Theory, who was written off WWE television due to an injury several months ago, still maintains strong internal support within the company and is expected to return to the screen in a...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/despite-creative-reshuffling-austin-theory-still-strong-internal-support-wwe/",
    "publishedAt": "2025-10-21T14:20:20+00:00",
    "category": "wwe"
  },
  {
    "title": "John Cena Comments On Recent Visit To The WWE Performance Center",
    "summary": "John Cena is grateful for his time at the WWE Performance Center. Cena is just four dates away from hanging up his boots. Cena’s retirement match is scheduled for WWE Saturday Night’s Main Event on...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585683-john-cena-comments-on-recent-visit-to-the-wwe-performance-center",
    "publishedAt": "2025-10-21T14:18:08+00:00",
    "category": "wwe"
  }
]