[
  {
    "title": "John Cena Confirms WWE Saturday Night's Main Event In December Will Be His Final Match",
    "summary": "John Cena reaffirms fans on social media that he will truly be retiring after his last match at Saturday Night's Main Event.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1999703/john-cena-confirms-wwe-saturday-nights-main-event-december-final-match/",
    "publishedAt": "2025-10-17T17:46:30+00:00",
    "category": "wwe"
  },
  {
    "title": "Speedball Mike Bailey Explains 'Worst' Thing About FTR",
    "summary": "\"Speedball\" Mike Bailey is ready for battle again with FTR at \"Tailgate Brawl\" before WrestleDream on Saturday. However, as he prepares, there's one thing he's hoping FTR won't try to do in their...",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1999700/speedball-mike-bailey-explains-worst-thing-ftr/",
    "publishedAt": "2025-10-17T17:43:55+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Reportedly Transitioning Toward AI-Based Creative Despite 'Absurdly Bad' Pitches",
    "summary": "WWE is reportedly moving toward an AI-based writer's room with Writer AI, despite the fact that it has pitched some embarrassingly bad storylines.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1999698/wwe-ai-creative-absurdly-bad-pitches-bobby-lashley/",
    "publishedAt": "2025-10-17T17:40:39+00:00",
    "category": "wwe"
  },
  {
    "title": "Bron Breakker Naps During Jey Uso’s Entrance In Japan",
    "summary": "Bron Breakker decided to take a quick nap while Jey Uso was yeeting with the fans at a live event. The WWE Superstars are currently in Japan for a couple of SuperShow events. The first show took...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585326-bron-breakker-naps-during-jey-uso-entrance-wwe-japan",
    "publishedAt": "2025-10-17T16:55:47+00:00",
    "category": "wwe"
  },
  {
    "title": "Karrion Kross Addresses Whether The Door Is Still Open At WWE",
    "summary": "Former WWE star Karrion Kross addresses whether the door is still open for he and Scarlett at WWE, where they spent their last three years.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1999628/wwe-karrion-kross-door-still-open/",
    "publishedAt": "2025-10-17T16:43:56+00:00",
    "category": "wwe"
  },
  {
    "title": "REPORT: WWE Has Big Plans For Chris Jericho If He Returns",
    "summary": "With Chris Jericho’s AEW contract reportedly expiring at the end of the year, speculation about a potential return to WWE has been rampant. A new report from the latest edition of the Wrestling...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/report-wwe-big-plans-chris-jericho-returns/",
    "publishedAt": "2025-10-17T16:35:21+00:00",
    "category": "wwe"
  },
  {
    "title": "Dave Meltzer Discusses Chris Jericho's Potential To Return To AEW, Move To WWE",
    "summary": "Dave Meltzer provides an update on Chris Jericho finishing his career in WWE instead of AEW.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1999604/wwe-aew-chris-jericho-return/",
    "publishedAt": "2025-10-17T16:24:19+00:00",
    "category": "wwe"
  },
  {
    "title": "Cyrus Kowsari Hired As WWE Senior Director of Creative Strategy, Will Focus On AI Storytelling And Integration",
    "summary": "WWE hired Cyrus Kowsari as the Senior Director of Creative Strategy in early October. Cyrus wrote on his LinkedIn, \"If you've known me for any part of my life, you know how passionate I am about WWE....",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/cyrus-kowsari-hired-as-wwe-senior-director-of-creative-strategy-will-focus-on-ai-storytelling-and-integration",
    "publishedAt": "2025-10-17T16:21:04+00:00",
    "category": "wwe"
  },
  {
    "title": "New WWE Hire Will Focus Transition To AI-Based Storytelling — Report",
    "summary": "WWE is trying to see how it can integrate AI into its storylines on television. Cyrus Kowsari was recently hired as WWE’s new Senior Director of Creative Strategy. He previously held roles at ONE MMA...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585319-new-wwe-hire-will-focus-transition-to-ai-based-storytelling-report",
    "publishedAt": "2025-10-17T15:54:46+00:00",
    "category": "wwe"
  },
  {
    "title": "Drew McIntyre Continues To Ensure Fans That WWE SmackDown Match With Jacob Fatu Will Happen",
    "summary": "Drew McIntyre insists that his match with Jacob Fatu will happen. After weeks of turmoil, McIntyre and Fatu are set to go to war on Friday's episode of SmackDown, as they'll clash in a singles...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/drew-mcintyre-jacob-fatu-wwe-262395",
    "publishedAt": "2025-10-17T15:45:50+00:00",
    "category": "wwe"
  },
  {
    "title": "Peter Rosenberg: Bobby Heenan Is The Greatest Manager, Paul Heyman Is Something Different",
    "summary": "Peter Rosenberg says no one outranks Bobby Heenan in his mind. Rosenberg recently appeared on Insight with Chris Van Vliet, where he named WWE Hall of Famer Bobby Heenan as his number one manager of...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585286-peter-rosenberg-on-wwe-bobby-heenan-legacy",
    "publishedAt": "2025-10-17T15:35:22+00:00",
    "category": "wwe"
  },
  {
    "title": "John Cena Reiterates He Will Retire On December 13 'Despite Any Speculation Or Rumors'",
    "summary": "John Cena is set to have his retirement match on December 13th at WWE Saturday Night's Main Event. At WWE Money in the Bank 2024, Cena announced that 2025 will be his last year as an in-ring...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/john-cena-reiterates-he-will-retire-on-december-13-despite-any-speculation-or-rumors",
    "publishedAt": "2025-10-17T15:34:03+00:00",
    "category": "wwe"
  },
  {
    "title": "Triple H Shares Footage Developing WWE Star Stephanie Vaquer's Entrance",
    "summary": "In a new video posted on social media, Stephanie Vaquer and Triple H are seen re-working Vaquer's entrance ahead of the Crown Jewel PLE in Australia.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1999358/wwe-triple-h-staphanie-vaquer-entrance-pyro-production/",
    "publishedAt": "2025-10-17T15:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Top WWE Star Makes Bold Claim About John Cena’s Final Match",
    "summary": "Natalya reveals her picks for John Cena’s final WWE opponent and predicts the outcome for the match. John Cena’s retirement tour is reaching its final stretch, with only four appearances left. He is...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585293-wwe-star-bold-claim-john-cena-final-match",
    "publishedAt": "2025-10-17T15:14:19+00:00",
    "category": "wwe"
  },
  {
    "title": "Mick Foley Has A Message For President Donald Trump",
    "summary": "WWE Hall of Famer Mick Foley shared an emotional video message to the 45th and 47th U.S. President, Donald Trump. Mick Foley shared an emotional video on his YouTube channel directed at U.S....",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585290-wwe-mick-foley-message-for-us-president-donald-trump",
    "publishedAt": "2025-10-17T15:10:47+00:00",
    "category": "wwe"
  }
]