[
  {
    "title": "Drew McIntyre: I Was Ready To Go To New Japan In 2017, I Spoke To The Right People To Start Having The Serious Conversations",
    "summary": "Drew McIntyre says he was ready to go to New Japan in 2017. In 2017, Drew McIntyre returned to WWE after being released by the company just a couple of years prior after tearing up the independent...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/drew-mcintyre-i-was-ready-to-go-to-new-japan-in-2017-i-spoke-to-the-right-people-to-start-having-the-serious-conversations",
    "publishedAt": "2025-10-28T18:13:37+00:00",
    "category": "wwe"
  },
  {
    "title": "Backstage Update On Which AAA Stars Are Currently Listed On WWE's Internal Roster",
    "summary": "A backstage update reveals which AAA luchadors are currently listed on WWE' internal roster, though that doesn't mean they are under WWE contracts",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2010111/which-aaa-stars-currently-listed-wwe-internal-roster/",
    "publishedAt": "2025-10-28T18:03:17+00:00",
    "category": "wwe"
  },
  {
    "title": "Tyler Breeze Reflects On NXT Homecoming Return, Facing Ethan Page",
    "summary": "Tyler Breeze reflects on his NXT return. NXT Homecoming was a big show for the Orlando-based brand, allowing huge names like Charlotte Flair, Finn Balor, Rhea Ripley, Sami Zayn, and Bobby Roode to...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/tyler-breeze-nxt-homecoming-ethan-page-264980",
    "publishedAt": "2025-10-28T17:48:27+00:00",
    "category": "wwe"
  },
  {
    "title": "Injury WWE Star Provides Health Update",
    "summary": "Sol Ruca missed the recent NXT Halloween Havoc Premium Live Event as she was not medically cleared to compete. With NXT Deadline approaching, the former NXT Women’s North American Champion has...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/injury-wwe-star-provides-health-update/",
    "publishedAt": "2025-10-28T17:44:43+00:00",
    "category": "wwe"
  },
  {
    "title": "Drew McIntyre: ‘I Was Ready To Go To New Japan’ Before WWE Return",
    "summary": "Drew McIntyre’s successful second run in WWE almost didn’t happen, as the Scottish star was preparing to head to Japan before re-signing with the company in 2017. McIntyre was released from his first...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/drew-mcintyre-ready-new-japan-before-wwe-return/",
    "publishedAt": "2025-10-28T17:28:08+00:00",
    "category": "wwe"
  },
  {
    "title": "Mickie James Reveals Vince McMahon’s Reaction To Crotch Grab Spot At WrestleMania 22",
    "summary": "Mickie James has revealed Vince McMahon’s reaction to an infamous moment during her match against Trish Stratus at WrestleMania 22. Speaking to Chris Van Vliet on his INSIGHT podcast, former WWE...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586853-mickie-james-vince-mcmahon-reaction-crotch-grab-wrestlemania-22",
    "publishedAt": "2025-10-28T17:25:16+00:00",
    "category": "wwe"
  },
  {
    "title": "Sol Ruca: I'm Not Cleared Yet, But I'm Doing Everything In My Power To Be At WWE NXT Deadline",
    "summary": "Sol Ruca is hoping to be at NXT Deadline. On the October 21st episode of NXT, Sol Ruca announced she suffered a leg injury and wouldn't be able to defend her NXT Women's North American Title against...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/sol-ruca-im-not-cleared-yet-but-im-doing-everything-in-my-power-to-be-at-wwe-nxt-deadline",
    "publishedAt": "2025-10-28T17:23:07+00:00",
    "category": "wwe"
  },
  {
    "title": "David Otunga: \"Deep In Every WWE Contract Is A Binding Arbitration Clause... Any Dispute, Claim Or Controversy Has To Be Settled Privately In Stamford, Connecticut\"",
    "summary": "Otunga discusses the independent contractor status. On former WWE talent David Otunga's YouTube channel, he discussed WWE's talent contracts and talents being considered independent contractors....",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/david-otunga-deep-in-every-wwe-contract-is-a-binding-arbitration-clause-any-dispute-claim-or-controversy-has-to-be-settled-privately-in-stamford-connecticut",
    "publishedAt": "2025-10-28T17:13:33+00:00",
    "category": "wwe"
  },
  {
    "title": "Natalya Reveals Which WWE Legend Dressed As Big Bird At Her Birthday Party",
    "summary": "Natalya has revealed the name of the WWE legend who dressed as Big Bird at her childhood birthday party. Former WWE Women’s Champion Natalya was a guest on The Velvet Ropes podcast to talk about her...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586865-natalya-reveals-which-wwe-legend-dressed-as-big-bird-at-her-birthday-party",
    "publishedAt": "2025-10-28T17:10:56+00:00",
    "category": "wwe"
  },
  {
    "title": "Mickie James Details WWE Trash Bag Incident",
    "summary": "Following her WWE release in 2021, Mickie James caused a stir on social media when she revealed her belongings were sent to her in a trash bag. Speaking on Insight With Chris Van Vliet, James...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/mickie-james-details-wwe-trash-bag-incident/",
    "publishedAt": "2025-10-28T17:02:29+00:00",
    "category": "wwe"
  },
  {
    "title": "George Kittle: I Need Bayley To Get A Push Again",
    "summary": "Bayley is a big supporter of the San Francisco 49ers, who are led by tight end George Kittle. Kittle is a longtime wrestling fan who has gotten involved in the action at WrestleMania in the past....",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/george-kittle-i-need-bayley-to-get-a-push-again",
    "publishedAt": "2025-10-28T17:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Drew McIntyre Recalls Samoa Joe Pulling Him Aside To Let Him Know He 'Caught Him Real Bad' With A Claymore Kick",
    "summary": "Drew McIntyre recalls some of his nastiest Claymore kicks. Following his initial release and eventual return to WWE, Drew McIntyre would debut a new finish that he continues to use to this day in the...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/drew-mcintyre-recalls-samoa-joe-pulling-him-aside-to-let-him-know-he-caught-him-real-bad-with-a-claymore-kick",
    "publishedAt": "2025-10-28T16:45:24+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Hall Of Famer Mike Rotunda, Father Of Bray Wyatt, Reportedly In Hospice Care",
    "summary": "WWE Hall of Famer Mike Rotunda, aka I.R.S. and the father of Bray Wyatt and Bo Dallas, is said to be in hospice care, according to family and friends",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2009923/wwe-mike-rotunda-hospice-bray-wyatt-bo-dallas/",
    "publishedAt": "2025-10-28T16:36:32+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Hall of Famer Mike Rotunda Enters Hospice Care",
    "summary": "WWE Hall of Famer Mike Rotunda has reportedly been placed into hospice care, according to his longtime tag… The post WWE Hall of Famer Mike Rotunda Enters Hospice Care appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/365625-wwe-hall-of-famer-mike-rotunda-enters-hospice-care/",
    "publishedAt": "2025-10-28T16:22:59+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Plans For Elimination Chamber Weekend Could Reportedly Include NXT & AAA Events",
    "summary": "Next year's Elimination Chamber will take place in Chicago, and WWE reportedly intends to host WWE NXT and AAA events during the same weekend.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2009461/wwe-elimination-chamber-weekend-nxt-aaa/",
    "publishedAt": "2025-10-28T16:00:00+00:00",
    "category": "wwe"
  }
]