[
  {
    "title": "Triple H Releases WWE Saturday Night's Main Event Poster For 11/1 Featuring Top Star",
    "summary": "With Saturday Night's Main Event fast-approaching, Chief Content Officer Paul \"Triple H\" Levesque has taken to social media to advertise a top star for Utah.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1997264/triple-h-wwe-saturday-nights-main-event-poster-november-1-cm-punk/",
    "publishedAt": "2025-10-15T01:00:56+00:00",
    "category": "wwe"
  },
  {
    "title": "Lainey Reid Officially Replaces Jazmyn Nyx In Fatal Influence On WWE NXT",
    "summary": "Lainey Reid is officially a member of Fatal Influence as of the October 14 episode of WWE NXT. After taking out Jazmyn Nyx, the former member of Fatal Influence, and helping Jacy Jayne retain the WWE...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/lainey-reid-officially-replaces-jazmyn-nyx-in-fatal-influence-on-wwe-nxt",
    "publishedAt": "2025-10-15T00:56:15+00:00",
    "category": "wwe"
  },
  {
    "title": "Report: Location, date confirmed for WWE Elimination Chamber in 2026",
    "summary": "Wrestlenomics has confirmed that WWE Elimination Chamber is heading to Chicago on February 28, 2026, following a previous… The post Report: Location, date confirmed for WWE Elimination Chamber in...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/364387-report-location-date-confirmed-for-wwe-elimination-chamber-in-2026/",
    "publishedAt": "2025-10-15T00:55:50+00:00",
    "category": "wwe"
  },
  {
    "title": "Booker T Weighs In On If The Hardys Or Dudleys Are The Greatest Team Of Their Era",
    "summary": "Does tag team expert Booker T believe The Hardys or the Dudley Boyz are the greatest team of their era? On the latest episode of The Hall of Fame Podcast, NXT commentator Booker T spoke about the...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584874-booker-t-weighs-in-on-if-the-hardys-or-dudleys-are-the-greatest-team-of-their-era",
    "publishedAt": "2025-10-15T00:53:05+00:00",
    "category": "wwe"
  },
  {
    "title": "Seth Rollins removed from this weekend’s WWE live events in Japan",
    "summary": "According to the current ticket listing on I-tike.com, Seth Rollins has been removed from the October 17 and… The post Seth Rollins removed from this weekend’s WWE live events in Japan appeared first...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/364381-seth-rollins-removed-from-this-weekends-wwe-live-events-in-japan/",
    "publishedAt": "2025-10-15T00:52:35+00:00",
    "category": "wwe"
  },
  {
    "title": "Seth Rollins Pulled From WWE Japan Tour Amidst Injury Rumors, New Matches Announced",
    "summary": "Fans eager to see Seth Rollins live will have to wait, as \"The Visionary\" has been pulled from WWE's upcoming Japan tour.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1997255/seth-rollins-pulled-wwe-japan-tour-injury-new-matches/",
    "publishedAt": "2025-10-15T00:41:28+00:00",
    "category": "wwe"
  },
  {
    "title": "Josh Briggs Def. Matt Cardona On 10/14 WWE NXT",
    "summary": "Cardona's first WWE bout in five years. The October 14th episode of WWE NXT saw Josh Briggs go one-on-one with Matt Cardona. It was Cardona, the former Zack Ryder's first match under the WWE banner...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/josh-briggs-def-matt-cardona-on-10-14-wwe-nxt",
    "publishedAt": "2025-10-15T00:39:51+00:00",
    "category": "wwe"
  },
  {
    "title": "The Hardys And Dark State Rematch Scheduled For Halloween Havoc",
    "summary": "On the October 14, 2025, edition of WWE NXT, the new NXT Tag Team Champions, The Hardys, announced their first title defense. Matt and Jeff Hardy will face the former champions, Dark State, in a...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/hardys-dark-state-rematch-scheduled-halloween-havoc/",
    "publishedAt": "2025-10-15T00:28:26+00:00",
    "category": "wwe"
  },
  {
    "title": "IYO SKY Reveals Her Strengths And Weaknesses",
    "summary": "IYO SKY gets candid about her strengths and weaknesses. IYO SKY has been on a tear since making her WWE main roster debut at SummerSlam 2022. Her already impressive resume includes reigns as both the...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584826-iyo-sky-reveals-her-strengths-and-weaknesses",
    "publishedAt": "2025-10-15T00:24:04+00:00",
    "category": "wwe"
  },
  {
    "title": "The Hardys vs. DarkState Rematch Set For WWE NXT Halloween Havoc",
    "summary": "The rematch is locked in. Coming up on October 25th from Findlay Toyota Center in Prescott Valley, Arizona, is NXT's Halloween Havoc Premium Live Event. The 10/14 episode of WWE NXT on The CW was a...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/the-hardys-vs-darkstate-rematch-set-for-wwe-nxt-halloween-havoc",
    "publishedAt": "2025-10-15T00:22:59+00:00",
    "category": "wwe"
  },
  {
    "title": "Former WWE Talent Issues Statement On Her Release",
    "summary": "Stevie Turner, who most recently served as the on-screen General Manager of WWE’s Evolve brand, has announced that her contract with WWE will not be renewed. In a statement posted to her social...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/former-wwe-talent-issues-statement-her-release/",
    "publishedAt": "2025-10-15T00:17:01+00:00",
    "category": "wwe"
  },
  {
    "title": "Tony Schiavone Explains Why He Has No Interest In Watching The Current WWE Product",
    "summary": "AEW commentator Tony Schiavone explains why he isn’t interested in watching the current WWE product right now. On the latest episode of What Happened When, former WCW and current AEW commentator Tony...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584862-tony-schiavone-explains-why-he-has-no-interest-in-watching-the-current-wwe-product",
    "publishedAt": "2025-10-15T00:15:01+00:00",
    "category": "wwe"
  },
  {
    "title": "Grayson Waller: Shawn Michaels And NXT Know To Look At Australia For Talent",
    "summary": "Grayson Waller comments on the massive wave of Australian talent taking over professional wrestling. Whether in WWE, TNA, or elsewhere, Australian wrestlers have taken over the scene in recent years....",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/grayson-waller-shawn-michaels-and-nxt-know-to-look-at-australia-for-talent",
    "publishedAt": "2025-10-15T00:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Bully Ray Addresses Uncertainty Of Seth Rollins Injury Following WWE Raw Beatdown",
    "summary": "WWE Hall of Famer Bully Ray addresses his uncertainty over the recent shoulder injury reportedly sustained by WWE star Seth Rollins.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1997229/wwe-raw-bully-ray-seth-rollins-injury-uncertainty/",
    "publishedAt": "2025-10-14T23:57:20+00:00",
    "category": "wwe"
  },
  {
    "title": "Grayson Waller: Logan Paul Isn't Trying To Take Away From WWE Stars, He Genuinely Cares",
    "summary": "Grayson Waller comments on comparisons between himself and Logan Paul. Grayson Waller and Logan Paul are both loud, self-confident, and driven WWE Superstars. However, Waller's dedication to WWE is...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/grayson-waller-logan-paul-isnt-trying-to-take-away-from-wwe-stars-he-genuinely-cares",
    "publishedAt": "2025-10-14T23:47:04+00:00",
    "category": "wwe"
  }
]