[
  {
    "title": "Videos: Full Event Crockett Cups From 1986 And 1987",
    "summary": "The WCW YouTube Channel has posted full NWA Crockett Cup events from 1986 and 1987. The 1986 Crockett… The post Videos: Full Event Crockett Cups From 1986 And 1987 appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/364590-videos-full-event-crockett-cups-from-1986-and-1987/",
    "publishedAt": "2025-10-16T05:20:44+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Vault Video – Full Match: The Rockers vs. Brain Busters",
    "summary": "WWE Vault has posted the full match between The Rockers (Shawn Michaels and Marty Jannetty) and the Brain… The post WWE Vault Video – Full Match: The Rockers vs. Brain Busters appeared first on WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/364587-wwe-vault-video-full-match-the-rockers-vs-brain-busters/",
    "publishedAt": "2025-10-16T05:03:29+00:00",
    "category": "wwe"
  },
  {
    "title": "Report on the absence of Andrade since returning to AEW",
    "summary": "Fightful Select has posted an update on the whereabouts of Andrade since making his surprise return to AEW,… The post Report on the absence of Andrade since returning to AEW appeared first on WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/364534-report-on-the-absence-of-andrade-since-returning-to-aew/",
    "publishedAt": "2025-10-16T02:54:08+00:00",
    "category": "wwe"
  },
  {
    "title": "DDP: Vince McMahon Pitched The Stalker Angle With My Wife In The Room",
    "summary": "When Diamond Dallas Page arrived in WWE in 2001 after the purchase of WCW, fans anticipated a main event run for the former three-time world champion. Instead, he was famously booked in a storyline...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/ddp-vince-mcmahon-pitched-stalker-angle-wife-room/",
    "publishedAt": "2025-10-16T02:03:03+00:00",
    "category": "wwe"
  },
  {
    "title": "Former WWE Star Maven Huffman Exposes Scammer Attempting To Defraud Fans On His YouTube Channel",
    "summary": "Former WWE Tough Enough winner Maven Huffman recently uncovered a scammer using his name to solicit money from fans and took matters into his own hands to expose the fraud. In a video uploaded to his...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/former-wwe-star-maven-huffman-exposes-scammer-attempting-defraud-fans-his-youtube-channel/",
    "publishedAt": "2025-10-16T01:40:48+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE announces new ID prospects coming, to be revealed on EVOLVE soon",
    "summary": "WWE has posted a new video to their X account, announcing new WWE ID prospects are coming soon… The post WWE announces new ID prospects coming, to be revealed on EVOLVE soon appeared first on WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/364491-wwe-announces-new-id-prospects-coming-to-be-revealed-on-evolve-soon/",
    "publishedAt": "2025-10-16T01:18:44+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE EVOLVE Succession Results (10/15): Two Title Bouts",
    "summary": "WWE aired WWE EVOLVE Succession on October 15 on Tubi. Matches were taped at the WWE Performance Center in Orlando, FL. Full results and highlights are below. WWE EVOLVE Succession Results (10/15)...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/wwe-evolve-succession-results-10-15-two-title-bouts",
    "publishedAt": "2025-10-16T01:12:42+00:00",
    "category": "wwe"
  },
  {
    "title": "Jeff Jarrett Reflects On Past And Future Of WWE HOF",
    "summary": "AEW star Jeff Jarrett has discussed who chose Hall of Fame inductees during Vince McMahon's tenure and commented on the absence of a physical Hall of Fame.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1991427/jeff-jarrett-reflects-past-future-wwe-hof/",
    "publishedAt": "2025-10-16T01:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "The Miz Reveals Shane McMahon’s Wild Pitch For Their WrestleMania 35 Match",
    "summary": "The Miz and Shane McMahon put on a show at WrestleMania 35 in a wild Falls Count Anywhere Match. According to Miz, though, McMahon had even crazier ideas for what could happen. Speaking during a...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585094-the-miz-reveals-shane-mcmahons-wild-pitch-for-their-wrestlemania-35-match",
    "publishedAt": "2025-10-16T00:21:45+00:00",
    "category": "wwe"
  },
  {
    "title": "AJ Styles Gives Heartfelt Farewell To The Australian WWE Universe",
    "summary": "AJ Styles gives an emotional farewell address to the WWE Universe in Australia. The Phenomenal One has made it clear that 2026 will be his final year as an active professional wrestler. He explained...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585057-aj-styles-gives-heartfelt-farewell-to-the-australian-wwe-universe",
    "publishedAt": "2025-10-15T23:33:51+00:00",
    "category": "wwe"
  },
  {
    "title": "New WWE ID Prospects Are Coming Soon",
    "summary": "WWE has announced that the next group of signees for its “WWE ID” program will be revealed soon on WWE EVOLVE. The initiative serves as a developmental pathway for independent wrestlers, with...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/new-wwe-prospects-coming-soon/",
    "publishedAt": "2025-10-15T23:30:20+00:00",
    "category": "wwe"
  },
  {
    "title": "Booker T Says This WWE Star’s Success Is Something That “Doesn’t Happen”",
    "summary": "WWE Hall of Famer Booker T shared immense praise for Stephanie Vaquer, expressing how impressed he has been with her rapid rise and success since joining WWE. The conversation arose from a fan...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/booker-says-wwe-stars-success-something-doesnt-happen/",
    "publishedAt": "2025-10-15T23:28:48+00:00",
    "category": "wwe"
  },
  {
    "title": "Ethan Page Isn’t Happy About His Match At WWE NXT Halloween Havoc",
    "summary": "Ethan Page had no problem defending his title at WWE NXT Halloween Havoc — until he heard the match stipulation. The self-proclaimed Greatest North American of All Time will put his title on the line...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585063-ethan-page-isnt-happy-about-his-match-at-wwe-nxt-halloween-havoc",
    "publishedAt": "2025-10-15T23:27:43+00:00",
    "category": "wwe"
  },
  {
    "title": "Bron Breakker enforces ‘No Yeet Zone’ at WWE live event",
    "summary": "WWE posted a video on social media looking back at a recent live event, with a moment that… The post Bron Breakker enforces ‘No Yeet Zone’ at WWE live event appeared first on WWE News, WWE Results,...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/364448-bron-breakker-enforces-no-yeet-zone-at-wwe-live-event/",
    "publishedAt": "2025-10-15T23:18:29+00:00",
    "category": "wwe"
  },
  {
    "title": "Samoa Joe Responds To AJ Styles Paying Tribute To Him At WWE Crown Jewel",
    "summary": "Samoa Joe thinks AJ Styles‘ tribute to him at WWE Crown Jewel was incredibly cool. The Phenomenal One took on John Cena in their fifth and final singles encounter at the October 11 premium live event...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585046-samoa-joe-responds-to-aj-styles-paying-tribute-to-him-at-wwe-crown-jewel",
    "publishedAt": "2025-10-15T23:18:26+00:00",
    "category": "wwe"
  }
]