[
  {
    "title": "Report: Update on WWE return for former champion",
    "summary": "Bodyslam has provided an update on Zoey Stark, following a knee injury she sustained in May. The former… The post Report: Update on WWE return for former champion appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/366634-report-update-on-wwe-return-for-former-champion/",
    "publishedAt": "2025-11-10T04:36:30+00:00",
    "category": "wwe"
  },
  {
    "title": "Ken Anderson On Possibly Working With AEW: 'I Still Have Gas In The Tank And I Feel Like There Is Some Opportunities There With Some People'",
    "summary": "Ken Anderson wouldn't say no to an AEW opportunity if it ever pops up in the future. Anderson was one of the highly anticipated names in WWE in the late 2000s. Many saw him as a future World Champion...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/ken-anderson-on-possibly-working-with-aew-i-still-have-gas-in-the-tank-and-i-feel-like-there-is-some-opportunities-there-with-some-people",
    "publishedAt": "2025-11-10T03:57:55+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE VAULT – FULL HOME VIDEO: Crunch Classic with “Rowdy” Roddy Piper, The Natural Disasters and more!",
    "summary": "WWE Vault has posted a classic Home Video with action from the Crunch Classic! “Rowdy” Roddy Piper presents… The post WWE VAULT – FULL HOME VIDEO: Crunch Classic with “Rowdy” Roddy Piper, The Natural...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/366629-wwe-vault-full-home-video-crunch-classic-with-rowdy-roddy-piper-the-natural-disasters-and-more/",
    "publishedAt": "2025-11-10T03:29:11+00:00",
    "category": "wwe"
  },
  {
    "title": "Ricky Saints Names His Dream Opponents In WWE",
    "summary": "Ricky Saints named a few WWE superstars he'd like to work against in the future. Saints was a recent guest on The Five Count show, where he discussed his transition from AEW to WWE, among other...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/ricky-saints-names-his-dream-opponents-in-wwe",
    "publishedAt": "2025-11-10T02:07:04+00:00",
    "category": "wwe"
  },
  {
    "title": "Ricky Saints: I Would Love To Win The NXT Tag Team Championships And Become A Triple Crown Champion",
    "summary": "Ricky Saints has been thriving in NXT since his debut earlier this year. Speaking on The Five Count recently, Ricky Saints talked about his future goals in WWE. Saints said that he'd like to win the...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/ricky-saints-i-would-love-to-win-the-nxt-tag-team-championships-and-become-a-triple-crown-champion",
    "publishedAt": "2025-11-10T01:51:04+00:00",
    "category": "wwe"
  },
  {
    "title": "Matt Hardy: Vince McMahon Tried To Make WWE As Affordable As He Possibly Could",
    "summary": "Matt Hardy has shared his thoughts regarding the recent WWE ticket prices and agreed they're going off the rails. Speaking on The Extreme Life Of Matt Hardy podcast, his co-host Jon Alba asked Matt...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/matt-hardy-vince-mcmahon-tried-to-make-wwe-as-affordable-as-he-possibly-could",
    "publishedAt": "2025-11-10T00:41:02+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW talent makes surprise appearance in Rome",
    "summary": "Mercedes Moné recently defended the BestYa Women’s Championship against Queen Maya at a show in Rome, Italy. Toward… The post AEW talent makes surprise appearance in Rome appeared first on WWE News,...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/aew-news/366617-aew-talent-makes-surprise-appearance-in-rome/",
    "publishedAt": "2025-11-09T23:09:27+00:00",
    "category": "wwe"
  },
  {
    "title": "John Cena Would Go Back In Time For WrestleMania Match With This WWE HOFer",
    "summary": "John Cena reveals that if he could, he would go back in time to have this WrestleMania match with a WWE Hall of Famer and one of the most famous wrestlers ever",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2018263/john-cena-wrestlemania-match-wwe-andre-the-giant/",
    "publishedAt": "2025-11-09T22:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Charlotte Flair Hilariously Reacts To Wardrobe Malfunction On WWE SmackDown",
    "summary": "Charlotte Flair had a hilarious reaction to a wardrobe malfunction that the star had in a recent appearance. During her match against Nia Jax on Friday’s episode of WWE SmackDown, the TV broadcast...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1589844-charlotte-flair-hilariously-reacts-to-wardrobe-malfunction-on-wwe-smackdown",
    "publishedAt": "2025-11-09T22:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Hall Of Famer Rates John Cena's Retirement Run, Speculates On Final Opponent",
    "summary": "WWE Hall of Famer Rikishi rates the retirement run of John Cena and further speculates on who his final opponent could be.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2019360/wwe-rikishi-john-cena-retirement-run-final-opponent/",
    "publishedAt": "2025-11-09T21:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Rap star says he is done supporting WWE over poor treatment, getting kicked out of Raw",
    "summary": "Rap star and longtime WWE fan, Westside Gunn posting a lengthy statement to X Sunday, saying his is… The post Rap star says he is done supporting WWE over poor treatment, getting kicked out of Raw...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/366611-rap-star-says-he-is-done-supporting-wwe-over-poor-treatment-getting-kicked-out-of-raw/",
    "publishedAt": "2025-11-09T20:54:49+00:00",
    "category": "wwe"
  },
  {
    "title": "Matt Hardy On WWE Ticket Sales: The Product Is Not ‘White Hot’",
    "summary": "Matt Hardy shared his perspective on the recent reports of WWE’s declining live event attendance, noting several factors that could be contributing to the decline. During The Extreme Life of Matt...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/matt-hardy-wwe-ticket-sales-product-not-white-hot/",
    "publishedAt": "2025-11-09T20:35:29+00:00",
    "category": "wwe"
  },
  {
    "title": "John Cena to kick off WWE Monday Night Raw",
    "summary": "WWE Raw airs live globally on Netflix, Monday from TD Garden in Boston, Massachusetts beginning at 8:00 pm… The post John Cena to kick off WWE Monday Night Raw appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/top-story/366602-john-cena-to-kick-off-wwe-monday-night-raw/",
    "publishedAt": "2025-11-09T20:30:33+00:00",
    "category": "wwe"
  },
  {
    "title": "Grayson Waller Reveals He's Not A Fan Of WWE Unreal",
    "summary": "Grayson Waller shares why he didn't take a liking to the Netflix series \"WWE Unreal,\" explains that enjoys the mystery behind professional wrestling.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2019088/grayson-waller-reveals-not-fan-wwe-unreal/",
    "publishedAt": "2025-11-09T20:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Former WWE Star FKA Ridge Holland Pulls GoFundMe Following Backlash",
    "summary": "Former WWE star Ridge Holland calls for his GoFundMe to be removed after it stirred backlash on social media.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2021284/former-wwe-star-ridge-holland-gofundme-backlash/",
    "publishedAt": "2025-11-09T20:03:32+00:00",
    "category": "wwe"
  }
]