[
  {
    "title": "6 Booking Mistakes Haunting The Triple H Era",
    "summary": "WWE fans have not been universally pleased with the creative decisions coming from the Cerebral Assassin.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1976549/wwe-booking-mistakes-triple-h-era/",
    "publishedAt": "2025-09-25T18:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Shotzi Blackheart On WWE Departure: I Always Thought Triple H Really Believed In Me, It Was A Little Disappointing",
    "summary": "Shotzi Blackheart didn’t get a chance to show her fire. Blackheart made her return to the indie scene in June 2025, just a few weeks after her contract with WWE expired. The departure came as a...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/shotzi-blackheart-triple-h-257442",
    "publishedAt": "2025-09-25T17:59:06+00:00",
    "category": "wwe"
  },
  {
    "title": "Logan Paul’s Official WWE Roster Status Revealed",
    "summary": "A new report has shed light on the official internal roster status of the current WWE United States Champion, Logan Paul. According to WrestleVotes Radio, the social media megastar is listed...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/logan-pauls-official-wwe-roster-status-revealed/",
    "publishedAt": "2025-09-25T17:52:14+00:00",
    "category": "wwe"
  },
  {
    "title": "Charlotte Flair Gives Her Take On What It Takes To Be A Great WWE Superstar",
    "summary": "Charlotte Flair shares her thoughts on what makes a great WWE Superstar. Charlotte Flair is a trailblazer and a history-maker. While she had to struggle for some time in her father Ric Flair's...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/charlotte-flair-gives-her-take-on-what-it-takes-to-be-a-great-wwe-superstar",
    "publishedAt": "2025-09-25T17:30:21+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Champ Tiffany Stratton Offers Injury Update Ahead Of Scheduled SmackDown Defense",
    "summary": "WWE Women's Champion Tiffany Stratton gives an update on her injury status ahead of tomorrow's triple threat against Jade Cargill and Nia Jax on \"SmackDown.\"",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1978593/wwe-smackdown-tiffany-stratton-injury-update-defense-nia-jax-jade-cargill/",
    "publishedAt": "2025-09-25T17:14:03+00:00",
    "category": "wwe"
  },
  {
    "title": "There Were People In WWE Reportedly “Stunned” By ESPN’s “C” Grade For Wrestlepalooza",
    "summary": "The inaugural WWE Wrestlepalooza premium live event was a major business milestone for the company, but it was not a critical success in the eyes of their new broadcast partner, ESPN, and that has...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/there-people-wwe-reportedly-stunned-espns-grade-wrestlepalooza/",
    "publishedAt": "2025-09-25T17:10:18+00:00",
    "category": "wwe"
  },
  {
    "title": "The Miz Was Shocked CM Punk Apologized To Him In 2023, Says Punk Seems Happy Now",
    "summary": "In April 2023, CM Punk showed up backstage to WWE Raw in Chicago despite still being under contract to AEW. While backstage, Punk apologized to The Miz, whom he had previously called out over WWE's...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/the-miz-was-shocked-cm-punk-apologized-to-him-in-2023-says-punk-seems-happy-now",
    "publishedAt": "2025-09-25T17:03:44+00:00",
    "category": "wwe"
  },
  {
    "title": "REPORT: Brock Lesnar Scheduled For Major 2026 WWE Events",
    "summary": "Brock Lesnar’s destructive return at WWE SummerSlam was just the beginning, as “The Beast Incarnate” is tentatively scheduled to be a part of the two biggest WWE events of early 2026. According to a...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/report-brock-lesnar-scheduled-major-2026-wwe-events/",
    "publishedAt": "2025-09-25T17:00:54+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE To Announce John Cena’s Final Match Details Soon",
    "summary": "The details surrounding John Cena’s final match are expected to be announced by WWE within the coming week, with a potential announcement as early as this Sunday, September 28. According to a report...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-announce-john-cenas-final-match-details-soon/",
    "publishedAt": "2025-09-25T16:54:11+00:00",
    "category": "wwe"
  },
  {
    "title": "Top WWE Star Shares Excitement For WrestleMania 43 In Saudi Arabia",
    "summary": "Tiffany Stratton is excited for WWE WrestleMania 43 taking place in Saudi Arabia. WWE announced a few weeks ago that the event will be held outside the U.S. for the first time. To make the...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1580943-top-wwe-star-reacts-wrestlemania-43-saudi-arabia",
    "publishedAt": "2025-09-25T16:27:22+00:00",
    "category": "wwe"
  },
  {
    "title": "The Rock: Tom Aspinall Would Be A Great WWE Performer, I'll Rock Bottom His Candy Ass",
    "summary": "The Rock responds to Tom Aspinall. Earlier this week, UFC's Tom Aspinall made some headlines after saying that he would choose to wrestle The Rock if he had the opportunity to have one match in WWE....",
    "source": "Fightful",
    "url": "https://www.fightful.com/mma/the-rock-tom-aspinall-wwe-257408",
    "publishedAt": "2025-09-25T16:22:18+00:00",
    "category": "wwe"
  },
  {
    "title": "Backstage Update On TNA Star Masha Slamovich's Potential Future",
    "summary": "Several reports have emerged regarding the TNA and WWE positions on Masha Slamovich after she was accused of domestic violence on social media this week.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1978516/update-tna-wwe-nxt-star-masha-slamovich-potential-future/",
    "publishedAt": "2025-09-25T16:18:22+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW Files For Bacon-Related Trademarks",
    "summary": "You’ve heard of the AEW Tailgate Brawl. Now get ready for a… Bacon Brawl? AEW filed to trademark “AEW Bacon Brawl” on September 24. The mark, along with the similar “Bacon Brawl,” would be used for...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1581157-aew-files-for-bacon-related-trademarks",
    "publishedAt": "2025-09-25T15:39:42+00:00",
    "category": "wwe"
  },
  {
    "title": "AJ Styles vs. John Cena Was Planned For WWE Crown Jewel Longer Than You Think",
    "summary": "On the surface, the final match between John Cena and AJ Styles seems to have come about after the former gauged interest from fans online. According to a new report, however, internal plans for this...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1581134-how-long-aj-styles-vs-john-cena-planned-wwe-crown-jewel",
    "publishedAt": "2025-09-25T15:18:15+00:00",
    "category": "wwe"
  },
  {
    "title": "Former WWE NXT Star Hints At How Low Their Salary Was",
    "summary": "Jazmyn Nyx recently announced she was leaving WWE, and the financial terms of a new contract influenced her decision. Now, a new response to her announcement hints at how much she was actually making...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1581150-former-wwe-nxt-star-how-low-their-salary-was",
    "publishedAt": "2025-09-25T15:14:46+00:00",
    "category": "wwe"
  }
]