[
  {
    "title": "Jeff Jarrett Reflects On Past And Future Of WWE HOF",
    "summary": "AEW star Jeff Jarrett has discussed who chose Hall of Fame inductees during Vince McMahon's tenure and commented on the absence of a physical Hall of Fame.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1991427/jeff-jarrett-reflects-past-future-wwe-hof/",
    "publishedAt": "2025-10-16T01:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "The Miz Reveals Shane McMahon’s Wild Pitch For Their WrestleMania 35 Match",
    "summary": "The Miz and Shane McMahon put on a show at WrestleMania 35 in a wild Falls Count Anywhere Match. According to Miz, though, McMahon had even crazier ideas for what could happen. Speaking during a...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585094-the-miz-reveals-shane-mcmahons-wild-pitch-for-their-wrestlemania-35-match",
    "publishedAt": "2025-10-16T00:21:45+00:00",
    "category": "wwe"
  },
  {
    "title": "AJ Styles Gives Heartfelt Farewell To The Australian WWE Universe",
    "summary": "AJ Styles gives an emotional farewell address to the WWE Universe in Australia. The Phenomenal One has made it clear that 2026 will be his final year as an active professional wrestler. He explained...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585057-aj-styles-gives-heartfelt-farewell-to-the-australian-wwe-universe",
    "publishedAt": "2025-10-15T23:33:51+00:00",
    "category": "wwe"
  },
  {
    "title": "New WWE ID Prospects Are Coming Soon",
    "summary": "WWE has announced that the next group of signees for its “WWE ID” program will be revealed soon on WWE EVOLVE. The initiative serves as a developmental pathway for independent wrestlers, with...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/new-wwe-prospects-coming-soon/",
    "publishedAt": "2025-10-15T23:30:20+00:00",
    "category": "wwe"
  },
  {
    "title": "Booker T Says This WWE Star’s Success Is Something That “Doesn’t Happen”",
    "summary": "WWE Hall of Famer Booker T shared immense praise for Stephanie Vaquer, expressing how impressed he has been with her rapid rise and success since joining WWE. The conversation arose from a fan...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/booker-says-wwe-stars-success-something-doesnt-happen/",
    "publishedAt": "2025-10-15T23:28:48+00:00",
    "category": "wwe"
  },
  {
    "title": "Ethan Page Isn’t Happy About His Match At WWE NXT Halloween Havoc",
    "summary": "Ethan Page had no problem defending his title at WWE NXT Halloween Havoc — until he heard the match stipulation. The self-proclaimed Greatest North American of All Time will put his title on the line...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585063-ethan-page-isnt-happy-about-his-match-at-wwe-nxt-halloween-havoc",
    "publishedAt": "2025-10-15T23:27:43+00:00",
    "category": "wwe"
  },
  {
    "title": "Bron Breakker enforces ‘No Yeet Zone’ at WWE live event",
    "summary": "WWE posted a video on social media looking back at a recent live event, with a moment that… The post Bron Breakker enforces ‘No Yeet Zone’ at WWE live event appeared first on WWE News, WWE Results,...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/364448-bron-breakker-enforces-no-yeet-zone-at-wwe-live-event/",
    "publishedAt": "2025-10-15T23:18:29+00:00",
    "category": "wwe"
  },
  {
    "title": "Samoa Joe Responds To AJ Styles Paying Tribute To Him At WWE Crown Jewel",
    "summary": "Samoa Joe thinks AJ Styles‘ tribute to him at WWE Crown Jewel was incredibly cool. The Phenomenal One took on John Cena in their fifth and final singles encounter at the October 11 premium live event...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585046-samoa-joe-responds-to-aj-styles-paying-tribute-to-him-at-wwe-crown-jewel",
    "publishedAt": "2025-10-15T23:18:26+00:00",
    "category": "wwe"
  },
  {
    "title": "Booker T Moves Reality Of Wrestling Event To Avoid John Cena’s Final Match",
    "summary": "Booker T has pushed back a major Reality of Wrestling event for John Cena‘s retirement match WWE has announced that Cena’s farewell match will headline Saturday Night’s Main Event in Washington,...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585034-booker-t-moves-reality-of-wrestling-event-to-avoid-john-cena-final-match",
    "publishedAt": "2025-10-15T23:10:02+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Hall Of Fame Bret Hart Joins Community To Celebrate Naming Of Stu Hart Memorial Bridge",
    "summary": "The Province of Alberta has officially named a new bridge on Highway 8 the “Stu Hart Memorial Bridge,” creating a permanent monument to the patriarch of the Hart wrestling dynasty and founder of...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-hall-fame-bret-hart-joins-community-celebrate-naming-stu-hart-memorial-bridge/",
    "publishedAt": "2025-10-15T22:55:32+00:00",
    "category": "wwe"
  },
  {
    "title": "The Miz Says Shane McMahon Originally Wanted To Go Higher With WrestleMania 35 Suplex Spot",
    "summary": "The Miz says Shane McMahon wanted their WrestleMania 35 spot to be even bigger. The heated rivalry between Miz and McMahon accelerated at WrestleMania 35, as they faced off in a Falls Count Anywhere...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/the-miz-shane-mcmahon-wrestlemania-35-262083",
    "publishedAt": "2025-10-15T22:47:37+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE's CM Punk To Intruders On Wrestler Privacy: 'You Are Not A Fan, You Are A Stalker'",
    "summary": "For the second time in a year, WWE's CM Punk makes a statement on fans invading wrestler's privacies, telling them they aren't fans, but stalkers",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1998203/wwe-cm-punk-wrestler-privacy-fan-stalker/",
    "publishedAt": "2025-10-15T22:38:39+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Hall Of Famer Believes It’s Time For AJ Styles To ‘Wrap It Up’ And Call It A Career",
    "summary": "AJ Styles has stated numerous times that he plans to retire in 2026, and one WWE Hall of Famer agrees that it’s time The Phenomenal One calls it a career. On the latest episode of The Hall of Fame...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585075-wwe-hall-of-famer-believes-its-time-for-aj-styles-to-wrap-it-up-and-call-it-a-career",
    "publishedAt": "2025-10-15T22:26:54+00:00",
    "category": "wwe"
  },
  {
    "title": "Casket Match Set For Shotzi Blackheart's House Of Horrors, WWE NXT Highlights, More | Fight Size",
    "summary": "Here is your fight size update for Wednesday, October 15, 2025. - A casket match will go down as Shotzi Blackheart's/GCW House Of Horrors: https://twitter.com/GCWrestling_/status/1978271369491030135...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/casket-match-set-for-shotzi-blackhearts-house-of-horrors-wwe-nxt-highlights-more-fight-size",
    "publishedAt": "2025-10-15T22:06:26+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Says New ID Prospects Are Coming Soon",
    "summary": "The next wave of WWE ID prospects are coming soon. WWE announced that new ID rospects will be announced soon on WWE EVOLVE. ID prospects consistently appear on EVOLVE, with some competing on NXT....",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/wwe-says-new-id-prospects-are-coming-soon",
    "publishedAt": "2025-10-15T21:46:33+00:00",
    "category": "wwe"
  }
]