[
  {
    "title": "Former WWE Star Explains Why Triple H Doesn’t Like Him",
    "summary": "Maven has finally explained why Triple H doesn’t like him. Huffman entered WWE by winning the first season of Tough Enough and stayed with the promotion until 2005. During his time, Maven shared the...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591672-former-wwe-star-why-triple-h-doesnt-like-him",
    "publishedAt": "2025-11-20T00:45:59+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE's Bayley Guest Coaches At Mustafa Ali's Wrestling School",
    "summary": "Bayley and Mustafa Ali reunite. It was in November 2024 that Mustafa Ali opened up his Chicago Wrestling Center in Niles, Illinois. The wrestling school is a year into its operation, and Ali brought...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/wwes-bayley-guest-coaches-at-mustafa-alis-wrestling-school",
    "publishedAt": "2025-11-20T00:38:28+00:00",
    "category": "wwe"
  },
  {
    "title": "Maya World And Hyan Have Drawn Great Interest From AEW",
    "summary": "Details on Maya World and Hyan drawing interest from AEW. Fightful Select reports that Maya World and Hyan have not signed with AEW, but they are drawing great interest from the company. More details...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/maya-world-and-hyan-have-drawn-great-interest-from-aew",
    "publishedAt": "2025-11-20T00:34:58+00:00",
    "category": "wwe"
  },
  {
    "title": "MLW set to relocate headquarters",
    "summary": "The Post & Courier has reported that Major League Wrestling is relocating its headquarters to Charleston, North Carolina.… The post MLW set to relocate headquarters appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/misc-news/367514-mlw-set-to-relocate-headquarters/",
    "publishedAt": "2025-11-20T00:30:08+00:00",
    "category": "wwe"
  },
  {
    "title": "NFL New York Giants Interim Head Coach Discusses Cam Skattebo's WWE Raw Appearance, Says He Trusts Skattebo Despite Him Being Injured",
    "summary": "The Giants' interim head coach weighs in. Monday Night Raw emanated from Madison Square Garden in New York City on November 17th. There was a ringside segment where comedian/actor Andrew Schulz was...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/nfl-new-york-giants-interim-head-coach-discusses-cam-skattebos-wwe-raw-appearance-says-he-trusts-skattebo-despite-him-being-injured",
    "publishedAt": "2025-11-20T00:23:11+00:00",
    "category": "wwe"
  },
  {
    "title": "CM Punk Comments On Zack Ryder And Dolph Ziggler Taking Part In The Last Time Is Now Tournament",
    "summary": "CM Punk comments on the WWE returns of Dolph Ziggler and Zack Ryder. Ryder and Ziggler both made their long-awaited returns to the company by taking part in The Last Time Is Now tournament. Ryder...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/270103",
    "publishedAt": "2025-11-19T23:32:32+00:00",
    "category": "wwe"
  },
  {
    "title": "Update on arrests made in murder of former NXT talent",
    "summary": "5News in Arkansas has reported that two people have been arrested in connection with the death of retired… The post Update on arrests made in murder of former NXT talent appeared first on WWE News,...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/367511-update-on-arrests-made-in-murder-of-former-nxt-talent/",
    "publishedAt": "2025-11-19T23:31:02+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE SmackDown Viewership & Demo Revealed For 11/14 Episode",
    "summary": "WWE SmackDown saw an increase in viewership on November 14. According to Wrestlenomics, SmackDown averaged 1.158 million viewers on Friday. The show drew a 0.27 rating in the 18 to 49 demographic....",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1590969-wwe-smackdown-viewership-demo-revealed-for-11-14-episode",
    "publishedAt": "2025-11-19T23:16:12+00:00",
    "category": "wwe"
  },
  {
    "title": "CM Punk Says Being World Champion No Longer Equals Higher Pay In WWE",
    "summary": "CM Punk Discusses Positive and Negative Effects of WWE’s New Pay Structure Current World Heavyweight Champion CM Punk recently opened up about the significant changes to WWE’s pay structure since his...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/punk-says-being-world-champion-longer-equals-higher-pay-wwe/",
    "publishedAt": "2025-11-19T23:04:40+00:00",
    "category": "wwe"
  },
  {
    "title": "Alexa Bliss Responds To Viral Luka Doncic-Austin Reaves Video, WWE NXT Highlights | Fight Size",
    "summary": "Here is your fight size update for Wednesday, November 19, 2025. - Alexa Bliss took to social media to relate to Luka Doncic and Austin Reaves:...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/alexa-bliss-responds-to-viral-luka-doncic-austin-reaves-video-wwe-nxt-highlights-fight-size",
    "publishedAt": "2025-11-19T23:03:10+00:00",
    "category": "wwe"
  },
  {
    "title": "CM Punk Jokes That Zohran Mamdani Is Why He's Free Despite Police Brawl On WWE Raw",
    "summary": "CM Punk jokes that newly elected NYC mayor, and wrestling fan, Zohran Mamdani, is the reason Punk is walking free despite police brawl on WWE Raw",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2031385/cm-punk-zohran-mamdani-free-police-brawl-wwe-raw/",
    "publishedAt": "2025-11-19T22:54:26+00:00",
    "category": "wwe"
  },
  {
    "title": "Eric Andre Takes No Blame For Becky Lynch Losing WWE Women's IC Title",
    "summary": "Becky Lynch lost the WWE Women's Intercontinental Title on Monday's Raw to Maxxine Dupri. The finish saw AJ Lee return to distract Lynch, allowing Maxxine to hit a crossbody off the top for the three...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/eric-andre-takes-no-blame-for-becky-lynch-losing-wwe-womens-ic-title",
    "publishedAt": "2025-11-19T22:44:02+00:00",
    "category": "wwe"
  },
  {
    "title": "Bully Ray Hints At Animosity Between Brock Lesnar & CM Punk After WWE Raw Conclusion",
    "summary": "Bully Ray hinted at possible animosity between Brock Lesnar and CM Punk, based on how Lesnar hit the World Heavyweight Champion with a move on \"WWE Raw.\"",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2031372/wwe-raw-bully-ray-cm-punk-brock-lesnar-animosity/",
    "publishedAt": "2025-11-19T22:37:06+00:00",
    "category": "wwe"
  },
  {
    "title": "CM Punk Says He Is “Literally Having The Time Of My Life” Since WWE Return",
    "summary": "CM Punk made a major announcement regarding WWE’s future schedule during an appearance on WGN News in Chicago today. The World Heavyweight Champion revealed that WWE Elimination Chamber is set to...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/punk-says-literally-having-time-life-since-wwe-return/",
    "publishedAt": "2025-11-19T22:24:15+00:00",
    "category": "wwe"
  },
  {
    "title": "CM Punk honors John Cena after WWE Raw in NYC",
    "summary": "WWE has uploaded footage from after WWE Raw went off the air on 11/19, in which CM Punk… The post CM Punk honors John Cena after WWE Raw in NYC appeared first on WWE News, WWE Results, AEW News, AEW...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/367504-cm-punk-honors-john-cena-after-wwe-raw-in-nyc/",
    "publishedAt": "2025-11-19T22:19:07+00:00",
    "category": "wwe"
  }
]