[
  {
    "title": "Moose Hopes Ridge Holland Makes It Back To TNA",
    "summary": "On Monday afternoon, Ridge Holland announced that his WWE contract would not be renewed when it expires on November 14. Holland is currently sidelined for another six months with a Lisfranc injury...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/moose-hopes-ridge-holland-makes-it-back-to-tna",
    "publishedAt": "2025-10-14T00:46:25+00:00",
    "category": "wwe"
  },
  {
    "title": "Aleister Black And Zelina Vega On Getting Advice From Undertaker, The Rock, And Triple H",
    "summary": "In a recent interview with Robbie and Carly, WWE superstars Aleister Black and Zelina Vega offered insights into their life in and out of the ring, discussing everything from the grueling travel...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/aleister-black-zelina-vega-getting-advice-undertaker-rock-triple/",
    "publishedAt": "2025-10-14T00:00:54+00:00",
    "category": "wwe"
  },
  {
    "title": "Lineup Announced For Women's Battle Royal On 10/14 WWE NXT",
    "summary": "A new number one contender for the NXT Women's Championship will be crowned on Tuesday's WWE NXT as women from NXT and TNA compete in a battle royal. WWE announced the following participants for the...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/lineup-announced-for-womens-battle-royal-on-10-14-wwe-nxt",
    "publishedAt": "2025-10-13T23:51:15+00:00",
    "category": "wwe"
  },
  {
    "title": "Seth Rollins Injury At WWE Crown Jewel Reportedly Led To Shocking Vision Angle On Raw",
    "summary": "A major update on why The Vision jettisoned WWE World Heavyweight Champion Seth Rollins.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1995888/seth-rollins-injury-wwe-crown-jewel-shocking-vision-angle-raw/",
    "publishedAt": "2025-10-13T23:06:56+00:00",
    "category": "wwe"
  },
  {
    "title": "The Rock Discusses Jason Kelce's WrestleMania XL Appearance, Gives It A 9.9/10 Rating",
    "summary": "The Rock was a big fan of Jason Kelce at WrestleMania. Kelce appeared at WrestleMania XL alongside another Eagles legend, Lane Johnson. The duo would end up helping Rey Mysterio and Andrade score a...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/the-rock-jason-kelce-wrestlemania-xl-261674",
    "publishedAt": "2025-10-13T22:56:53+00:00",
    "category": "wwe"
  },
  {
    "title": "Travis Kelce Tells The Rock That He's Been Dreaming About Getting In The Ring, 'You Know I'll Dive In There'",
    "summary": "The Rock wants Travis Kelce to get in the ring. WrestleMania 40 was a big night for fans of the Philadelphia Eagles, as Jason Kelce and Lane Johnson helped Rey Mysterio and Andrade defeat Dominik...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/travis-kelce-the-rock-wwe-261664",
    "publishedAt": "2025-10-13T22:24:33+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Raw Highlights, The Infantry Coming To DEFY, More | Fight Size",
    "summary": "Here is your fight size update for Monday, October 13, 2025. - Full Raw highlights: Oct. 13, 2025: https://www.youtube.com/watch?v=i07BulAUJnU - The Infantry is coming to DEFY Wrestling to wrestle...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/wwe-raw-infantry-defy-261661",
    "publishedAt": "2025-10-13T22:02:21+00:00",
    "category": "wwe"
  },
  {
    "title": "Another WWE NXT Developmental Talent Released",
    "summary": "Karyn Best, who performed in WWE’s developmental system as Summer Sorrell, has announced that she has been released from the company. In a statement posted to her Instagram account, she expressed her...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/another-wwe-nxt-developmental-talent-released/",
    "publishedAt": "2025-10-13T21:52:47+00:00",
    "category": "wwe"
  },
  {
    "title": "Ridge Holland Announces WWE Isn't Renewing His Contract, Will Pay For Injury Rehab",
    "summary": "WWE star Ridge Holland announced today that he'll be departing the promotion when his contract expires next month.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1995808/ridge-holland-wwe-not-renewing-contract-injury-rehab/",
    "publishedAt": "2025-10-13T21:38:56+00:00",
    "category": "wwe"
  },
  {
    "title": "Ridge Holland’s contract not being renewed by WWE",
    "summary": "Ridge Holland, real name Luke Menzies, announced on his X account that WWE are not renewing his contract.… The post Ridge Holland’s contract not being renewed by WWE appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/364333-ridge-hollands-contract-not-being-renewed-by-wwe/",
    "publishedAt": "2025-10-13T21:17:27+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE's The Rock To Begin Shooting For Blockbuster Film Franchise Sequel Next Month",
    "summary": "Fresh off the release of his dramatic turn as Mark Kerr in The Smashing Machine, The Rock is looking to get back in the business of smashing the box office.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1995784/wwe-the-rock-shooting-jumanji-4-november/",
    "publishedAt": "2025-10-13T21:15:10+00:00",
    "category": "wwe"
  },
  {
    "title": "Kevin Nash Reveals The One Detail That Adds A New Layer To The Montreal Screwjob",
    "summary": "On the latest episode of his Kliq This podcast, WWE Hall of Famer Kevin Nash weighed in on the infamous Montreal Screwjob, offering a fascinating insight that adds a new layer to the historical...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/kevin-nash-reveals-one-detail-adds-new-layer-montreal-screwjob/",
    "publishedAt": "2025-10-13T21:06:26+00:00",
    "category": "wwe"
  },
  {
    "title": "REPORT: Seth Rollins Injured At WWE Crown Jewel",
    "summary": "The shocking implosion of The Vision on Monday Night Raw was reportedly a creative decision made out of necessity, as World Heavyweight Champion Seth Rollins is believed to have suffered a legitimate...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/report-seth-rollins-injured-wwe-crown-jewel/",
    "publishedAt": "2025-10-13T20:51:15+00:00",
    "category": "wwe"
  },
  {
    "title": "Ridge Holland Says WWE Won't Be Renewing His Contract",
    "summary": "WWE has informed Ridge Holland that they will not be renewing his contract when it expires on November 14. Holland shared on Instagram that WWE told him they won't renew his contract at that time....",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/ridge-holland-says-wwe-wont-be-renewing-his-contract",
    "publishedAt": "2025-10-13T20:46:22+00:00",
    "category": "wwe"
  },
  {
    "title": "Ridge Holland Announces WWE Will Not Be Renewing His Contract",
    "summary": "Ridge Holland has announced that WWE will not be renewing his contract, which is set to expire on November 14. The news comes just weeks after Holland suffered a serious Lisfranc foot injury while...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/ridge-holland-announces-wwe-not-renewing-his-contract/",
    "publishedAt": "2025-10-13T20:23:50+00:00",
    "category": "wwe"
  }
]