[
  {
    "title": "Ricky Saints Says He Wasn’t Stressed About WWE Name Change",
    "summary": "Ricky Saints recently addressed his name change in WWE. Reigning NXT Champion Ricky Saints was known for his time in All Elite Wrestling, where he worked under the name Ricky Starks. However, after...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1587790-ricky-saints-says-he-wasnt-stressed-about-wwe-name-change",
    "publishedAt": "2025-11-03T18:16:19+00:00",
    "category": "wwe"
  },
  {
    "title": "Shotzi vs. Priscilla Kelly Added To MLW's 11/20 Show",
    "summary": "The former NXT tag team partners are set to clash. Coming up on the schedule for Major League Wrestling is an event on November 20th titled MLW x Don Gato Tequila: Live Special. The show will emanate...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/shotzi-vs-priscilla-kelly-added-to-mlws-11-20-show",
    "publishedAt": "2025-11-03T18:07:27+00:00",
    "category": "wwe"
  },
  {
    "title": "CM Punk Pays Tribute To Duke Roufus At WWE Saturday Night’s Main Event",
    "summary": "CM Punk made a touching tribute to the late Duke Roufus. Roufus, a former kickboxer and renowned mixed martial arts coach, unexpectedly passed away last month at the age of 55. He not only trained...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1587791-cm-punk-pays-tribute-duke-roufus-wwe",
    "publishedAt": "2025-11-03T18:05:56+00:00",
    "category": "wwe"
  },
  {
    "title": "Leilani Kai Would Like To Be A Coach At The WWE Performance Center",
    "summary": "Leilani Kai is a former WWF World Women’s Champion, WWF World Women’s Tag Team Champion, and NWA World Women’s Champion. Kai faced Wendi Richter at WrestleMania 1 and competed against Madusa at...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/leilani-kai-would-like-to-be-a-coach-at-the-wwe-performance-center",
    "publishedAt": "2025-11-03T18:04:35+00:00",
    "category": "wwe"
  },
  {
    "title": "Former WWE Star David Otunga Offers Legal Expertise On Non-Compete Clauses",
    "summary": "Former WWE star David Otunga offers legal expertise on non-compete clauses in WWE contracts following the controversies surrounding Andrade and Samantha Irvin",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2015527/wwe-david-otunga-legal-expertise-non-compete-clause/",
    "publishedAt": "2025-11-03T17:59:55+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE ring announcer announces engagement",
    "summary": "During an Instagram live session on Monday morning, WWE ring announcer Lilian Garcia revealed that she is now… The post WWE ring announcer announces engagement appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/366090-wwe-ring-announcer-announces-engagement/",
    "publishedAt": "2025-11-03T17:58:36+00:00",
    "category": "wwe"
  },
  {
    "title": "Lilian Garcia: Barring Any Surprises, I Will Be Announcing John Cena In His Last Match",
    "summary": "John Cena is set to compete in his final match on December 13th at WWE Saturday Night's Main Event. If all goes to plan, Lilian Garcia will be the ring announcer for the match. Garcia has been the...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/lilian-garcia-barring-any-surprises-i-will-be-announcing-john-cena-in-his-last-match",
    "publishedAt": "2025-11-03T17:48:48+00:00",
    "category": "wwe"
  },
  {
    "title": "Giulia Reflects On Returning To Japan With WWE: I Just Feel So Happy To Be Back",
    "summary": "Giulia reacts to returning to Japan with WWE. During WWE's recent tour of Japan, several wrestlers returned to their old stomping grounds but for Giulia, it would mark her first return to compete in...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/giulia-reflects-on-returning-to-japan-with-wwe-i-just-feel-so-happy-to-be-back",
    "publishedAt": "2025-11-03T17:33:46+00:00",
    "category": "wwe"
  },
  {
    "title": "Mickie James Says Husband Nick Aldis Rivals This WWE Personality As All-Time Best GM",
    "summary": "Mickie James claims that Nick Aldis is on the same level as one of the greatest \"WWE SmackDown\" General Managers of all-time.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2015460/mickie-james-nick-aldis-wwe-smackdown-general-manager/",
    "publishedAt": "2025-11-03T17:32:30+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Legend Says Triple H Got His Sons Into The Performance Center",
    "summary": "A WWE legend has revealed that Triple H got his sons into the WWE Performance Center. Speaking to Bill Apter on Sportskeeda WrestleBinge, WWE Hall of Famer Tatanka opened up about how Triple H got...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1587775-wwe-legend-says-triple-h-got-his-sons-into-the-performance-center",
    "publishedAt": "2025-11-03T16:51:03+00:00",
    "category": "wwe"
  },
  {
    "title": "Lilian Garcia Announces Her Engagement",
    "summary": "Lilian Garcia gets engaged. Coming off the heels of ring announcing at WWE Saturday Night's Main Event on November 1st, Lilian Garcia went live on Instagram for a Q&A session. At the end of the Q&A,...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/lilian-garcia-announces-her-engagement",
    "publishedAt": "2025-11-03T16:44:15+00:00",
    "category": "wwe"
  },
  {
    "title": "Kevin Nash Critiques WWE Raw Go-Home Show, Questions LA Knight’s Booking",
    "summary": "On the latest episode of the Kliq This podcast, Kevin Nash and Sean Oliver reviewed the go-home episode of WWE Raw leading into Saturday Night’s Main Event, with Nash offering critiques on the show’s...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/kevin-nash-critiques-wwe-raw-home-show-questions-knights-booking/",
    "publishedAt": "2025-11-03T16:39:38+00:00",
    "category": "wwe"
  },
  {
    "title": "JBL Attacks Velveteen Dream At Indie Wrestling Event",
    "summary": "JBL can still throw one Hell of a clothesline. The WWE legend made a surprise appearance at MCW’s Autumn Armageddon event on Sunday. JBL made a run-in while Velveteen Dream and Joe Keys were setting...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1587776-jbl-attacks-velveteen-dream-at-indie-wrestling-event",
    "publishedAt": "2025-11-03T16:28:50+00:00",
    "category": "wwe"
  },
  {
    "title": "Backstage Report On WWE Teasing Outside Wrestlers In Upcoming Tournament",
    "summary": "Dave Meltzer and Bryan Alvarez provide addition insight on WWE teasing wrestlers from outside promotions appearing in their upcoming tournament",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2015302/wwe-teasing-outside-wrestlers-tournament-john-cena/",
    "publishedAt": "2025-11-03T16:27:45+00:00",
    "category": "wwe"
  },
  {
    "title": "Candice LeRae Reportedly Training For New Role Within WWE",
    "summary": "Candice LeRae looks to be transitioning into a backstage position after a successful 22-year in-ring career.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2015267/wwe-candice-lerae-training-new-role/",
    "publishedAt": "2025-11-03T16:03:29+00:00",
    "category": "wwe"
  }
]