[
  {
    "title": "REPORT: Big Names Expected To Be At WWE Raw",
    "summary": "Tonight’s episode of WWE Monday Night Raw is set to take place at the historic Madison Square Garden in New York City. WWE often likes to pack its MSG episodes with major names and events, and...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/report-big-names-expected-wwe-raw/",
    "publishedAt": "2025-11-17T18:17:52+00:00",
    "category": "wwe"
  },
  {
    "title": "Tatum Paxley: Me Having WWE NXT Women’s Title Shows People “You Can Overcome Your Own Thoughts”",
    "summary": "NXT Women’s Champion Tatum Paxley was a guest on SiriusXM’s The Nikki & Brie Show, where she discussed her journey to the title and what she wants her championship reign to represent. When asked by...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/tatum-paxley-having-wwe-nxt-womens-title-shows-people-you-can-overcome-your-own-thoughts/",
    "publishedAt": "2025-11-17T18:12:15+00:00",
    "category": "wwe"
  },
  {
    "title": "Kevin Nash: ‘I’m Just Not Feeling The Fu**ing Kabuki Warriors’",
    "summary": "On the Kliq This podcast, Kevin Nash gave his opinion on Becky Lynch’s heel run and the recent push of The Kabuki Warriors. A fan asked why WWE keeps pushing Lynch as a heel when her run “isn’t...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/kevin-nash-just-not-feeling-fuing-kabuki-warriors/",
    "publishedAt": "2025-11-17T18:11:50+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Hall Of Famer Torrie Wilson Announces Birth Of First Child Via Surrogate",
    "summary": "Torrie Wilson is now a mother, with the former WWE star publicly revealing that she and her husband have welcomed their first child together.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2028836/wwe-torrie-wilson-announces-birth-first-child-surrogate/",
    "publishedAt": "2025-11-17T17:53:44+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE NXT Stars Invade TNA Again, Ruin Turning Point Main Event",
    "summary": "One day after invading TNA Impact, several stars from WWE decided to invade the promotion again, this time following the main event of Turning Point",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2028822/wwe-nxt-invade-tna-world-title-main-event-turning-point-nic-nemeth-kazarian/",
    "publishedAt": "2025-11-17T17:44:19+00:00",
    "category": "wwe"
  },
  {
    "title": "Bron Breakker: There Isn’t A Better Time To Bet On Me",
    "summary": "Bron Breakker says he felt completely calm on the day he decided to betray former WWE World Heavyweight Champion Seth Rollins. Last month, Bron Breakker teamed up with Bronson Reed and Paul Heyman on...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591019-wwe-bron-breakker-no-nerves-seth-rollins-split",
    "publishedAt": "2025-11-17T17:33:23+00:00",
    "category": "wwe"
  },
  {
    "title": "GUNTHER Speaks Ahead Of WWE Raw Return, Confirming He Underwent Surgery",
    "summary": "GUNTHER takes to social media before returning to \"WWE Raw\" on Monday at Madison Square Garden and opens up about recent surgery.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2028786/wwe-raw-gunther-return-confirming-surgery-nose/",
    "publishedAt": "2025-11-17T17:22:52+00:00",
    "category": "wwe"
  },
  {
    "title": "Cody Rhodes Recounts Wrestlers Babysitting Him, Feels Stone Cold Steve Austin Was Only One Who Took It Seriously",
    "summary": "Rhodes shares a story about Steve Austin. A clip from Undisputed WWE Champion Cody Rhodes' appearance on Pardon My Take was posted onto social media, during which Rhodes spoke about the wrestlers who...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/cody-rhodes-recounts-wrestlers-babysitting-him-feels-stone-cold-steve-austin-was-only-one-who-took-it-seriously",
    "publishedAt": "2025-11-17T17:07:38+00:00",
    "category": "wwe"
  },
  {
    "title": "John Cena: “I Really Want To Pave The Way For The Future” Of WWE",
    "summary": "John Cena believes the current WWE roster is the most talented he’s ever seen, and he says he is ready to pass the torch to the next generation of superstars as his career winds down next month....",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/john-cena-really-want-pave-way-future-wwe/",
    "publishedAt": "2025-11-17T16:53:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Torrie Wilson Welcomes A Baby Via Surrogacy",
    "summary": "Torrie Wilson is a mom! The WWE legend announced she and her husband, Justin, recently became parents. The couple welcomed a daughter, Poppi, via surrogacy. Wilson captioned a post of her holding her...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591068-torrie-wilson-welcomes-a-baby-via-surrogacy",
    "publishedAt": "2025-11-17T16:32:52+00:00",
    "category": "wwe"
  },
  {
    "title": "Je'Von Evans Explains Why WWE NXT Match Against Ilja Dragunov Is His Favorite",
    "summary": "Je'Von Evans has declared why his match against Ilja Dragunov is his favorite, even better than the one he had against WWE legend Randy Orton.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2028284/wwe-nxt-jevon-evans-ilja-dragunov-favorite-match/",
    "publishedAt": "2025-11-17T16:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Kevin Nash Defends Triple H’s Role In John Cena’s WWE Raw Segment",
    "summary": "Kevin Nash shared his thoughts on the recent John Cena-focused episode of WWE Monday Night Raw, calling the show “fantastic” during the Kliq This podcast. The show featured John Cena saying his...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/kevin-nash-defends-triple-role-john-cenas-wwe-raw-segment/",
    "publishedAt": "2025-11-17T16:19:27+00:00",
    "category": "wwe"
  },
  {
    "title": "Bully Ray Names The AEW Performer That He Feels The Most Emotionally Invested In",
    "summary": "WWE legend Bully Ray has praised an AEW star, noting that she has recently begun to showcase some unique traits in her character.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2028264/aew-bully-ray-marina-shafir-emotionally-invested/",
    "publishedAt": "2025-11-17T16:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Former WWE NXT Champ Trick Williams Reflects On In-Ring Moment With The Undertaker",
    "summary": "WWE NXT Trick Williams has discussed about his segment with The Undertaker on NXT, expressing pride in being in the ring with the legendary star.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2028239/wwe-nxt-trick-williams-undertaker-reflects-in-ring-moment/",
    "publishedAt": "2025-11-17T15:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Individual WrestleMania 42 Tickets Go On Sale On November 28",
    "summary": "WWE issued the following: INDIVIDUAL EVENT TICKETS FOR WRESTLEMANIA® 42 AT ALLEGIANT STADIUM IN LAS VEGAS ON SALE ON BLACK FRIDAY Tickets for WrestleMania Saturday and WrestleMania Sunday On Sale...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/individual-wrestlemania-tickets-sale-november/",
    "publishedAt": "2025-11-17T15:20:07+00:00",
    "category": "wwe"
  }
]