[
  {
    "title": "Report: Details on new contract for former WWE Champion",
    "summary": "Following the news that Xavier Wood re-signed with WWE, Fightful Select has reported that Kofi Kingston quietly re-signed… The post Report: Details on new contract for former WWE Champion appeared...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/363709-report-details-on-new-contract-for-former-wwe-champion/",
    "publishedAt": "2025-10-09T00:42:01+00:00",
    "category": "wwe"
  },
  {
    "title": "Former WWE Superstar Expected To Guest Coach At The Performance Center — Report",
    "summary": "WWE continues to have former talents come to the Performance Center in guest coach roles. The WWE Performance Center opened in Orlando back in 2013. Since then, the facility has been used to produce...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584018-former-wwe-superstar-expected-to-guest-coach-at-the-performance-center-report",
    "publishedAt": "2025-10-09T00:37:16+00:00",
    "category": "wwe"
  },
  {
    "title": "Steve Maclin: It Felt Good To Go Back To The Performance Center As The Character I Created Outside Of The Performance Center",
    "summary": "Steve Maclin discusses his return to WWE NXT. In the lead-up to NXT x TNA Showdown, Steve Maclin appeared on WWE NXT as a part of the group of TNA stars that invaded the Orlando-based brand. This was...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/steve-maclin-wwe-nxt-260480",
    "publishedAt": "2025-10-09T00:22:57+00:00",
    "category": "wwe"
  },
  {
    "title": "Roman Reigns Believes Current Storyline With Jey Uso Is A ‘Beautiful Opportunity’",
    "summary": "It appears that Roman Reigns has been manipulating Jey Uso in recent weeks on WWE RAW. WWE Superstar Roman Reigns was a recent guest on The Pat McAfee Show. When asked about his current storyline...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584012-roman-reigns-believes-current-storyline-with-jey-uso-is-a-beautiful-opportunity",
    "publishedAt": "2025-10-09T00:14:01+00:00",
    "category": "wwe"
  },
  {
    "title": "Kevin Nash Says This WWE Star Checked Up On Him After Recent Heart Procedure",
    "summary": "Kevin Nash says the former AEW star checked-in on him after his recent procedure.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1991363/wwe-kevin-nash-heart-procedure-cody-rhodes-check-in/",
    "publishedAt": "2025-10-09T00:11:44+00:00",
    "category": "wwe"
  },
  {
    "title": "Je’Von Evans Reflects On Sharing The Ring With This WWE Legend",
    "summary": "WWE NXT star Je’Von Evans recently reflected on sharing the ring with veteran star Randy Orton. Je’Von is one of the rising young stars in WWE. In a short span of time, Evans has impressed everyone...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1583999-jevon-evans-reflects-on-sharing-the-ring-with-this-wwe-legend",
    "publishedAt": "2025-10-08T23:52:30+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE/ECW Legend Raven Diagnosed With Early-Onset Parkinson’s Disease",
    "summary": "On The Ariel Helwani Show, wrestling icon Raven (Scott Levy) spoke candidly about his current health, including a diagnosis of early-onset Parkinson’s disease and other issues stemming from his long...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-ecw-legend-raven-diagnosed-early-onset-parkinsons-disease/",
    "publishedAt": "2025-10-08T23:46:06+00:00",
    "category": "wwe"
  },
  {
    "title": "Roman Reigns: I Feel Like Crap, But We're Gonna Go Head Against The Wall, Goldberg-Style",
    "summary": "Roman Reigns is set to take on Bronson Reed at WWE Crown Jewel in an Australian Street Fight. Ahead of the event, Roman spoke to Pat McAfee, who asked how the \"Tribal Chief\" is feeling ahead of the...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/roman-reigns-i-feel-like-crap-but-were-gonna-go-head-against-the-wall-goldberg-style",
    "publishedAt": "2025-10-08T23:44:40+00:00",
    "category": "wwe"
  },
  {
    "title": "Kevin Nash Reacts To Claims That Roman Reigns Is Overrated",
    "summary": "WWE Hall of Famer Kevin Nash recently shared his opinion on claims that Roman Reigns is an overrated star. Since adopting the Tribal Chief persona, Roman Reigns has taken WWE to new heights. The OTC...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1583985-kevin-nash-reacts-to-claims-that-roman-reigns-is-overrated",
    "publishedAt": "2025-10-08T23:23:01+00:00",
    "category": "wwe"
  },
  {
    "title": "Godfather: Undertaker And I Blew $50,000 At A Casino One Night",
    "summary": "The Godfather and The Undertaker were often associated during their time in WWE, hanging out backstage as members of the BSK along with Yokozuna, Rikishi, Savio Vega, and the Godwins. Speaking to...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/godfather-undertaker-and-i-blew-50000-at-a-casino-one-night",
    "publishedAt": "2025-10-08T23:10:46+00:00",
    "category": "wwe"
  },
  {
    "title": "Mike Santana Pays Respect To Current Champion Following WWE NXT Showdown",
    "summary": "Potential future TNA World Champion Mike Santana has a lot of respect for a current WWE NXT Champion. Last night at WWE NXT Showdown, Mike Santana and Ricky Saints led their respective teams in the...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584003-mike-santana-pays-respect-to-current-champion-following-wwe-nxt-showdown",
    "publishedAt": "2025-10-08T23:05:56+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Locks Down A Former World Champion For The Rest Of The Decade",
    "summary": "Former WWE Champion Kofi Kingston has re-signed with WWE on a new long-term contract, according to a report from Fightful Select. The news comes just a day after his New Day stablemate, Xavier Woods,...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-locks-down-former-world-champion-rest-decade/",
    "publishedAt": "2025-10-08T22:36:22+00:00",
    "category": "wwe"
  },
  {
    "title": "Kevin Nash Explains Why Bret Hart Is So “Misunderstood” By Fans",
    "summary": "On the latest episode of the Kliq This podcast, WWE Hall of Famer Kevin Nash gave his perspective on the career and personality of his contemporary, Bret “The Hitman” Hart, addressing why he believes...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/kevin-nash-explains-why-bret-hart-misunderstood-fans/",
    "publishedAt": "2025-10-08T22:06:54+00:00",
    "category": "wwe"
  },
  {
    "title": "Roman Reigns talks Street Fighter prep, Jey Uso’s rise in WWE",
    "summary": "Roman Reigns appeared on the most recent edition of The Pat McAfee Show, with the conversation largely centered… The post Roman Reigns talks Street Fighter prep, Jey Uso’s rise in WWE appeared first...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/363705-roman-reigns-talks-street-fighter-prep-jey-usos-rise-in-wwe/",
    "publishedAt": "2025-10-08T22:06:34+00:00",
    "category": "wwe"
  },
  {
    "title": "Update On Kofi Kingston’s WWE Status — Report",
    "summary": "With Xavier Woods locking down a new WWE contract recently, what does that mean for his New Day tag team partner, Kofi Kingston? Yesterday, it was revealed that Xavier Woods had signed a new...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1583997-update-on-kofi-kingston-wwe-status-report",
    "publishedAt": "2025-10-08T22:06:23+00:00",
    "category": "wwe"
  }
]