[
  {
    "title": "WWE Hall of Famer Calls Cody Rhodes The Best Interview In The Business",
    "summary": "One of the key skills required to be a professional wrestler is to be able to cut a promo. There are several stars in WWE who are considered to have the gift of the gab. Stars like Roman Reigns, Seth...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582162-wwe-hall-of-famer-calls-cody-rhodes-the-best-interview-in-the-business",
    "publishedAt": "2025-09-29T17:42:03+00:00",
    "category": "wwe"
  },
  {
    "title": "“WWE Unreal” Season 2 Is Reportedly In Production",
    "summary": "The acclaimed docuseries “WWE Unreal” is officially in the works for a second season, with filming already underway. A new report from Fightful Select has confirmed what many fans had been hoping...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-unreal-season-reportedly-production/",
    "publishedAt": "2025-09-29T17:27:34+00:00",
    "category": "wwe"
  },
  {
    "title": "John Laurinaitis And Vince McMahon’s Assistants Subpoenaed In Shareholder Lawsuit",
    "summary": "In November 2023, WWE shareholders, led by the Ohio Laborers’ Pension Fund, filed a lawsuit alleging that Vince McMahon orchestrated WWE’s 2023 merger with Endeavor to ensure he remained in power,...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/john-laurinaitis-and-vince-mcmahons-assistants-subpoenaed-in-shareholder-lawsuit",
    "publishedAt": "2025-09-29T17:18:08+00:00",
    "category": "wwe"
  },
  {
    "title": "Bret Hart: Hulk Hogan Would Rather See A Company Sink Than Help The Next Guy",
    "summary": "When Bret Hart ascended to the top of WWE, it came after the old guard like Hulk Hogan, Ultimate Warrior, and Randy Savage were being phased down and out. Bret was given an initial push as a singles...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/bret-hart-hulk-hogan-would-rather-see-a-company-sink-than-help-the-next-guy",
    "publishedAt": "2025-09-29T17:05:49+00:00",
    "category": "wwe"
  },
  {
    "title": "Kevin Nash: When It Comes Down To It, Right Now, On A Week In, Week Out Basis, Cody Rhodes Is The Best Interview In Wrestling",
    "summary": "Kevin Nash believes Cody Rhodes is the best interview in wrestling. Since returning to WWE at WrestleMania 38, Cody Rhodes has kicked off many of his promos with 'what do you guys want to talk...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/kevin-nash-when-it-comes-down-to-it-right-now-on-a-week-in-week-out-basis-cody-rhodes-is-the-best-interview-in-wrestling",
    "publishedAt": "2025-09-29T16:53:49+00:00",
    "category": "wwe"
  },
  {
    "title": "Kevin Nash On His Heart Procedure: ‘Total Time Until We Hit The IHOP Was Under An Hour’",
    "summary": "WWE Hall of Famer Kevin Nash has provided an update on his health following a recent heart procedure, detailing a quick and smooth recovery process. On the latest episode of his Kliq This podcast,...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/kevin-nash-his-heart-procedure-total-time-until-hit-ihop-under-hour/",
    "publishedAt": "2025-09-29T16:43:15+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE ID Title Bout Set For Beyond Wrestling Event",
    "summary": "The WWE ID Title will be defended at Beyond Wrestling Bound For The Floor on October 12. Cappuccino Jones will be defending the title against TJ Crawford. This will mark the first defense for Jones,...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/wwe-id-title-bout-set-for-beyond-wrestling-event",
    "publishedAt": "2025-09-29T16:41:48+00:00",
    "category": "wwe"
  },
  {
    "title": "Chelsea Green Defends Nia Jax Amidst Fan Criticism",
    "summary": "Chelsea Green has come to the defense of Nia Jax following a wave of online criticism directed at the former champion after an incident on the September 26 episode of Friday Night SmackDown. During a...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/chelsea-green-defends-nia-jax-amidst-fan-criticism/",
    "publishedAt": "2025-09-29T16:37:47+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Star Chelsea Green Defends 'Locker Room Leader' Nia Jax Following SmackDown Finish",
    "summary": "WWE's Chelsea Green comes to the defense of Nia Jax, calling her a \"locker room leader,\" following the disjointed SmackDown finish involving Jax",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1981675/wwe-smackdown-chelsea-green-nia-jax-match-botch-finish/",
    "publishedAt": "2025-09-29T16:37:17+00:00",
    "category": "wwe"
  },
  {
    "title": "Natalya Credits Vince McMahon For WWE Women Wrestling In Saudi Arabia",
    "summary": "Natalya credits Vince McMahon for paving the way for female WWE superstars to compete in Saudi Arabia. WWE’s partnership with Saudi Arabia has reached unprecedented heights since 2018, when Vince...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582108-natalya-credits-vince-mcmahon-for-wwe-women-wrestling-in-saudi-arabia",
    "publishedAt": "2025-09-29T16:35:05+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Accidentally Spoils Current NXT Storyline",
    "summary": "Oops — WWE inadvertently spoiled a new NXT storyline. This weekend’s NXT No Mercy event featured an NXT Women’s Championship match between Jacy Jayne, the current champion, and her latest challenger,...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582154-wwe-accidentally-spoils-nxt-storyline",
    "publishedAt": "2025-09-29T15:55:40+00:00",
    "category": "wwe"
  },
  {
    "title": "Undertaker Addresses Talk Of Using WWE Clout To Help Wife Michelle McCool's Career",
    "summary": "WWE Hall of Famer The Undertaker dispels any rumors that he used his backstage influence to advance his wife, Michelle McCool's career in WWE.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1981601/wwe-undertaker-rumors-clout-help-wife-michelle-mccool-career/",
    "publishedAt": "2025-09-29T15:53:20+00:00",
    "category": "wwe"
  },
  {
    "title": "Former WWE Star Braun Strowman Says He's In Talks To Play Classic Horror Role",
    "summary": "According to former WWE wrestler Braun Strowman, he is being considered to take on the role of one of horror's most iconic villains.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1981574/wwe-braun-strowman-horror-role-jason-voorhees-friday-13th/",
    "publishedAt": "2025-09-29T15:36:51+00:00",
    "category": "wwe"
  },
  {
    "title": "Bully Ray Thinks This Star Is Next For Lesnar After Squashing Cena At Wrestlepalooza",
    "summary": "Bully Ray has discussed who could face Brock Lesnar next in WWE, and how Lesnar's match against John Cena could set up his next opponent.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1981328/wwe-wresltepalooza-brock-lesnar-john-cena-next-gunther/",
    "publishedAt": "2025-09-29T15:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Sister Promotion Zuffa Boxing Lands Media Rights Deal",
    "summary": "WWE's sister promotion Zuffa Boxing has landed its first media rights deal with Paramount, which will become the home for the UFC and Zuffa in January 2026.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1981532/wwe-tko-zuffa-boxing-media-rights-paramount/",
    "publishedAt": "2025-09-29T15:09:20+00:00",
    "category": "wwe"
  }
]