[
  {
    "title": "Dave Meltzer Weighs In On WWE's Plans For WrestleMania 42",
    "summary": "Dave Meltzer weighs in on what he feels will be some of WWE's plans for WrestleMania 42 regarding Roman Reigns and WWE World Heavyweight Champion Seth Rollins",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1989854/wwe-wrestlemania-42-dave-meltzer-plans-build-roman-reigns-seth-rollins/",
    "publishedAt": "2025-10-07T17:59:17+00:00",
    "category": "wwe"
  },
  {
    "title": "Tag Title Bout At WWE NXT Showdown With TNA To Have Intriguing Spectators Front Row",
    "summary": "Two WWE Hall Of Famers will be seated front row for Winners Take All Match between The Hardys and DarkState at Showdown.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1989849/wwenxt-showdown-tna-tag-team-titles-hardys-darkstate-dudleys/",
    "publishedAt": "2025-10-07T17:55:24+00:00",
    "category": "wwe"
  },
  {
    "title": "Backstage Update On Santos Escobar's WWE Departure",
    "summary": "Additional details have emerged regarding Santos Escobar's WWE departure, with his contract having reportedly expired early this morning.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1989801/wwe-santos-escobar-departure-contract/",
    "publishedAt": "2025-10-07T17:34:05+00:00",
    "category": "wwe"
  },
  {
    "title": "John Cena Thinks He Can Address His Failed Heel Turn After His WWE Retirement Tour",
    "summary": "John Cena is focused on the present. At WWE Elimination Chamber, John Cena shocked fans when he turned heel and attacked Undisputed WWE Champion Cody Rhodes. What started as an exciting new creative...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1583644-john-cena-speak-more-heel-turn-after-wwe-retirement-tour",
    "publishedAt": "2025-10-07T17:33:14+00:00",
    "category": "wwe"
  },
  {
    "title": "Killer Kross and Scarlett React To Potential Interest From AEW",
    "summary": "Killer Kross and Scarlett contemplate a potential run in AEW. Following the expiration of their WWE contracts, Killer Kross and Scarlett are now free agents, with multiple independent wrestling...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1583604-killer-kross-and-scarlett-react-to-potential-interest-from-aew",
    "publishedAt": "2025-10-07T17:21:54+00:00",
    "category": "wwe"
  },
  {
    "title": "TNA’s Carlos Silva Comments On Ash By Elegance’s Future, NXT Showdown",
    "summary": "TNA wants to show NXT whose turf they are stepping on. NXT Showdown is set to take place on Tuesday night. The lineup features several NXT/TNA crossover matches, including a men’s and women’s...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582641-tna-carlos-silva-ash-by-elegance-status-nxt-showdown",
    "publishedAt": "2025-10-07T17:20:27+00:00",
    "category": "wwe"
  },
  {
    "title": "Je'Von Evans Says WWE Originally Wasn't Going To Sign Him After 2023 Tryout, Credits Shawn Michaels For Seeing Something In Him",
    "summary": "Je'Von Evans says Shawn Michaels pushed for him to be signed. Evans signed with WWE in late 2023 after taking part in a tryout with other names like Brogan Finlay (Uriah Connors) and Lucky Ali...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/jevonevanswwe260101",
    "publishedAt": "2025-10-07T17:17:45+00:00",
    "category": "wwe"
  },
  {
    "title": "Stephanie McMahon Among Upcoming WWE Names To Be Deposed In Shareholder Lawsuit",
    "summary": "A new court filing reveals Stephanie McMahon, along with several other WWE/TKO names, will be deposed as part of the ongoing shareholder lawsuit",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1989737/wwe-shareholder-lawsuit-stephanie-mcmahon-deposition-tkoari-emanuel/",
    "publishedAt": "2025-10-07T17:06:40+00:00",
    "category": "wwe"
  },
  {
    "title": "Wrestling Contract Expiration Dates: WWE, AEW, NJPW, TNA",
    "summary": "Below is an ongoing resource list featuring confirmed contract expirations reported by respected news outlets or the talent. You can also find Fightful's constantly updated injury report at this...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/confirmed-wrestling-contract-expirations-wwe-njpw-roh-gfw-lu",
    "publishedAt": "2025-10-07T17:03:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Full WWE Rosters For WWE Raw & Smackdown, Free Agents",
    "summary": "Since Wikipedia does a rough job updating rosters and status', Fightful will keep an ongoing, updated list of Raw and SmackDown rosters as best we can. Also, check out our contract updates, injury...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/full-wwe-roster",
    "publishedAt": "2025-10-07T16:58:00+00:00",
    "category": "wwe"
  },
  {
    "title": "JBL Finally Reveals The Real Reason A Legendary WWE Storyline Flopped",
    "summary": "On the latest episode of the Something to Wrestle With podcast, WWE Hall of Famer John Bradshaw Layfield (JBL) reflected on the 25th anniversary of one of the Attitude Era’s most controversial...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/jbl-finally-reveals-real-reason-legendary-wwe-storyline-flopped/",
    "publishedAt": "2025-10-07T16:18:49+00:00",
    "category": "wwe"
  },
  {
    "title": "Danielle Fishel Does WWE Entrances Backstage At Dancing with the Stars",
    "summary": "While the ballroom is typically reserved for dance practice, Danielle Fishel is also using it to practice her favorite WWE Superstar entrances. Danielle Fishel, famous for her role as Topanga...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1583586-danielle-fishel-does-wwe-entrances-backstage-at-dancing-with-the-stars",
    "publishedAt": "2025-10-07T16:02:11+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW Dynamite Title Tuesday Preview: 2.5 Hour Special!",
    "summary": "AEW Dynamite Title Tuesday airs live tonight on TBS and HBO Max from Daily’s Place in Jacksonville, Florida… The post AEW Dynamite Title Tuesday Preview: 2.5 Hour Special! appeared first on WWE News,...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/top-story/363573-aew-dynamite-title-tuesday-preview-2-5-hour-special/",
    "publishedAt": "2025-10-07T16:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Top WWE RAW Stars Featured On New Netflix Posters",
    "summary": "Netflix is WWE Raw. On January 6, WWE Raw made its official Netflix debut, both in the United States and several international markets. For viewers in the United States, Raw streams live every Monday...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1583577-top-wwe-raw-stars-featured-on-new-netflix-posters",
    "publishedAt": "2025-10-07T15:59:22+00:00",
    "category": "wwe"
  },
  {
    "title": "Matt Riddle Highlights One Thing He Liked About Working With Vince McMahon",
    "summary": "Ex-WWE star Matt Riddle praised Vince McMahon and pointed out one thing he liked about working for the former WWE Chairman. Riddle discussed Vince McMahon’s work habits during a recent interview with...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1583366-matt-riddle-one-thing-he-liked-vince-mcmahon-wwe",
    "publishedAt": "2025-10-07T15:58:08+00:00",
    "category": "wwe"
  }
]