[
  {
    "title": "World Series Causes Record-Low Numbers For WWE SmackDown And AEW Collision",
    "summary": "The World Series proved to be insurmountable competition for professional wrestling, sending both WWE SmackDown and AEW Collision into several historical lows. Games 6 and 7 of the series between the...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/world-series-causes-record-low-numbers-wwe-smackdown-aew-collision/",
    "publishedAt": "2025-11-05T18:08:59+00:00",
    "category": "wwe"
  },
  {
    "title": "Ken Shamrock Confirms Famous Montreal Screwjob Rumor",
    "summary": "In the fallout from the 1997 Montreal Screwjob, it has long been rumored that Bret Hart had a very short list of people he was willing to lose the WWE Championship to before he left for WCW. In an...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/ken-shamrock-confirms-famous-montreal-screwjob-rumor/",
    "publishedAt": "2025-11-05T18:00:01+00:00",
    "category": "wwe"
  },
  {
    "title": "Adam Pearce Celebrates 30 Years In Pro Wrestling: Grateful For Every Step, Misstep And Re-Step",
    "summary": "Adam Pearce celebrates his 30 year anniversary in pro wrestling. For the last several years, Pearce has featured as the general manager of the WWE Monday Night RAW show, much to the chagrin of talent...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/adam-pearce-celebrates-30-years-in-pro-wrestling-grateful-for-every-step-misstep-and-re-step",
    "publishedAt": "2025-11-05T17:54:21+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE SmackDown Viewership & Ratings Report: 10/31/2025",
    "summary": "\"WWE SmackDown\" draws historic low numbers on Halloween night after going up against the World Series on Friday.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2018073/wwe-smackdown-viewership-ratings-october-31-2025/",
    "publishedAt": "2025-11-05T17:14:40+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE NXT Champ Ricky Saints Explains Why He Still Wrestles With A Chip On His Shoulder",
    "summary": "Despite holding the WWE NXT Championship, Ricky Saints feels that his past causes him to wrestle with a chip on his shoulder.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2018043/wwe-nxt-ricky-saints-wrestles-chip-shoulder/",
    "publishedAt": "2025-11-05T16:56:51+00:00",
    "category": "wwe"
  },
  {
    "title": "Konnan Believes WWE Is 'Molding' This Wrestler Into The Best In The World",
    "summary": "AAA Hall of Famer Konnan believes that a WWE wrestler he knows closely is on the path to becoming a top star in the promotion.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2017740/wwe-dominik-mysterio-konnan-molding-best-world/",
    "publishedAt": "2025-11-05T16:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Gavin Newsom Trolls Donald Trump With Vince McMahon Beatdown Meme",
    "summary": "Across the nation, several states held elections to determine their governors and mayors, with the Democratic party winning key ones. In California, the majority of residents also voted to redraw its...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1589184-gavin-newsom-trolls-donald-trump-with-vince-mcmahon-beatdown-meme",
    "publishedAt": "2025-11-05T15:44:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Maven Says This AEW Star Could Be a Top Heel in WWE",
    "summary": "Maven believes that former AEW star MJF has the talent to become one of the greatest heels in WWE if he ever joins the company. During an interview on TMZ Inside The Ring, Maven compared today’s...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1588735-maven-top-aew-star-wwe-greatest-heel",
    "publishedAt": "2025-11-05T15:39:12+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Star Criticizes Fans for Cheering Dominik Mysterio and Cody Rhodes’ Actions",
    "summary": "WWE NXT star Kelani Jordan called out fans for cheering stars like Cody Rhodes and Dominik Mysterio while booing her for doing the same things. Last week, Jordan defended her TNA Knockouts...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1588804-wwe-star-criticizes-fans-dominik-mysterio-cody-rhodes",
    "publishedAt": "2025-11-05T15:37:55+00:00",
    "category": "wwe"
  },
  {
    "title": "Tyrus Expects Big, Controversial Names At John Cena's WWE Retirement",
    "summary": "Former WWE star and political commentator Tyrus has named two controversial personalities who could be present at John Cena's retirement match.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2017721/tyrus-expects-john-cena-wwe-retirement-donald-trump-vince-mcmahon/",
    "publishedAt": "2025-11-05T15:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Natalya Reveals How WWE And Vince McMahon Treated Tyson Kidd After His Injury, Says She Couldn't Talk About The Injury At Work Or She Wold Be Let Go",
    "summary": "Tyson Kidd (TJ Wilson) has not wrestled since 2015 when he suffered a freak and unfortunate injury while taking a muscle buster from Samoa Joe. Kidd has since transitioned to working as a producer...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/natalya-reveals-how-wwe-and-vince-mcmahon-treated-tyson-kidd-after-his-injury-says-she-couldnt-talk-about-the-injury-at-work-or-she-wold-be-let-go",
    "publishedAt": "2025-11-05T15:09:21+00:00",
    "category": "wwe"
  },
  {
    "title": "Former WWE Star Slams Modern Ticket Pricing, Credits Vince McMahon’s Strategy",
    "summary": "Former WWE star Maven believes Vince McMahon always understood how important affordable ticket prices were for families. Following Vince McMahon departure, WWE continues to deliver exciting...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1588675-maven-wwe-ticket-prices-vince-mcmahon",
    "publishedAt": "2025-11-05T15:06:14+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE’s Plans for WarGames Match and Seth Rollins’ Replacement — Report",
    "summary": "New reports have revealed WWE’s updated plans for the upcoming Men’s WarGames match after Seth Rollins was ruled out due to injury. Initial reports last month suggested the match would feature CM...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1588622-wwe-survivor-series-wargames-seth-rollins-update",
    "publishedAt": "2025-11-05T15:03:47+00:00",
    "category": "wwe"
  },
  {
    "title": "Bully Ray Says He Would 'Hit The Gas' On Pushing This WWE Star",
    "summary": "WWE Hall of Famer Bully Ray wants WWE to push a SmackDown star heavily, following their win at Saturday's Night Main Event.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2017705/wwe-bully-ray-hit-gas-jade-cargill/",
    "publishedAt": "2025-11-05T15:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Update On When Drew McIntyre’s WWE Contract Expires — Report",
    "summary": "A recent report has shared details of Drew McIntyre’s current situation with WWE, including how long he will be under contract. McIntyre re-signed a multi-year contract with WWE in April 2024. That...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1588699-drew-mcintyre-wwe-contract-expiration",
    "publishedAt": "2025-11-05T14:57:48+00:00",
    "category": "wwe"
  }
]