[
  {
    "title": "Drako Knox Says He Never Received Bad Feedback In NXT",
    "summary": "Drako Knox responds to Booker T's comments. Earlier this week, Booker T made some headlines when commenting on the most recent round of releases from WWE. Specifically, the former world champion said...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/drako-knox-says-he-never-received-bad-feedback-in-nxt",
    "publishedAt": "2025-10-16T12:06:04+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Star Responds To Rumors Of Replacing Faction Member",
    "summary": "WWE star Chelsea Green has spoken out about the future of her faction, the Secret Hervice, following a serious injury to member Piper Niven. Niven has been out of action since August, reducing the...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-star-responds-rumors-replacing-faction-member/",
    "publishedAt": "2025-10-16T12:00:05+00:00",
    "category": "wwe"
  },
  {
    "title": "Seth Rollins May Be In Jeopardy Of Missing WWE WrestleMania 42",
    "summary": "World Heavyweight Champion Seth Rollins is set to undergo shoulder surgery, something that may keep him sidelined for a significant period of time. According to the October 16, 2025, edition of...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/seth-rollins-may-jeopardy-missing-wwe-wrestlemania/",
    "publishedAt": "2025-10-16T11:52:28+00:00",
    "category": "wwe"
  },
  {
    "title": "DDP Reveals The Problem With Making The Jake Roberts Movie",
    "summary": "A feature film based on the life of WWE Hall of Famer Jake ‘The Snake’ Roberts is in development, but according to his close friend ‘Diamond’ Dallas Page, the project is facing significant hurdles in...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/ddp-reveals-problem-making-jake-roberts-movie/",
    "publishedAt": "2025-10-16T11:20:22+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Officials Are High On Raw Superstar",
    "summary": "While her on-screen partnership with Asuka appears to be more toxic than ever, Kairi Sane is reportedly receiving significant respect from officials behind the scenes in WWE. A new report suggests...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-officials-high-raw-superstar/",
    "publishedAt": "2025-10-16T11:07:00+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Non-Compete Issue Halting Andrade’s AEW Run",
    "summary": "New information has emerged about Andrade’s status and why he has not been featured on AEW television since his return to the company. Andrade made his surprise return on the October 1 episode of AEW...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-non-compete-issue-halting-andrades-aew-run/",
    "publishedAt": "2025-10-16T10:27:45+00:00",
    "category": "wwe"
  },
  {
    "title": "Videos: Full Event Crockett Cups From 1986 And 1987",
    "summary": "The WCW YouTube Channel has posted full NWA Crockett Cup events from 1986 and 1987. The 1986 Crockett… The post Videos: Full Event Crockett Cups From 1986 And 1987 appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/364590-videos-full-event-crockett-cups-from-1986-and-1987/",
    "publishedAt": "2025-10-16T05:20:44+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Vault Video – Full Match: The Rockers vs. Brain Busters",
    "summary": "WWE Vault has posted the full match between The Rockers (Shawn Michaels and Marty Jannetty) and the Brain… The post WWE Vault Video – Full Match: The Rockers vs. Brain Busters appeared first on WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/364587-wwe-vault-video-full-match-the-rockers-vs-brain-busters/",
    "publishedAt": "2025-10-16T05:03:29+00:00",
    "category": "wwe"
  },
  {
    "title": "Report on the absence of Andrade since returning to AEW",
    "summary": "Fightful Select has posted an update on the whereabouts of Andrade since making his surprise return to AEW,… The post Report on the absence of Andrade since returning to AEW appeared first on WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/364534-report-on-the-absence-of-andrade-since-returning-to-aew/",
    "publishedAt": "2025-10-16T02:54:08+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE announces new ID prospects coming, to be revealed on EVOLVE soon",
    "summary": "WWE has posted a new video to their X account, announcing new WWE ID prospects are coming soon… The post WWE announces new ID prospects coming, to be revealed on EVOLVE soon appeared first on WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/364491-wwe-announces-new-id-prospects-coming-to-be-revealed-on-evolve-soon/",
    "publishedAt": "2025-10-16T01:18:44+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE EVOLVE Succession Results (10/15): Two Title Bouts",
    "summary": "WWE aired WWE EVOLVE Succession on October 15 on Tubi. Matches were taped at the WWE Performance Center in Orlando, FL. Full results and highlights are below. WWE EVOLVE Succession Results (10/15)...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/wwe-evolve-succession-results-10-15-two-title-bouts",
    "publishedAt": "2025-10-16T01:12:42+00:00",
    "category": "wwe"
  },
  {
    "title": "Jeff Jarrett Reflects On Past And Future Of WWE HOF",
    "summary": "AEW star Jeff Jarrett has discussed who chose Hall of Fame inductees during Vince McMahon's tenure and commented on the absence of a physical Hall of Fame.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1991427/jeff-jarrett-reflects-past-future-wwe-hof/",
    "publishedAt": "2025-10-16T01:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "The Miz Reveals Shane McMahon’s Wild Pitch For Their WrestleMania 35 Match",
    "summary": "The Miz and Shane McMahon put on a show at WrestleMania 35 in a wild Falls Count Anywhere Match. According to Miz, though, McMahon had even crazier ideas for what could happen. Speaking during a...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585094-the-miz-reveals-shane-mcmahons-wild-pitch-for-their-wrestlemania-35-match",
    "publishedAt": "2025-10-16T00:21:45+00:00",
    "category": "wwe"
  },
  {
    "title": "AJ Styles Gives Heartfelt Farewell To The Australian WWE Universe",
    "summary": "AJ Styles gives an emotional farewell address to the WWE Universe in Australia. The Phenomenal One has made it clear that 2026 will be his final year as an active professional wrestler. He explained...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585057-aj-styles-gives-heartfelt-farewell-to-the-australian-wwe-universe",
    "publishedAt": "2025-10-15T23:33:51+00:00",
    "category": "wwe"
  },
  {
    "title": "Ethan Page Isn’t Happy About His Match At WWE NXT Halloween Havoc",
    "summary": "Ethan Page had no problem defending his title at WWE NXT Halloween Havoc — until he heard the match stipulation. The self-proclaimed Greatest North American of All Time will put his title on the line...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585063-ethan-page-isnt-happy-about-his-match-at-wwe-nxt-halloween-havoc",
    "publishedAt": "2025-10-15T23:27:43+00:00",
    "category": "wwe"
  }
]