[
  {
    "title": "WWE Posts Fifth Cryptic Walking Teaser",
    "summary": "WWE have posted a fifth cryptic walking teaser. The first teaser was posted on Sunday morning, and the second teaser was posted on Sunday evening. A third was posted on Sunday night. A fourth was...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/wwe-posts-fifth-cryptic-walking-teaser",
    "publishedAt": "2025-10-27T18:08:36+00:00",
    "category": "wwe"
  },
  {
    "title": "Liv Morgan Posts Video Of Her Getting Her Shoulder Put Back Into Place On Eleventh Anniversary With WWE",
    "summary": "Liv Morgan posts a new video of her shoulder being put back into place. On the June 16th edition of WWE Monday Night RAW, Morgan would suffer a shoulder injury during a singles match with Kairi Sane,...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/liv-morgan-posts-video-of-her-getting-her-shoulder-put-back-into-place-on-eleventh-anniversary-with-wwe",
    "publishedAt": "2025-10-27T17:45:24+00:00",
    "category": "wwe"
  },
  {
    "title": "Logan Paul’s Friend Says He Is Committing Full-Time To WWE, Boxing Career Over",
    "summary": "It appears Logan Paul’s time competing in a boxing ring is over, according to his friend and “Impaulsive” co-host, Mike Majlak. Majlak indicated that Paul is now fully committed to his career in WWE....",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/logan-pauls-friend-says-committing-full-time-wwe-boxing-career-over/",
    "publishedAt": "2025-10-27T17:30:16+00:00",
    "category": "wwe"
  },
  {
    "title": "CM Punk Comments On How Close He Is To Retiring",
    "summary": "CM Punk sees many of his peers hanging it up, but that doesn’t exactly mean he’s itching to follow them any time soon. Punk was featured in a new behind-the-scenes vlog during WWE’s recent tours of...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586647-cm-punk-how-close-he-is-to-retiring",
    "publishedAt": "2025-10-27T17:08:32+00:00",
    "category": "wwe"
  },
  {
    "title": "Mysterious WWE Vignettes Send Fans Into Speculation Mode",
    "summary": "A series of vignettes posted to WWE's social media have resulted in a wave of speculation from fans about potential returns or debuts.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2008548/mysterious-wwe-vignettes-send-fans-speculation-mode/",
    "publishedAt": "2025-10-27T16:42:29+00:00",
    "category": "wwe"
  },
  {
    "title": "Report: WWE Is Discussing New Contract For Raw Star",
    "summary": "Dragon Lee is reportedly making a strong impression within WWE, leading to discussions about his long-term future with the company. According to a report from PWInsiderElite.com, there is already...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/report-wwe-discussing-new-contract-raw-star/",
    "publishedAt": "2025-10-27T16:30:25+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Announces Details For NXT Deadline 2025",
    "summary": "WWE officially announces details for NXT Deadline 2025, confirming details reportedly last week that the show would be in San Antonio, Texas",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2008499/wwe-announces-details-nxt-deadline-2025-san-antonio-texas/",
    "publishedAt": "2025-10-27T16:28:19+00:00",
    "category": "wwe"
  },
  {
    "title": "Shawne Merriman Says WWE Deal Fell Apart Because Of A Trademark Issue, 'No Animosity At All'",
    "summary": "Shawne Merriman has no gripes with WWE. In 2014, WWE announced via The JBL & Cole Show that Shawne Merriman would be reporting to the Performance Center after appearing on the WrestleMania 30...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/shawne-merriman-264150",
    "publishedAt": "2025-10-27T16:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Real Reason For Cryptic WWE Teaser Videos — Report",
    "summary": "WWE certainly has fans talking about its cryptic posts on social media. WWE recently began sharing several videos that featured shots of various figures walking towards the camera. The videos only...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586634-real-reason-for-cryptic-wwe-teaser-videos",
    "publishedAt": "2025-10-27T15:37:20+00:00",
    "category": "wwe"
  },
  {
    "title": "Mark Henry Takes Issue With AEW Changing The Name Of His Finishing Move: 'F*** You'",
    "summary": "WWE legend Mark Henry is upset with AEW for renaming the World's Strongest Slam and has criticized the company's management.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2007946/mark-henry-takes-issue-aew-changing-name-finishing-move-f-you/",
    "publishedAt": "2025-10-27T15:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "The Miz: People Remember Who Wins, They Don't Remember Who Loses",
    "summary": "The Miz says that people don't remember who loses. Miz has been a heel for the majority of his career, with fleeting runs as a babyface. However, as a heel he has drawn a large amount of heat, and...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/the-miz-people-remember-who-wins-they-dont-remember-who-loses",
    "publishedAt": "2025-10-27T15:25:44+00:00",
    "category": "wwe"
  },
  {
    "title": "SPOILER: Top SmackDown Star Is Expected To Be At Tonight’s WWE Raw",
    "summary": "Several top WWE stars are reportedly in Anaheim, California, for tonight’s episode of Monday Night Raw. According to a report from PWInsiderElite.com, Cody Rhodes is expected to be at the event. This...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/spoiler-top-smackdown-star-expected-tonights-wwe-raw/",
    "publishedAt": "2025-10-27T15:18:41+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Star Had Instant Chemistry with Oba Femi After Sharing a Locker Room",
    "summary": "Omos spoke about his experience working with former WWE NXT Champion Oba Femi. In an interview with TMZ Sports, Omos reflected on his return to in-ring action at WWE NXT live events, where he...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586603-omos-oba-femi-wwe-locker-room-chemistry",
    "publishedAt": "2025-10-27T15:09:21+00:00",
    "category": "wwe"
  },
  {
    "title": "Real Reason For WWE’s Mysterious Teaser Videos",
    "summary": "WWE fans have been speculating about a series of cryptic videos posted to social media over the last few days, with many assuming they were hinting at a new storyline or a major return. However, a...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/real-reason-wwes-mysterious-teaser-videos/",
    "publishedAt": "2025-10-27T15:04:24+00:00",
    "category": "wwe"
  },
  {
    "title": "Jelly Roll Details Weight Loss Pursuit That Led To WWE SummerSlam 2025 Match",
    "summary": "Musician Jelly Roll has recalled how he earned his first WWE match and what Triple H told him when he expressed his desire to step into the ring.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2007940/jelly-roll-details-weight-loss-pursuit-led-wwe-summerslam-2025-match/",
    "publishedAt": "2025-10-27T15:00:00+00:00",
    "category": "wwe"
  }
]