[
  {
    "title": "Dave Meltzer Offers Update On Reported AI Integration In WWE",
    "summary": "Following up on a report from last week, Dave Meltzer reiterated that people within WWE believe AI will be used to generation creative pitches in the future.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2006337/dave-meltzer-update-ai-integration-wwe/",
    "publishedAt": "2025-10-24T18:04:51+00:00",
    "category": "wwe"
  },
  {
    "title": "AJ Styles Says He’s Nearly Collapsed During His Entrance ‘More Than Once’",
    "summary": "AJ Styles has revealed that he almost collapsed during his entrances on more than one occasion. Former two-time WWE Champion AJ Styles reacted to a clip on X/Twitter, which showed Seth Rollins...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586364-aj-styles-nearly-collapsed-during-entrance-more-than-once",
    "publishedAt": "2025-10-24T18:03:45+00:00",
    "category": "wwe"
  },
  {
    "title": "Charles Manson Wanted To Meet Bray Wyatt, Says Ex-WWE Writer",
    "summary": "It appears Bray Wyatt’s flawless portrayal of his original Wyatt Family character caught the attention of a real cult leader. Former WWE writer Nick Manfredini was a guest on Freddie Prinze Jr’s...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586354-charles-manson-wanted-to-meet-bray-wyatt-says-ex-wwe-writer",
    "publishedAt": "2025-10-24T18:02:45+00:00",
    "category": "wwe"
  },
  {
    "title": "The Boogeyman Jump Scares Chelsea Green, Jacob Fatu, Damian Priest, Michin, More",
    "summary": "The Boogeyman is still coming to get you. As of publish time, we are just one week away from the spookiest day of the year, Halloween. To celebrate, WWE uploaded a video of Boogeyman scaring the...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/the-boogeyman-jump-scares-chelsea-green-jacob-fatu-damian-priest-michin-more",
    "publishedAt": "2025-10-24T17:39:23+00:00",
    "category": "wwe"
  },
  {
    "title": "Report Details Plans For WWE Survivor Series WarGames 2025 After Seth Rollins' Injury",
    "summary": "Dave Meltzer provides an update on the Men's WarGames Match at Survivor Series following Seth Rollins being injured an unable to compete at the event.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2006290/report-details-plans-wwe-survivor-series-wargames-2025-seth-rollins-injury/",
    "publishedAt": "2025-10-24T17:30:54+00:00",
    "category": "wwe"
  },
  {
    "title": "Titus O'Neil Open To WWE TV Return",
    "summary": "Titus O'Neil has been on WWE TV since WrestleMania 39 when he was a guest commentator during the event. He hasn't wrestled since 2020, undergoing a knee procedure in 2022. Speaking to TMZ, Titus was...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/titus-oneil-open-to-wwe-tv-return",
    "publishedAt": "2025-10-24T17:10:23+00:00",
    "category": "wwe"
  },
  {
    "title": "Netflix May Have Spoiled AJ Lee’s Next WWE Appearance",
    "summary": "A potential spoiler regarding AJ Lee’s return to WWE programming may have come from an unlikely source: Netflix. The streaming platform, which now carries Monday Night Raw, is reportedly listing the...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/netflix-may-have-spoiled-lees-next-wwe-appearance/",
    "publishedAt": "2025-10-24T17:06:29+00:00",
    "category": "wwe"
  },
  {
    "title": "Former WWE Star Marc Mero Announces Engagement",
    "summary": "Former WWE Intercontinental Champion Marc Mero has announced his engagement to his partner, Malissa. Mero shared the news on his social media platforms. In an emotional post revealing that Malissa...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/former-wwe-star-marc-mero-announces-engagement/",
    "publishedAt": "2025-10-24T16:42:17+00:00",
    "category": "wwe"
  },
  {
    "title": "Abdullah The Butcher Hospitalized",
    "summary": "There has been a concerning update about WWE legend Abdullah the Butcher. WWE Hall of Famer Abdullah the Butcher has been hospitalized due to serious health issues. His long-time booking agent, Steve...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586344-abdullah-the-butcher-hospitalized",
    "publishedAt": "2025-10-24T16:07:07+00:00",
    "category": "wwe"
  },
  {
    "title": "Titus O’Neil Defends WWE’s Event Deal With Saudi Arabia",
    "summary": "Titus O’Neil has addressed the controversy surrounding WWE’s partnership with Saudi Arabia and their decision to host WrestleMania 43 in the country. WWE Global Ambassador and former Tag Team...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586338-titus-oneil-defends-wwe-deal-with-saudi-arabia",
    "publishedAt": "2025-10-24T15:43:47+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE And Dr. Squatch Team Up For Limited Edition Soaps And Deodorant",
    "summary": "WWE x Dr. Squatch is here. After weeks of teases and leaks, Dr. Squatch officially launched their WWE-branded line of products on Thursday, October 25. Fans have the option to purchase a two-pack of...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/wwe-and-dr-squatch-team-up-for-limited-edition-soaps-and-deodorant",
    "publishedAt": "2025-10-24T15:38:04+00:00",
    "category": "wwe"
  },
  {
    "title": "Nic Nemeth Wouldn’t Mind Seeing Matt Cardona Wrestle John Cena At MSG Episode of WWE Raw",
    "summary": "Nic Nemeth wants John Cena to face some more of his old foes. As of publish time, John Cena has four dates remaining with WWE before he retires from in-ring competition . Cena is set for the November...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/nic-nemeth-john-cena-matt-cardona-264159",
    "publishedAt": "2025-10-24T15:15:49+00:00",
    "category": "wwe"
  },
  {
    "title": "Tommy Dreamer Calls Fans 'Fickle' Over Live Reaction To WWE Raw Match",
    "summary": "Tommy Dreamer was surprised by the fans' reaction to the WWE Raw main event, criticizing the crowd for being fickle in their support.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2005845/tommy-dreamer-calls-fans-fickle-live-reaction-wwe-raw-match-jimmy-jey-uso/",
    "publishedAt": "2025-10-24T15:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Nic Nemeth Says Vince McMahon Paid The Half Million Dollar Fine To Let Him And John Cena Go Over The Curfew Time At 2012 MSG Live Event",
    "summary": "Nic Nemeth recalls tearing the house down with John Cena. On December 27, 2012, the former Dolph Ziggler and John Cena headlined WWE’s annual Madison Square Garden live event, facing each other in a...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/nic-nemeth-john-cena-wwe-264155",
    "publishedAt": "2025-10-24T14:44:41+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Is Reportedly Planning To Build A New Performance Center",
    "summary": "According to the Wrestling Observer Newsletter, WWE has plans to construct a new Performance Center (PC) facility in Orlando, Florida. The report dismisses any speculation that the company might...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-reportedly-planning-build-new-performance-center/",
    "publishedAt": "2025-10-24T14:44:10+00:00",
    "category": "wwe"
  }
]