[
  {
    "title": "Eddie Guerrero Day To Be Celebrated In El Paso, Texas",
    "summary": "November 18, 2025, is officially Eddie Guerrero Day in El Paso, Texas. The late WWE Hall of Famer Eddie Guerrero’s hometown, El Paso, Texas, will honor the legacy of the legendary superstar by...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1589915-eddie-guerrero-day-to-be-celebrated-in-el-paso-texas",
    "publishedAt": "2025-11-10T18:15:11+00:00",
    "category": "wwe"
  },
  {
    "title": "Report: John Cena Set For Action On Tonight's WWE Raw",
    "summary": "John Cena will reportedly challenge for a title on tonight's episode of \"WWE Raw\" from his hometown of Boston, Massachusetts.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2022218/wwe-raw-john-cena-action-dominik-mysterio/",
    "publishedAt": "2025-11-10T18:04:04+00:00",
    "category": "wwe"
  },
  {
    "title": "John Cena Says WWE Raw In Boston Is 'DEFINITELY ONE TO SEE'",
    "summary": "Fans may not be able to see John Cena, but Cena hopes fans will see WWE Raw in Boston on Monday. Cena posted the following message on social media: RAW. BOSTON. ONE LAST TIME. If you can be @TDGarden...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/john-cena-says-wwe-raw-in-boston-is-definitely-one-to-see",
    "publishedAt": "2025-11-10T17:52:57+00:00",
    "category": "wwe"
  },
  {
    "title": "Report On WWE Not Revealing Full John Cena 'Last Time Is Now' Tournament Bracket",
    "summary": "A new report reveals why WWE has not yet revealed all the participants, let alone the full brackets, for the ongoing John Cena \"Last Time is Now\" tournament",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2022186/wwe-not-revealing-full-john-cena-last-time-now-tournament-bracket/",
    "publishedAt": "2025-11-10T17:49:33+00:00",
    "category": "wwe"
  },
  {
    "title": "John Cena reportedly challenging for IC Title on tonight’s WWE Raw",
    "summary": "Bodyslam.net and F4WOnline are reporting John Cena will be challenging Dominik Mysterio for the WWE Intercontinental Championship on tonight’s… The post John Cena reportedly challenging for IC Title...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/top-story/366646-john-cena-reportedly-challenging-for-ic-title-on-tonights-wwe-raw/",
    "publishedAt": "2025-11-10T17:26:53+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Has Big Plans For Injured Star’s Return — Report",
    "summary": "WWE reportedly has big plans for an injured superstar who has been out of action since May 2025. Zoey Stark landed awkwardly on her right knee during a Money in the Bank qualifying match against Rhea...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1589913-wwe-has-big-plans-for-injured-stars-return-report",
    "publishedAt": "2025-11-10T17:23:50+00:00",
    "category": "wwe"
  },
  {
    "title": "Ken Anderson Reflects on Working with Umaga in His Final Wrestling Match",
    "summary": "Former WWE star Ken Anderson recently shared his memories of being Umaga’s final opponent before his passing in 2009. After leaving WWE, Umaga joined Hulk Hogan’s “Hulkamania: Let The Battle Begin”...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1589887-former-wwe-star-ken-anderson-reflects-on-working-with-umaga",
    "publishedAt": "2025-11-10T17:19:33+00:00",
    "category": "wwe"
  },
  {
    "title": "Luke Menzies (Ridge Holland) Shuts Down GoFundMe Campaign, Clarifies How Money Will Be Dispersed",
    "summary": "Former WWE Superstar Luke Menzies (Ridge Holland) has shut down the GoFundMe campaign launched to support him and his family and also clarified how the funds will be dispersed. Ridge Holland’s mother...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1589899-luke-menzies-ridge-holland-shuts-down-gofundme-campaign-clarifies-how-money-will-be-dispersed",
    "publishedAt": "2025-11-10T17:18:32+00:00",
    "category": "wwe"
  },
  {
    "title": "Update On Rhea Ripley's Status For WWE Survivor Series WarGames 2025",
    "summary": "Dave Meltzer discusses WWE's alternative plans for WarGames if Rhea Ripley is unable to compete at Survivor Series.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2022010/wwe-survivor-series-wargames-2025-rhea-ripley-status-stephanie-vaquer/",
    "publishedAt": "2025-11-10T16:41:31+00:00",
    "category": "wwe"
  },
  {
    "title": "Westside Gunn Airs Out Grievances After Being Kicked Out Of WWE Event",
    "summary": "Rapper Westside Gunn airs out grievances with WWE, accusing them of kicking him out of a show and sending legal notices over wrestling references in his music",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2021998/westside-gunn-airs-grievances-kicked-out-wwe-event/",
    "publishedAt": "2025-11-10T16:33:39+00:00",
    "category": "wwe"
  },
  {
    "title": "Bronson Reed Reflects On His Past Year In WWE: Start Acknowledging Your TRIBAL THIEF With Some DAMN RESPECT!",
    "summary": "Bronson Reed reflects on his past year in WWE. It has been a busy year for Bronson Reed for the past twelve months, despite suffering a serious injury at WWE Survivor Series during a War Games match....",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/bronson-reed-reflects-on-his-past-year-in-wwe-start-acknowledging-your-tribal-thief-with-some-damn-respect",
    "publishedAt": "2025-11-10T16:16:19+00:00",
    "category": "wwe"
  },
  {
    "title": "Big John Cena Match Planned For WWE Raw",
    "summary": "A major championship match is reportedly planned for tonight’s episode of Monday Night Raw in Boston. According to a new report from Bodyslam.net, John Cena will challenge Dominik Mysterio for the...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/big-john-cena-match-planned-wwe-raw/",
    "publishedAt": "2025-11-10T16:14:27+00:00",
    "category": "wwe"
  },
  {
    "title": "Ridge Holland Says WWE Is Paying For His Upcoming Neck Fusion Surgery",
    "summary": "Luke Menzies, formerly known as Ridge Holland in WWE, announced on Busted Open that WWE is paying for his upcoming neck fusion surgery. This procedure will keep him out of action until at least May...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/ridge-holland-says-wwe-paying-his-upcoming-neck-fusion-surgery/",
    "publishedAt": "2025-11-10T15:23:04+00:00",
    "category": "wwe"
  },
  {
    "title": "Ken Anderson Recalls This WWE Star Generating Massive Heat During His Entrance",
    "summary": "Former WWE star Ken Anderson recently shared a story about JBL getting one of the loudest and most hostile reactions he’s ever seen. Speaking on Elite Wrestle Talk on 99.9 Punk World Radio FM,...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1589890-ken-anderson-wwe-star-generating-massive-heat-entrance",
    "publishedAt": "2025-11-10T15:11:30+00:00",
    "category": "wwe"
  },
  {
    "title": "Former WWE Star Calls Shawn Michaels The Greatest In-Ring Performer Of All Time",
    "summary": "Former WWE star Donovan Dijak reveals why Shawn Michaels is the greatest in-ring performer of all time. Shawn Michaels has become one of the main figures behind the scenes, helping train and guide...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1589879-former-wwe-star-praises-shawn-michaels-as-greatest-in-ring-performer",
    "publishedAt": "2025-11-10T15:07:43+00:00",
    "category": "wwe"
  }
]