[
  {
    "title": "WWE Smackdown Viewership & Ratings Report: 10/10/25",
    "summary": "\"WWE SmackDown\" draws another disappointing number as Nielsen's \"Big Data + Panel\" model continues to negatively affect wrestling ratings.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1997967/wwe-smackdown-viewership-ratings-october-10-2025/",
    "publishedAt": "2025-10-15T18:17:39+00:00",
    "category": "wwe"
  },
  {
    "title": "CM Punk Says Rhea Ripley Is Serving…",
    "summary": "Step aside, Sabrina Carpenter. There’s a new server in town, and her name is Rhea Ripley. Following a successful string of shows in Perth, Australia, WWE headed to the south side of the country for a...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584996-cm-punk-rhea-ripley-is-serving",
    "publishedAt": "2025-10-15T18:12:00+00:00",
    "category": "wwe"
  },
  {
    "title": "IYO SKY: Promos Make Me Nervous, Even Only Short Lines Make Me So Nervous",
    "summary": "IYO Sky speaks on how she feels cutting promos. Throughout her time in WWE, IYO SKY has cut her promos in a mix of Japanese and English, with more English promos becoming common the longer she has...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/iyo-sky-promos-make-me-nervous-even-only-short-lines-make-me-so-nervous",
    "publishedAt": "2025-10-15T18:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE EVOLVE: Succession – Start Time, Full Card, And How To Stream",
    "summary": "Tonight, WWE’s developmental brand, Evolve, presents its first-ever special event, “Succession.” The show will stream for free in the United States on Tubi and will be available internationally on...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-evolve-succession-start-time-full-card-how-stream/",
    "publishedAt": "2025-10-15T17:43:04+00:00",
    "category": "wwe"
  },
  {
    "title": "Samoa Joe Says He Was Flattered By AJ Styles Using The Coquina Clutch Against John Cena",
    "summary": "Samoa Joe comments on AJ Styles using the coquina clutch at WWE Crown Jewel. AJ Styles and John Cena battled at WWE Crown Jewel, paying homage to their past rivals in the bout. At one point in the...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/samoa-joe-says-he-was-flattered-by-aj-styles-using-the-coquina-clutch-against-john-cena",
    "publishedAt": "2025-10-15T17:31:15+00:00",
    "category": "wwe"
  },
  {
    "title": "AJ Styles Tells Australian Fans He Is 'Probably Not Going To See Them Again In A Singlet Like This Anymore'",
    "summary": "AJ Styles lets Australian fans know that it may be the last time they see him in the ring. At WWE Crown Jewel Perth, AJ and John Cena faced off one final time in a match that was in a sense a tribute...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/aj-styles-tells-australian-fans-he-is-probably-not-going-to-see-them-again-in-a-singlet-like-this-anymore",
    "publishedAt": "2025-10-15T17:15:41+00:00",
    "category": "wwe"
  },
  {
    "title": "Booker T Believes WWE NXT Talent Have About ‘Two And A Half Years’ To Make It",
    "summary": "Booker T has some advice for WWE‘s developing talents. Last weekend, WWE released a number of developmental talents from the NXT, Evolve, and WWE ID brands. One of the names ousted from NXT was...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584960-booker-t-believes-wwe-nxt-talent-have-about-two-and-a-half-years-to-make-it",
    "publishedAt": "2025-10-15T17:14:35+00:00",
    "category": "wwe"
  },
  {
    "title": "The Usos Say Every WWE Superstar Is An 'Honorary Uce,' Even The Women Are 'Ucettes'",
    "summary": "The Usos, Jimmy Uso and Jey Uso, say all the members of the WWE locker room are Honorary Uces. During the Bloodline storyline of 2022, Sami Zayn became the \"Honorary Uce\" since he was the only member...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/the-usos-say-every-wwe-superstar-is-an-honorary-uce-even-the-women-are-ucettes",
    "publishedAt": "2025-10-15T17:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Bron Breakker Reports Young Fans For Excessive Yeeting At Melbourne WWE Live Event",
    "summary": "Bron Breakker has had enough of Yeeting from young fans. Breakker has had a big week during WWE's latest trip to Australia for WWE Crown Jewel Perth, as this week on Monday's edition of WWE RAW, he...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/bron-breakker-reports-young-fans-for-excessive-yeeting-at-melbourne-wwe-live-event",
    "publishedAt": "2025-10-15T16:41:16+00:00",
    "category": "wwe"
  },
  {
    "title": "Alexa Bliss Shares Real Reason For Teaming With Charlotte Flair In WWE",
    "summary": "Alexa Bliss says her pairing with Charlotte Flair has been fun, but it also happened randomly. Bliss spoke with Baby Huey on his In The Kliq podcast about working with Flair in WWE. She said she...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584970-alexa-bliss-shares-real-reason-teaming-with-charlotte-flair-wwe",
    "publishedAt": "2025-10-15T15:54:44+00:00",
    "category": "wwe"
  },
  {
    "title": "Booker T Moves Date Of ROW Show For John Cena’s Final Match",
    "summary": "WWE Hall of Famer Booker T has made a classy and respectful gesture, announcing that he is postponing an event for his own promotion, Reality of Wrestling (ROW), so that it does not conflict with the...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/booker-moves-date-row-show-john-cenas-final-match/",
    "publishedAt": "2025-10-15T15:52:58+00:00",
    "category": "wwe"
  },
  {
    "title": "Bully Ray Suggests WWE Raw Attack Against Seth Rollins Could Lead To Massive Reunion",
    "summary": "Bully Ray has assessed the direction WWE could take with The Vision, with Seth Rollins potentially teaming up with a former tag team partner after his return.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1997408/wwe-bully-ray-raw-attack-seth-rollins-lead-massive-reunion-roman-reigns/",
    "publishedAt": "2025-10-15T15:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "CM Punk Hits Dominik Mysterio With A Riptide And Pretzel Pins Him At WWE Melbourne Live Event",
    "summary": "CM Punk has hit Dominik Mysterio with a Riptide. Dominik Mysterio has found himself taking a Riptide on several occasions, usually at the hands of Rhea Ripley, however, now he has taken it at the...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/cm-punk-hits-dominik-mysterio-with-a-riptide-and-pretzel-pins-him-at-wwe-melbourne-live-event",
    "publishedAt": "2025-10-15T15:29:32+00:00",
    "category": "wwe"
  },
  {
    "title": "Paul Walter Hauser Explains Why WWE-TNA Partnership, NXT Invasion Story Isn't Working",
    "summary": "Actor Paul Walter Hauser has criticized WWE NXT, saying he isn't impressed with the show or with WWE's partnership with TNA.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1997387/paul-walter-hauser-wwe-tna-nxt-invasion-not-working/",
    "publishedAt": "2025-10-15T15:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "The Rock Reveals His Greatest Insult Of All Time",
    "summary": "The Rock (verbally) cooks the Travis Kelce. When he’s not laying the physical smackdown on his opponents, Dwayne “The Rock” Johnson has also been known for taking them down with his words. During a...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584948-the-rock-reveals-his-greatest-insult-of-all-time",
    "publishedAt": "2025-10-15T14:56:06+00:00",
    "category": "wwe"
  }
]