[
  {
    "title": "WWE NXT Viewership & Demo Revealed For 9/30 Episode",
    "summary": "WWE NXT saw another decrease in viewership on September 30, which set the stage for a “Showdown” between TNA and NXT next week. According to Wrestlenomics, NXT averaged 572,000 viewers on Tuesday....",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582680-wwe-nxt-viewership-demo-revealed-for-9-30-episode",
    "publishedAt": "2025-10-03T18:15:02+00:00",
    "category": "wwe"
  },
  {
    "title": "Kevin Nash Questions Having Two 'Mentally Unstable Women' On WWE Raw",
    "summary": "According to Kevin Nash, two of the women currently on \"WWE Raw\" are being portrayed as \"mentally unstable,\" with Nash questioning if that's a good idea.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1986039/wwe-raw-kevin-nash-mentally-unstable-aj-lee-bayley/",
    "publishedAt": "2025-10-03T18:12:18+00:00",
    "category": "wwe"
  },
  {
    "title": "Matt Riddle: Brock Lesnar Cut An Elimination Chamber Match Short Because He Forgot His Spot",
    "summary": "Former WWE star Matt Riddle has once again come into the limelight with his recent interview and comments on Brock Lesnar. During a new interview with TMZ Sports, Riddle talked about the Mayor of...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1583073-matt-riddle-brock-lesnar-match-cut-short-forgot-his-spot",
    "publishedAt": "2025-10-03T18:04:12+00:00",
    "category": "wwe"
  },
  {
    "title": "Bully Ray Slams Negativity Over WWE SmackDown Botch: 'It Could Happen To Anyone'",
    "summary": "WWE Hall of Famer Bully Ray goes to bat for those who competed in the WWE Women's Championship match last Friday, by addressing the criticism from the fans.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1985994/wwe-smackdown-botch-finish-bully-ray-negativity-social-media-jade-cargill-tiffany-stratton-nia-jax/",
    "publishedAt": "2025-10-03T17:40:09+00:00",
    "category": "wwe"
  },
  {
    "title": "The Godfather Reveals He And The Undertaker Once Lost $62,500 At A Casino",
    "summary": "WWE Hall of Famer The Godfather (Charles Wright), in a new interview with Esportsbets.com, shared a story about a night out with The Undertaker that resulted in a significant casino loss and offered...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/godfather-reveals-undertaker-once-lost-62500-casino/",
    "publishedAt": "2025-10-03T17:31:03+00:00",
    "category": "wwe"
  },
  {
    "title": "Penta On Lucha Bros Reunion: Imagine The Best Tag Team In The Universe Together Again In The Best Company In The Universe",
    "summary": "Penta is looking forward to his eventual reunion with Rey Fenix. Throughout 2025, both Penta and Rey Fenix have succeeded in their own ways as singles stars on both Raw and SmackDown. Still, fans are...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/penta-lucha-bros-wwe-259362",
    "publishedAt": "2025-10-03T16:51:28+00:00",
    "category": "wwe"
  },
  {
    "title": "Dave Meltzer Discusses WWE Rebranding NXT-TNA Invasion To Showdown",
    "summary": "Dave Meltzer doesn't believe WWE officials meant to cause any offense with the original name of the upcoming NXT-TNA special.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1985880/wwe-nxt-tna-dave-meltzer-invasion-showdown-rebranding/",
    "publishedAt": "2025-10-03T16:33:54+00:00",
    "category": "wwe"
  },
  {
    "title": "Penta On Potential TNA Return: Why Not, I’m Open For Everything",
    "summary": "Penta comments on possibly returning to TNA. On Tuesday, September 7, the NXT-TNA partnership will hit a climax, as both brands will battle it out at the Showdown event that. As of publish time, the...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/penta-on-potential-tna-return-why-not-im-open-for-everything",
    "publishedAt": "2025-10-03T16:32:51+00:00",
    "category": "wwe"
  },
  {
    "title": "TNA President Carlos Silva Comments On WWE NXT Partnership Before & After Showdown",
    "summary": "TNA President Carlos Silva discusses the importance of TNA's partnership with WWE, and how it will build the trajectory of its company's future.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1985831/tna-carlos-silva-wwe-nxt-partnership-after-showdown/",
    "publishedAt": "2025-10-03T16:02:22+00:00",
    "category": "wwe"
  },
  {
    "title": "Damian Priest Talks Potential Bad Bunny Return, ‘He Still Has That Itch’",
    "summary": "Damian Priest comments on a potential Bad Bunny return. The global superstar last wrestled for WWE in May 2023, facing Damian Priest in a San Juan Street Fight at the Backlash premium live event. The...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/damian-priest-bad-bunny-259356",
    "publishedAt": "2025-10-03T15:36:34+00:00",
    "category": "wwe"
  },
  {
    "title": "Penta Comments On Potential Lucha Bros Reunion In WWE",
    "summary": "Penta isn’t closing the door on a Lucha Bros reunion. However, he seems pretty focused on building his name as a singles star in WWE. The WWE Superstar was a guest on the Battleground podcast, where...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1583069-penta-on-lucha-bros-reunion-in-wwe",
    "publishedAt": "2025-10-03T15:27:31+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Announces Upcoming Special Edition Of NXT",
    "summary": "WWE announces a special edition of \"WWE NXT,\" coming to New York City one day after John Cena's final appearance in the city.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1985757/wwe-nxt-special-edition-madison-square-garden-november-18-2025/",
    "publishedAt": "2025-10-03T15:23:07+00:00",
    "category": "wwe"
  },
  {
    "title": "Matt Hardy: TNA Started To Rise Up After Hearing Theories About Being A Puppet For WWE/NXT",
    "summary": "Matt Hardy is ready to fight for TNA. The October 7 edition of WWE NXT will be a huge one, as the brand will battle with TNA Wrestling. The brands will clash in two separate Survivor Series matches...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/matt-hardy-tna-nxt-259350",
    "publishedAt": "2025-10-03T15:16:17+00:00",
    "category": "wwe"
  },
  {
    "title": "Matt Hardy Says Referees Were Being Fined For Stopping Pinfall Counts When The Hardys Returned To WWE In 2017",
    "summary": "Matt Hardy discusses a recent SmackDown incident. On the September 26 edition of WWE SmackDown, Tiffany Stratton defended her WWE Women's Championship against Jade Cargill and Nia Jax. Near the end...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/matt-hardy-the-hardys-wwe-259347",
    "publishedAt": "2025-10-03T14:47:43+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE NXT To Be Held At The Theater At Madison Square Garden On 11/18",
    "summary": "WWE NXT will return to the Theater at Madison Square Garden on November 18. From WWE: SPECIAL EDITION OF NXT® TAKES PLACE TUESDAY, NOVEMBER 18 AT THE THEATER AT MADISON SQUARE GARDEN IN NEW YORK CITY...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/wwe-nxt-to-be-held-at-the-theater-at-madison-square-garden-on-11-18",
    "publishedAt": "2025-10-03T14:44:19+00:00",
    "category": "wwe"
  }
]