[
  {
    "title": "Backstage Report On Plans For Seth Rollins At WWE WrestleMania 42 Prior To Recent Injury",
    "summary": "Dave Meltzer reveals who Seth Rollins was scheduled to face at WrestleMania 42 before he was reportedly written off television due to injury.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1996764/wwe-seth-rollins-match-planned-wrestlemania-42-injury-roman-reigns/",
    "publishedAt": "2025-10-14T18:17:58+00:00",
    "category": "wwe"
  },
  {
    "title": "TNA Star Hopes To See Ridge Holland In The Company After Injury Recovery",
    "summary": "A TNA star has expressed interest in seeing Ridge Holland join the company once he recovers from injury. Ridge Holland appears to be going through a streak of bad luck. The former Brawling Brute...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584806-tna-star-hopes-to-see-ridge-holland-in-the-company-after-injury-recovery",
    "publishedAt": "2025-10-14T18:15:55+00:00",
    "category": "wwe"
  },
  {
    "title": "Torrie Wilson Reveals Why Her Dog Chloe Stopped Traveling With Her In WWE",
    "summary": "Torrie Wilson says her dog, Chloe, loved making towns, but there’s a good reason she took her off the road. Chloe was a regular fixture on WWE TV during Torrie Wilson’s tenure with the company....",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1573343-torrie-wilson-why-her-dog-chloe-stopped-traveling-wwe",
    "publishedAt": "2025-10-14T18:11:39+00:00",
    "category": "wwe"
  },
  {
    "title": "Backstage Update On In-Ring Return Timeline For WWE HOFer Rey Mysterio",
    "summary": "PWInsider has put out a backstage update on the in-ring return of WWE Hall of Famer Rey Mysterio and what a potential timeline might look like.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1996751/in-ring-return-timeline-wwe-hofer-rey-mysterio/",
    "publishedAt": "2025-10-14T18:10:45+00:00",
    "category": "wwe"
  },
  {
    "title": "IYO SKY Says Her WrestleMania 41 Win Meant So Much To Her And 'Also So Much To Japanese People'",
    "summary": "IYO SKY discusses her WrestleMania 41 WWE Women's World Title victory. At WrestleMania 41 the WWE Women's World Title was on the line at the event in Las Vegas in a triple threat match featuring IYO...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/iyo-sky-says-her-wrestlemania-41-win-meant-so-much-to-her-and-also-so-much-to-japanese-people",
    "publishedAt": "2025-10-14T17:51:16+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE LFG Talent Confirms Release",
    "summary": "Summer Sorrell says goodbye to WWE, but hello to her next chapter. Over the weekend, WWE reportedly released several developmental talents, including WWE LFG season two competitor Summer Sorrell....",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584777-wwe-lfg-talent-confirms-release",
    "publishedAt": "2025-10-14T17:32:36+00:00",
    "category": "wwe"
  },
  {
    "title": "Report: WWE's Seth Rollins Might Need Surgery, Though Questions Linger Over Injury",
    "summary": "A new report from PWInsider sheds light on what the talk is around the WWE locker room amidst the Seth Rollins injury and what they're hearing.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1996663/wwe-seth-rollins-surgery-questions-injury/",
    "publishedAt": "2025-10-14T17:22:02+00:00",
    "category": "wwe"
  },
  {
    "title": "Becky Lynch Reacts To Bron Breakker Spearing Seth Rollins: I'm Gone For One Week",
    "summary": "Becky Lynch reacts to The Vision's implosion. On the October 13th edition of WWE Monday Night RAW, CM Punk would earn himself the number one contendership for the WWE World Heavyweight Championship...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/becky-lynch-reacts-to-bron-breakker-spearing-seth-rollins-im-gone-for-one-week",
    "publishedAt": "2025-10-14T17:11:39+00:00",
    "category": "wwe"
  },
  {
    "title": "What Could Have Been: What If Adam Copeland Had Stayed In WWE Instead Of Going To AEW?",
    "summary": "As we approach the second anniversary of Adam Copeland's AEW WrestleDream debut, Wrestling Inc must ask: what if he had stayed in WWE as Edge?",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1996614/what-could-have-been-adam-copeland-wwe-instead-aew/",
    "publishedAt": "2025-10-14T16:59:14+00:00",
    "category": "wwe"
  },
  {
    "title": "Paul Walter Hauser Blasts WWE For Raising Ticket Prices: 'Be A Real Person, You D***'",
    "summary": "Golden Globe Award winner Paul Walter Hauser has slammed WWE for their rising ticket prices that are pricing out hardcore fans.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1996595/paul-walter-hauser-blasts-wwe-raising-ticket-prices-real-person/",
    "publishedAt": "2025-10-14T16:48:57+00:00",
    "category": "wwe"
  },
  {
    "title": "Booker T: WWE NXT Talent Have Around ‘Two And A Half Years’ To Make It",
    "summary": "During his Hall of Fame podcast, NXT commentator Booker T addressed the recent surprising release of Wes Lee and other NXT stars from WWE. He used the news as a stern warning for all talent currently...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/booker-wwe-nxt-talent-have-two-half-years-make/",
    "publishedAt": "2025-10-14T16:45:27+00:00",
    "category": "wwe"
  },
  {
    "title": "Original Plans For Seth Rollins At WWE WrestleMania 42 — Report",
    "summary": "A blockbuster match between Seth Rollins and Roman Reigns was tentatively scheduled for WWE WrestleMania 42, according to a new report. Despite crossing paths on multiple occasions, Rollins and...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584781-original-plans-seth-rollins-wwe-wrestlemania-42",
    "publishedAt": "2025-10-14T16:09:09+00:00",
    "category": "wwe"
  },
  {
    "title": "Seth Rollins’ Injury Reportedly Legitimate, May Require Surgery",
    "summary": "The shocking betrayal of Seth Rollins by his own faction, The Vision, on this past week’s episode of Raw was reportedly not a long-term planned storyline, but a creative decision “necessitated” by a...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/seth-rollins-injury-reportedly-legitimate-may-require-surgery/",
    "publishedAt": "2025-10-14T16:03:59+00:00",
    "category": "wwe"
  },
  {
    "title": "The Usos On Hidden Talents In The Bloodline: We Can Draw, Paint, Play Piano",
    "summary": "Jimmy and Jey Uso speak on the hidden talents of their illustrious family. Jimmy Uso and Jey Uso are part of one of the greatest wrestling families of all time. With the recent focus on their...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/the-usos-on-hidden-talents-in-the-bloodline-we-can-draw-paint-play-piano",
    "publishedAt": "2025-10-14T16:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Female Wrestler Was Near-Death And In Coma, Now Chasing WWE Dream",
    "summary": "Bailey McRoberts has lived to tell her inspirational tale. In the ring, she’s known as Teagan Thorne, “The Eternal Enigma” filling the Midwest independent circuit with eerie energy. In real life,...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584747-female-wrestler-was-near-death-and-in-coma-now-chasing-wwe-dream",
    "publishedAt": "2025-10-14T15:16:54+00:00",
    "category": "wwe"
  }
]