[
  {
    "title": "John Cena vs. AJ Styles Set For WWE Crown Jewel",
    "summary": "John Cena will share the ring with AJ Styles one more time at Crown Jewel. Much has been made of a potential final match between John Cena and AJ Styles, as Cena stirred up some buzz by tweeting...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/john-cena-vs-aj-styles-set-for-wwe-crown-jewel",
    "publishedAt": "2025-09-23T18:11:23+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW's Jeff Jarrett Provides Update On WWE HOFer Jerry Lawler After Most Recent Stroke",
    "summary": "After Jerry Lawler suffered a stroke earlier this month, fellow Tennessee wrestling icon Jeff Jarrett has provided an update on his condition.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1976645/aew-jeff-jarrett-health-update-jerry-lawler-recent-stroke/",
    "publishedAt": "2025-09-23T17:47:06+00:00",
    "category": "wwe"
  },
  {
    "title": "Mercedes Moné Inspired Becky Lynch’s Excuse For Her Loss At Wrestlepalooza",
    "summary": "Together as Team B.A.E in WWE NXT, Becky Lynch and Mercedes Moné claimed that they were the best at everything. When it comes to allegedly fending off insects and spiders, however, their track...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1580025-mercedes-mone-inspired-becky-lynch-excuse-for-wrestlepalooza-loss",
    "publishedAt": "2025-09-23T17:43:48+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Hall of Famer Says Chelsea Green Makes The Most Of Every Second She’s On TV",
    "summary": "One of the veterans of the professional wrestling business is WWE Hall of Famer Torrie Wilson. Wilson was part of the Stamford-based promotion from the late 1990s to the mid-2000s. She was frequently...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1579804-chelsea-green-makes-the-most-of-every-second-on-tv",
    "publishedAt": "2025-09-23T17:35:16+00:00",
    "category": "wwe"
  },
  {
    "title": "Andrade’s First Post-WWE Appearance Revealed",
    "summary": "Andrade is set to make his first appearance after leaving WWE. New York’s House of Glory announced that Andrade will appear at its November 15 event on Long Island in New York. This will also mark...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1580063-andrade-first-post-wwe-appearance-revealed",
    "publishedAt": "2025-09-23T17:25:25+00:00",
    "category": "wwe"
  },
  {
    "title": "Sami Zayn On Finding Out He'd Be Facing Shinsuke Nakmura In NXT: What An Interesting Time In My Life This Was",
    "summary": "Sami Zayn and several other WWE superstars name their favorite NXT moments. During the 'black and gold' era of WWE NXT, a majority of the brands run would take place from Full Sail University, where...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/sami-zayn-on-finding-out-hed-be-facing-shinsuke-nakmura-in-nxt-what-an-interesting-time-in-my-life-this-was",
    "publishedAt": "2025-09-23T17:25:03+00:00",
    "category": "wwe"
  },
  {
    "title": "Odyssey Jones Lawyers Demand WWE Records Related To Domestic Abuse Allegations And Termination — Report",
    "summary": "Odyssey Jones has drawn WWE into his ongoing legal battle over domestic abuse allegations. Jones, whose real name is Omari Palmer, was primed for big things before his sudden release. He was...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1579873-odyssey-jones-lawyers-demand-wwe-records-related-to-domestic-abuse-allegations-and-termination-report",
    "publishedAt": "2025-09-23T17:11:55+00:00",
    "category": "wwe"
  },
  {
    "title": "LA Knight Sends Strong Message to Jey Uso After WWE Raw",
    "summary": "This past Saturday night at the Wrestlepalooza PLE, The Usos lost their tag team match against The Vision’s Bron Breakker and Bronson Reed. During last night’s episode of Monday Night Raw, Jey Uso...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1579790-la-knight-sends-strong-message-to-jey-uso-after-wwe-raw",
    "publishedAt": "2025-09-23T17:02:56+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW Star Throws Shade at WWE WrestlePalooza",
    "summary": "AEW star Ricochet mocks WWE WrestlePalooza after C grade from ESPN. This past weekend, WWE held its first premium live event on ESPN, called WrestlePalooza. The show featured big matches like Brock...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1579777-aew-star-shades-wwe-wrestlepalooza",
    "publishedAt": "2025-09-23T17:00:35+00:00",
    "category": "wwe"
  },
  {
    "title": "Sol Ruca: Shawn Michaels Has Really Pushed For Women's Wrestling",
    "summary": "Sol Ruca speaks on meeting Shawn Michaels and praises him as a champion of women's wrestling. Sol Ruca is still in the early stages of her wrestling career. Having only competed in WWE NXT, her...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/sol-ruca-shawn-michaels-has-really-pushed-for-womens-wrestling",
    "publishedAt": "2025-09-23T16:22:05+00:00",
    "category": "wwe"
  },
  {
    "title": "Hulk Hogan’s Widow Signs Off On Plans For His Estate",
    "summary": "An update on the estate belonging to the late WWE Hall of Famer Hulk Hogan. Earlier this month, Nick Hogan reportedly filed court documents in order for him to be named the co-personal representative...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1579968-hulk-hogan-widow-signs-off-plans-for-his-estate",
    "publishedAt": "2025-09-23T16:22:01+00:00",
    "category": "wwe"
  },
  {
    "title": "Former NXT Star Believes Chase U Faction Had WWE Main Roster Potential",
    "summary": "Duke Hudson assesses what could have been for Chase U on WWE‘s main roster. In its revived state, the Chase U faction consists of Kale Dixon, Uriah Connors, and founding leader Ande Chase. For much...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1579392-former-nxt-star-chase-u-wwe-main-roster-potential",
    "publishedAt": "2025-09-23T16:19:51+00:00",
    "category": "wwe"
  },
  {
    "title": "Rhea Ripley Looked Like A Smurf After Attack On WWE RAW",
    "summary": "Rhea Ripley got hit with Asuka’s poison mist attack at the conclusion of WWE RAW on Monday night. It was designed to signal Asuka’s heel turn and be a more sinister moment, but many fans pointed out...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1579945-rhea-ripley-looked-like-a-smurf-wwe-raw",
    "publishedAt": "2025-09-23T16:15:02+00:00",
    "category": "wwe"
  },
  {
    "title": "AJ Styles Reacts To John Cena Asking About One More Match With Him",
    "summary": "AJ Styles vs. John Cena hasn’t happened on the latter’s retirement tour, but could it? Styles is regarded as one of John Cena’s best rivals in WWE. The pair had several great matches against each...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1580026-aj-styles-reacts-john-cena-one-more-match",
    "publishedAt": "2025-09-23T16:07:10+00:00",
    "category": "wwe"
  },
  {
    "title": "Konnan Says AAA Is 'Pending Television Distribution In USA,' Doesn't Name Network",
    "summary": "AAA official Konnan has offered an update on the distribution status of the promotion following WWE's acquisition earlier this year.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1976457/konnan-aaa-pending-television-distribution-usa-doesnt-name-network/",
    "publishedAt": "2025-09-23T16:04:17+00:00",
    "category": "wwe"
  }
]