[
  {
    "title": "NWA’s Thom Latimer Opens Up About His Past Struggles With Alcohol And Getting Fired From WWE",
    "summary": "On the latest episode of the Talk’n Shop podcast with The Good Brothers, NWA World Heavyweight Champion Thom Latimer opened up about his long struggle with alcohol abuse, which led to him being fired...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/nwas-thom-latimer-opens-about-his-past-struggles-alcohol-getting-fired-wwe/",
    "publishedAt": "2025-10-12T05:23:48+00:00",
    "category": "wwe"
  },
  {
    "title": "TNA Knockouts Champ Kelani Jordan Details How WWE Audition Came About",
    "summary": "TNA Knockouts Champion Kelani Jordan recalled how her WWE tryout came about after first hearing from the company.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1990023/wwe-nxt-tna-kelani-jordan-audition-gymnastics/",
    "publishedAt": "2025-10-12T03:59:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Ridge Holland Provides New Update On Recovery From Surgery",
    "summary": "Ridge Holland's latest update. At a TNA television taping, WWE's Ridge Holland went one-on-one with Moose. The match was thrown out after Holland suffered an injury and was not able to continue. It...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/ridge-holland-provides-new-update-on-recovery-from-surgery",
    "publishedAt": "2025-10-12T03:07:35+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE NXT Live Results (10/11): Oba Femi vs. Omos, Ethan Page vs. Johnny Gargano",
    "summary": "WWE held a NXT live event on October 11 from the Agora Theater in Cleveland, OH. Full results (courtesy of Wrestling Bodyslam) and highlights are below. WWE NXT Live Results (10/11) Tomasso Ciampa...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/wwe-nxt-live-results-10-11-oba-femi-vs-omos-ethan-page-vs-johnny-gargano",
    "publishedAt": "2025-10-12T02:54:48+00:00",
    "category": "wwe"
  },
  {
    "title": "There May Be More WWE Cuts Coming Next Week",
    "summary": "More cuts nay be on the way for WWE’s developmental system, according to a new report that sheds light on a recent wave of talent departures. On Saturday, Bryan Alvarez of the Wrestling Observer...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/there-may-more-wwe-cuts-coming-next-week/",
    "publishedAt": "2025-10-12T02:45:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Two Tag Team Matches Announced For AEW Saturday Tailgate Brawl: WrestleDream",
    "summary": "Two matches are locked in for the special. Ahead of AEW's WrestleDream pay-per-view on October 18th, there is going to be a one-hour Saturday Tailgate Brawl special. The company debuted the concept...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/two-tag-team-matches-announced-for-aew-saturday-tailgate-brawl-wrestledream",
    "publishedAt": "2025-10-12T02:18:20+00:00",
    "category": "wwe"
  },
  {
    "title": "TNA President Carlos Silva Sends Message To The Hardys: \"Look Forward To Many Years Of Positive Vibes Together\"",
    "summary": "Carlos Silva is looking forward to more years together. A new report from Sean Ross Sapp of Fightful Select was pushed out regarding the TNA World Tag Team and NXT Tag Team Champions, The Hardys...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/tna-president-carlos-silva-sends-message-to-the-hardys-look-forward-to-many-years-of-positive-vibes-together",
    "publishedAt": "2025-10-12T01:45:09+00:00",
    "category": "wwe"
  },
  {
    "title": "REPORT: EVOLVE Men's Champion Jackson Drake's WWE ID Contract Renewed",
    "summary": "The champion is staying with the program. Over the last week, talents such as Zayda Steel, Kylie Rae, Zara Zakher, and others have either opted not to sign a new WWE I.D. contract, their deals were...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/report-evolve-mens-champion-jackson-drakes-wwe-id-contract-renewed",
    "publishedAt": "2025-10-12T01:22:56+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Hall Of Famer Calls John Cena’s Crown Jewel Match Against AJ Styles A Masterclass",
    "summary": "AJ Styles and John Cena put on a show at WWE Crown Jewel, with many fans hailing their match as an instant classic. One WWE Legend also had high praise for the match. In a recent social media post,...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584503-wwe-hall-of-famer-calls-john-cena-crown-jewel-match-against-aj-styles-a-masterclass",
    "publishedAt": "2025-10-12T00:15:15+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Crown Jewel Highlights – Cena vs. Styles and more!",
    "summary": "WWE has posted higlights from Saturday’s Crown Jewel premium live event that aired live on ESPN in the… The post WWE Crown Jewel Highlights – Cena vs. Styles and more! appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/364002-wwe-crown-jewel-highlights-cena-vs-styles-and-more/",
    "publishedAt": "2025-10-11T22:45:00+00:00",
    "category": "wwe"
  },
  {
    "title": "The Undertaker Praises John Cena-AJ Styles WWE Crown Jewel Match",
    "summary": "John Cena defeated AJ Styles in a singles match at the 2025 WWE Crown Jewel event. Following the conclusion of the match, both competitors showed respect for one another. The Undertaker later posted...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/undertaker-praises-john-cena-styles-wwe-crown-jewel-match/",
    "publishedAt": "2025-10-11T21:22:45+00:00",
    "category": "wwe"
  },
  {
    "title": "John Cena: Meet The WWE Superstar's Wife",
    "summary": "WWE fans may wonder who exactly Shay Shariatzadeh is, given her relatively low public profile after becoming and item with and eventually marrying John Cena.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1988350/john-cena-wife-wwe/",
    "publishedAt": "2025-10-11T21:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Seth Rollins Teases Potential Injury Following WWE Crown Jewel",
    "summary": "Seth Rollins put it all on the line today at WWE Crown Jewel to finally defeat Cody Rhodes in a one-on-one matchup. But at what cost? During the main event of WWE Crown Jewel, Seth Rollins and Cody...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584486-seth-rollins-teases-potential-injury-following-wwe-crown-jewel",
    "publishedAt": "2025-10-11T21:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "CM Punk Reveals How 'Iconic' WWE Theme Song Came About In Spite Of Vince McMahon",
    "summary": "CM Punk revealed how he got to use \"Cult of Personality\" as his theme song in WWE, despite Vince McMahon and his issues with licensed music.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1989948/cm-punk-iconic-wwe-theme-song-came-about-spite-vince-mcmahon-living-colour-cult-of-personality/",
    "publishedAt": "2025-10-11T20:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Triple H Tells WWE Universe They Can’t Have Edge And They Respond In Hilarious Fashion",
    "summary": "On this day, Triple H doesn’t see clearly in regards to what the Australian WWE Universe wants. Earlier today on the WWE Crown Jewel Post Show, Chief Content Officer Triple H took center stage to...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584482-triple-h-tells-wwe-universe-they-cant-have-edge-and-they-respond-in-hilarious-fashion",
    "publishedAt": "2025-10-11T20:00:00+00:00",
    "category": "wwe"
  }
]