[
  {
    "title": "WWE Legend Explains Why Brock Lesnar Vs. John Cena Is Kicking Off Wrestlepalooza Instead Of Main Eventing",
    "summary": "On the latest episode of “Busted Open Radio,” hosts Bully Ray and Dave Lagreca engaged in a spirited debate and preview of tomorrow’s WWE Wrestlepalooza premium live event, focusing on the major...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-legend-explains-why-brock-lesnar-john-cena-kicking-off-wrestlepalooza-instead-main-eventing/",
    "publishedAt": "2025-09-19T17:48:43+00:00",
    "category": "wwe"
  },
  {
    "title": "Triple H Opens Up On Health Scare, Family, And Why Your Spouse Is The “Most Important Decision You’ll Ever Make”",
    "summary": "WWE Chief Content Officer Paul “Triple H” Levesque recently sat for an in-depth interview at the TEDSports Indianapolis 2025 event, hosted by co-chair Patrick Talty. Levesque discussed a wide range...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/triple-opens-health-scare-family-why-your-spouse-most-important-decision-youll-ever-make/",
    "publishedAt": "2025-09-19T17:36:01+00:00",
    "category": "wwe"
  },
  {
    "title": "Triple H Speaks About CM Punk Being A 'Massive Character' For WWE, Says The Character & Phil Brooks Are Almost The Same Person",
    "summary": "Paul Levesque chats Punk. The dynamic between CM Punk and WWE Chief Content Officer Paul 'Triple H' Levesque has been delved into by both of them since Punk returned to WWE in November 2023. It is...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/triple-h-speaks-about-cm-punk-being-a-massive-character-for-wwe-says-the-character-phil-brooks-are-almost-the-same-person",
    "publishedAt": "2025-09-19T17:34:17+00:00",
    "category": "wwe"
  },
  {
    "title": "Triple H Details How Quickly The Idea Came Together To Do WWE Wrestlepalooza PLE",
    "summary": "The PLE came together in a short window. As WWE is inching closer to its Wrestlepalooza Premium Live Event on September 20th, talents and executives are making the media rounds to promote it. WWE...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/triple-h-details-how-quickly-the-idea-came-together-to-do-wwe-wrestlepalooza-ple",
    "publishedAt": "2025-09-19T17:17:24+00:00",
    "category": "wwe"
  },
  {
    "title": "Brock Lesnar Segment, Two Title Matches Set For WWE SmackDown",
    "summary": "WWE has announced a loaded lineup for tonight’s episode of Friday Night SmackDown, the final broadcast before this weekend’s inaugural Wrestlepalooza premium live event. The show will feature two...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/brock-lesnar-segment-two-title-matches-set-wwe-smackdown/",
    "publishedAt": "2025-09-19T17:07:24+00:00",
    "category": "wwe"
  },
  {
    "title": "Adam Copeland Says He Had A Chance To Wrestle John Cena Again When He Was Still With WWE",
    "summary": "John Cena vs. Adam Copeland (Edge in WWE) was a feud that defined the Ruthless Aggression era as the two men took each other to new heights. Cena is now on his retirement tour, finishing his in-ring...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/adam-copeland-says-he-had-a-chance-to-wrestle-john-cena-again-when-he-was-still-with-wwe",
    "publishedAt": "2025-09-19T17:03:57+00:00",
    "category": "wwe"
  },
  {
    "title": "Triple H Accuses Stephen A. Smith Of “Bait And Switch” With Goldberg Ranked #1 Among Greatest Pro Wrestlers",
    "summary": "WWE Chief Content Officer Triple H joined ESPN’s “First Take” on Friday to promote the inaugural Wrestlepalooza premium live event. During the appearance, he discussed the new partnership with ESPN,...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/triple-accuses-stephen-smith-bait-switch-goldberg-ranked-among-greatest-pro-wrestlers/",
    "publishedAt": "2025-09-19T16:46:26+00:00",
    "category": "wwe"
  },
  {
    "title": "Brock Lesnar Interview, Two Titles Bouts Added To 9/19 WWE SmackDown",
    "summary": "Brock Lesnar is set to speak on the September 19th episode of WWE SmackDown. Lesnar will face John Cena at WWE Wrestlepalooza on Saturday. In the ring, Sami Zayn will defend the WWE United States...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/brock-lesnar-interview-two-titles-bouts-added-to-9-19-wwe-smackdown",
    "publishedAt": "2025-09-19T16:21:46+00:00",
    "category": "wwe"
  },
  {
    "title": "Bully Ray Wants Something Very Specific From WWE's Becky Lynch, With AJ Lee",
    "summary": "Recalling an old feud of his, the WWE Hall of Famer said he wants to see \"intent\" out of Lynch, when it comes to how she handles Lee.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1972837/wwe-bully-ray-becky-lynch-aj-lee-target-intent/",
    "publishedAt": "2025-09-19T16:09:44+00:00",
    "category": "wwe"
  },
  {
    "title": "An Infamous WrestleMania Streak Is In Jeopardy Of Ending in 2027",
    "summary": "WrestleMania 43 could mark the end of another “streak” in WWE history. The Undertaker’s WrestleMania win streak shockingly came to an end at WrestleMania 30 at the hands of Brock Lesnar. Thanks to...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1579059-wwe-wrestlemania-43-infamous-streak-in-jeopardy-of-ending",
    "publishedAt": "2025-09-19T16:06:20+00:00",
    "category": "wwe"
  },
  {
    "title": "Scott D'Amore Confirms WWE's Brock Lesnar Was In Talks With TNA Wrestling At One Time",
    "summary": "Former TNA executive Scott D'Amore recalled Brock Lesnar's desire to join TNA, after a WWE Hall of Famer conveyed Lesnar's interest to the company.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1972588/scott-damore-confirms-wwe-brock-lesnar-in-talks-tna-wrestling-2007/",
    "publishedAt": "2025-09-19T16:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Absent WWE Star Spotted At SmackDown Location — Possible Spoiler",
    "summary": "It appears that an absent WWE Superstar could be making his return to WWE TV. Shinsuke Namakura has not been featured on WWE programming in several months. His last appearance came during a match on...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1579055-absent-wwe-star-spotted-smackdown-location-possible-spoiler",
    "publishedAt": "2025-09-19T15:50:55+00:00",
    "category": "wwe"
  },
  {
    "title": "Nick Khan Reveals When WWE Considered Entering The Site Fee Business",
    "summary": "Nick Khan says WWE took a page out of UFC’s book when it came to a new revenue stream. Puck News’ John Ourand released a new feature about TKO’s success in securing site fees for its UFC and WWE...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1579051-nick-khan-when-wwe-enter-the-site-fee-business",
    "publishedAt": "2025-09-19T15:36:22+00:00",
    "category": "wwe"
  },
  {
    "title": "Jimmy Uso Ready to Test The Usos’ Legacy at WWE Wrestlepalooza",
    "summary": "Jimmy Uso is excited to reunite with his brother Jey Uso at WWE Wrestlepalooza. The Usos, who previously teamed up in March against A-Town Down Under, are back as a permanent duo. They will face The...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1579005-jimmy-uso-uses-wrestlepalooza-the-usos-legacy",
    "publishedAt": "2025-09-19T15:13:32+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Star Says John Cena vs. Brock Lesnar Will Be Uncomfortable To Watch",
    "summary": "Big E believes he already knows what’s in store when Brock Lesnar and John Cena step in the ring at WrestlePalooza. This week’s RAW Recap saw Big E previewing Lesnar vs. Cena, and he used the...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1579021-john-cena-vs-brock-lesnar-will-be-uncomfortable-to-watch-wwe-star",
    "publishedAt": "2025-09-19T15:08:54+00:00",
    "category": "wwe"
  }
]