[
  {
    "title": "Jacy Jayne Speaks Highly Of Dakota Kai: \"I’ve Had The Best Experiences With Her... She’s A Class Act\"",
    "summary": "Praise from Jacy Jayne for Dakota Kai. The reigning NXT Women's Champion, Jacy Jayne, guest appeared on Busted Open, and along the way, she was asked to put together a fantasy trio with two talents...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/jacy-jayne-speaks-highly-of-dakota-kai-ive-had-the-best-experiences-with-her-shes-a-class-act",
    "publishedAt": "2025-10-22T18:03:38+00:00",
    "category": "wwe"
  },
  {
    "title": "Nikki Bella Had A Very Special Guest At WWE RAW",
    "summary": "Nikki Bella had a special guest at WWE Raw this week. For the millions of fans watching at home and the thousands in attendance, Paul Heyman welcomed them to WWE Monday Night Raw this week. For the...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585981-nikki-bella-very-special-guest-wwe-raw",
    "publishedAt": "2025-10-22T17:52:19+00:00",
    "category": "wwe"
  },
  {
    "title": "Jacy Jayne Explains Why She Got Chills During Tatum Paxley's Promo On 10/21 WWE NXT",
    "summary": "Jayne speaks highly of Paxley. On the marquee for NXT's Halloween Havoc Premium Live Event is Tatum Paxley challenging Jacy Jayne for the NXT Women's Championship. There was an in-ring segment with...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/jacy-jayne-explains-why-she-got-chills-during-tatum-paxleys-promo-on-10-21-wwe-nxt",
    "publishedAt": "2025-10-22T17:50:08+00:00",
    "category": "wwe"
  },
  {
    "title": "Jacy Jayne On Lainey Reid Joining Fatal Influence: \"I Don’t Wanna Say 'Upgrade' Because That’s So Mean... She’s Gonna Do A Good Job\"",
    "summary": "Jayne speaks highly of the new Fatal Influence member. As Jazmyn Nyx was on her way out of WWE, she was written off of television when she was ambushed by a mystery attacker. The attacker revealed...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/jacy-jayne-on-lainey-reid-joining-fatal-influence-i-dont-wanna-say-upgrade-because-thats-so-mean-shes-gonna-do-a-good-job",
    "publishedAt": "2025-10-22T17:32:30+00:00",
    "category": "wwe"
  },
  {
    "title": "Justin Credible Says He Doesn't Care About WWE Hall Of Fame, But Does Want A Legends Contract",
    "summary": "Justin Credible started his career in the early '90s and had a run in WWE as Aldo Montoya before becoming ECW Champion in ECW as Credible. He returned to WWE after ECW closed, still working as...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/justin-credible-says-he-doesnt-care-about-wwe-hall-of-fame-but-does-want-a-legends-contract",
    "publishedAt": "2025-10-22T17:30:35+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Announces New Date For 2026 Money In The Bank PLE In New Orleans",
    "summary": "Next year's WWE Money in the Bank is changing dates, and the company announced which venue in New Orleans will serve as host.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2004528/wwe-money-in-the-bank-2026-new-date-details-new-orleans-wrestlemania-42/",
    "publishedAt": "2025-10-22T17:27:34+00:00",
    "category": "wwe"
  },
  {
    "title": "Former WWE/WCW Star Says He Spoke To Chris Jericho And Suggests Jericho Might Stay With AEW",
    "summary": "On “The Cat’s Corner” podcast, host Ernest “The Cat” Miller discussed the ongoing speculation surrounding Chris Jericho’s contract status with AEW and a potential return to WWE. Miller claimed he had...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/former-wwe-wcw-star-says-spoke-chris-jericho-suggests-jericho-might-stay-aew/",
    "publishedAt": "2025-10-22T17:11:24+00:00",
    "category": "wwe"
  },
  {
    "title": "Felony Case Against Former WWE Star Has Been Postponed",
    "summary": "A court hearing in Warren County, Tennessee, for the criminal case against former WWF and Memphis Wrestling star Mike “Duke” Droese, which was scheduled for this morning, has been postponed. The...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/felony-case-against-former-wwe-star-been-postponed/",
    "publishedAt": "2025-10-22T16:36:58+00:00",
    "category": "wwe"
  },
  {
    "title": "Jessika Carr: It's Wild That Someone Keeps Talking About Me When All They've Been Doing Is Tapping Out, Getting Counted Out, And Taking The Easy Way Out",
    "summary": "Jessika Carr calls out Becky Lynch, but not by name. On the October 20th edition of WWE Monday Night RAW, Becky Lynch faced off with Maxxine Dupri for the second time, this time for the WWE Women's...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/jessika-carr-its-wild-that-someone-keeps-talking-about-me-when-all-theyve-been-doing-is-tapping-out-getting-counted-out-and-taking-the-easy-way-out",
    "publishedAt": "2025-10-22T16:34:21+00:00",
    "category": "wwe"
  },
  {
    "title": "Former WWE Star Scotty 2 Hotty Gets Engaged",
    "summary": "Congratulations are in order for Scott Garland, known to wrestling fans as Scotty 2 Hotty. Garland shared the news of his engagement on his official Facebook page. In his post, Garland noted that his...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/former-wwe-star-scotty-hotty-gets-engaged/",
    "publishedAt": "2025-10-22T16:23:13+00:00",
    "category": "wwe"
  },
  {
    "title": "Pre-sale code for tickets and schedule released for WWE Live Holiday Tour",
    "summary": "WWE have announced the schedule for their Live Holiday Tour for all of December and the beginning of… The post Pre-sale code for tickets and schedule released for WWE Live Holiday Tour appeared first...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/365132-pre-sale-code-for-tickets-and-schedule-released-for-wwe-live-holiday-tour/",
    "publishedAt": "2025-10-22T15:59:10+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Referee Calls Out Becky Lynch",
    "summary": "A social media post from WWE official Jessika Carr has captured the attention of fans, as she appeared to take direct aim at Women’s Intercontinental Champion Becky Lynch. In a tweet that continues...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-referee-calls-out-becky-lynch/",
    "publishedAt": "2025-10-22T15:46:44+00:00",
    "category": "wwe"
  },
  {
    "title": "Ricky Saints Gives NXT Fan A Heartwarming Sendoff",
    "summary": "Ricky Saints honors one of WWE NXT‘s biggest fans. Tuesday’s episode of WWE NXT ended with NXT Champion Ricky Saints sending Trick Williams crashing through the table in which they signed their title...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585948-ricky-starks-gives-nxt-fan-a-heartwarming-sendoff",
    "publishedAt": "2025-10-22T15:37:08+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE 2026 Money in the Bank date and location announced",
    "summary": "WWE has announced that the 2026 Money in the Bank Premium Live Event will take place on Sunday,… The post WWE 2026 Money in the Bank date and location announced appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/365120-wwe-2026-money-in-the-bank-date-and-location-announced/",
    "publishedAt": "2025-10-22T15:17:47+00:00",
    "category": "wwe"
  },
  {
    "title": "Seth Rollins Comments After Having Surgery",
    "summary": "Seth Rollins is on the mend. Rollins suffered an injury in his match against Cody Rhodes at WWE Crown Jewel in Perth. After his victory over Rhodes, Rollins had mentioned that he experienced a rough...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585949-seth-rollins-comments-after-having-surgery",
    "publishedAt": "2025-10-22T15:14:34+00:00",
    "category": "wwe"
  }
]