[
  {
    "title": "Vince McMahon’s Gimmick Idea That Natalya “Did Not Want To Do”",
    "summary": "Natalya has spoken about the significant pressure she faced during the Divas Era of WWE. She admits she felt unworthy of being a champion and details why she agreed to one of the most infamous...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/vince-mcmahons-gimmick-idea-natalya-did-not-want/",
    "publishedAt": "2025-10-21T12:20:12+00:00",
    "category": "wwe"
  },
  {
    "title": "Maxxine Dupri: There's Definitely Been A Lot Of Training That I'm Not Posting Or Sharing",
    "summary": "Maxxine Dupri says that there is definitely training that she hasn't been posting or sharing. Over the course of her WWE career, Maxxine Dupri has been learning on the job after initially being...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/maxxine-dupri-theres-definitely-been-a-lot-of-training-that-im-not-posting-or-sharing",
    "publishedAt": "2025-10-21T12:09:34+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE NXT Preview, Start Time, How To Watch (10/21): Trick Williams And Ricky Saints Contract Signing",
    "summary": "Viewership information and lineup for the October 21, 2025 episode of WWE NXT. WWE NXT (October 21, 2025) Venue: WWE Performance Center City: Orlando, FL Time: 8pm ET How To Watch: CW Network (US),...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/wwe-nxt-preview-start-time-how-to-watch-10-21-trick-williams-and-ricky-saints-contract-signing",
    "publishedAt": "2025-10-21T12:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "MVP Says He's Told Younger Talent In AEW About Doing Too Many False Finishes",
    "summary": "MVP is a well-traveled veteran who has worked in WWE, NJPW, TNA, and now AEW. With experience comes knowledge, and he's willing to pass that knowledge on to the younger generation if they want it....",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/mvp-says-hes-told-younger-talent-in-aew-about-doing-too-many-false-finishes",
    "publishedAt": "2025-10-21T11:58:17+00:00",
    "category": "wwe"
  },
  {
    "title": "Maxxine Dupri: I Don't Want To Win By DQ, I Want To Win By Pinning Becky Lynch's Shoulders Down Or By Her Tapping Out",
    "summary": "Maxxine Dupri wants to pin or make Becky Lynch submit. On this week's edition of WWE Monday Night RAW, Maxxine Dupri would face off with Becky Lynch for the WWE Women's Intercontinental Championship...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/maxxine-dupri-i-dont-want-to-win-by-dq-i-want-to-win-by-pinning-becky-lynchs-shoulders-down-or-by-her-tapping-out",
    "publishedAt": "2025-10-21T11:44:20+00:00",
    "category": "wwe"
  },
  {
    "title": "Mustafa Ali Remembers Early Ideas For WWE's RETRIBUTION Stable, Sonya Deville Being Suggested As A Leader",
    "summary": "A new revelation for the RETRIBUTION faction. The RETRIBUTION faction existed in WWE from 2020 to 2021. The members consisted of Mustafa Ali, Donovan Dijak (T-BAR), Mason Madden (Mace), Shane Haste...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/mustafa-ali-remembers-early-ideas-for-wwes-retribution-stable-sonya-deville-being-suggested-as-a-leader",
    "publishedAt": "2025-10-21T11:33:20+00:00",
    "category": "wwe"
  },
  {
    "title": "Mustafa Ali Says He & Buddy Matthews Were Not Allowed To Use Weapons In No DQ Match On 205 Live Because WWE Extreme Rules PLE Was Coming Up",
    "summary": "A marquee moment from Ali's 205 Live run. Mustafa Ali's run with WWE kick-started with him participating in the Cruiserweight Classic tournament. That parlayed into him being a part of the...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/mustafa-ali-says-he-buddy-matthews-were-not-allowed-to-use-weapons-in-no-dq-match-on-205-live-because-wwe-extreme-rules-ple-was-coming-up",
    "publishedAt": "2025-10-21T11:18:41+00:00",
    "category": "wwe"
  },
  {
    "title": "Mickie James: “I Set Out And Achieved All My Goals. I Don’t Really Have Anything Else To Prove”",
    "summary": "Mickie James, a multi-time former women’s champion, recently addressed the possibility of returning to WWE for one final run. However, she believes she has already achieved everything she set out to...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/tna-news/mickie-james-set-out-achieved-all-goals-dont-really-have-anything-else-prove/",
    "publishedAt": "2025-10-21T11:15:47+00:00",
    "category": "wwe"
  },
  {
    "title": "Mustafa Ali Recounts Vince McMahon's Thoughts About RETRIBUTION Faction: \"Vince’s Thing Was This Wasn’t A Knock On Antifa\"",
    "summary": "McMahon asserted that the group was not a knock on antifa. The RETRIBUTION stable that existed in WWE from 2020 to 2021 was headed up by Mustafa Ali. His time in the group was brought up as he was...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/mustafa-ali-recounts-vince-mcmahons-thoughts-about-retribution-faction-vinces-thing-was-this-wasnt-a-knock-on-antifa",
    "publishedAt": "2025-10-21T11:02:13+00:00",
    "category": "wwe"
  },
  {
    "title": "Sheamus Declares His ‘Never Retiring Tour’ Is Underway",
    "summary": "Sheamus, who had been sidelined since WWE Clash In Paris, made his return to in-ring action on last night’s episode of WWE Raw in Sacramento, California. The Irishman’s return came as he competed in...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/sheamus-declares-his-never-retiring-tour-underway/",
    "publishedAt": "2025-10-21T10:43:31+00:00",
    "category": "wwe"
  },
  {
    "title": "Big E Predicts Championship Future For WWE Raw Star",
    "summary": "Following last night’s episode of WWE Raw in Sacramento, California, Big E gave high praise to Roxanne Perez, a member of The Judgment Day, for her performance and potential on the official WWE Raw...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/big-predicts-championship-future-wwe-raw-star/",
    "publishedAt": "2025-10-21T10:38:44+00:00",
    "category": "wwe"
  },
  {
    "title": "Karrion Kross: “I Was The One Getting Worked” In WWE Departure",
    "summary": "Killer Kross, a former NXT Champion, has finally answered a persistent question from wrestling fans. He stated that the controversial nature of his WWE departure was indeed “one big work”—but with a...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/karrion-kross-one-getting-worked-wwe-departure/",
    "publishedAt": "2025-10-21T10:34:22+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Hall of Famer set for MLW appearance on 11/20",
    "summary": "MLW has announced that WWE Hall of Famer Arn Anderson will make a special appearance at the MLW… The post WWE Hall of Famer set for MLW appearance on 11/20 appeared first on WWE News, WWE Results,...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/365051-wwe-hall-of-famer-set-for-mlw-appearance-on-11-20/",
    "publishedAt": "2025-10-21T05:50:44+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE RAW 10/20/2025: 3 Things We Hated And 3 Things We Loved",
    "summary": "On a night that saw the World Heavyweight Title vacated, here are three things we hated and three things we loved about the 10/20/25 episode of \"WWE Raw.\"",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2002800/wwe-raw-october-20-2025-3-things-we-hated-3-things-we-loved/",
    "publishedAt": "2025-10-21T05:06:00+00:00",
    "category": "wwe"
  },
  {
    "title": "New documentary from Killer Kross now available",
    "summary": "Killer Kross has posted a new documentary “My Life After WWE”, on his YouTube Channel. You can watch… The post New documentary from Killer Kross now available appeared first on WWE News, WWE Results,...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/misc-news/365043-new-documentary-from-killer-kross-now-available/",
    "publishedAt": "2025-10-21T03:43:42+00:00",
    "category": "wwe"
  }
]