[
  {
    "title": "TJ Charles: It Wasn't Luck That Zozaya Got Signed, He Put In The Hours And It's Completely 100% Deserved",
    "summary": "TJ Charles says that Zozaya has earned his way to signing with WWE. Earlier this year, prior to WrestleMania, WWE would host European tryouts in London that featured several pro wrestlers. Coming out...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/tj-charles-it-wasnt-luck-that-zozaya-got-signed-he-put-in-the-hours-and-its-completely-100-deserved",
    "publishedAt": "2025-10-23T18:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "What These Famous 80s Wrestlers Are Doing Today",
    "summary": "From the convention circuit to continued appearances with WWE, many of the most famous wrestlers from the 1980s are still working today.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2004389/what-famous-80s-wrestlers-doing-today/",
    "publishedAt": "2025-10-23T18:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Backstage News On Liv Morgan’s Expected WWE Return Timeline",
    "summary": "There is an update on the status of injured WWE star Liv Morgan, according to a report from PWInsiderElite.com. Morgan has been out of action since suffering a separated shoulder earlier this year....",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/backstage-news-liv-morgans-expected-wwe-return-timeline/",
    "publishedAt": "2025-10-23T17:47:29+00:00",
    "category": "wwe"
  },
  {
    "title": "Billy Dixson Says A Current NXT Writer Told Him To Be A Wrestler That Happens To Be Gay As Opposed To A Gay Wrestler",
    "summary": "Billy Dixson reveals some baffling advice that he received from someone in NXT. Responding to a question prompt on social media, the 30 year old independent star revealed that a current writer for...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/billy-dixson-says-a-current-nxt-writer-told-him-to-be-a-wrestler-that-happens-to-be-gay-as-opposed-to-a-gay-wrestler",
    "publishedAt": "2025-10-23T17:38:32+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE SmackDown viewership and key demo up for Crown Jewel fallout",
    "summary": "According to Programming Insider, last Friday’s episode of WWE SmackDown, live on the USA Network came in with… The post WWE SmackDown viewership and key demo up for Crown Jewel fallout appeared...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/365227-wwe-smackdown-viewership-and-key-demo-up-for-crown-jewel-fallout/",
    "publishedAt": "2025-10-23T17:25:41+00:00",
    "category": "wwe"
  },
  {
    "title": "Kurt Angle Shares Key Role Vince McMahon Played In His Success In WWE",
    "summary": "Kurt Angle has revealed the vital role Vince McMahon played in the development of his character in WWE and its success. Speaking on the Ariel Helwani Show, WWE Hall of Famer and Olympic Gold Medalist...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586226-kurt-angle-shares-key-role-vince-mcmahon-played-in-his-success-in-wwe",
    "publishedAt": "2025-10-23T17:10:15+00:00",
    "category": "wwe"
  },
  {
    "title": "AJ Styles Reflects On WWE Crown Jewel Match With John Cena",
    "summary": "Reflecting on their WWE Crown Jewel match in a recent interview, SAJ tyles shared what he really thinks of John Cena following their final rivalry.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2005387/aj-styles-wwe-crown-jewel-match-john-cena/",
    "publishedAt": "2025-10-23T17:06:40+00:00",
    "category": "wwe"
  },
  {
    "title": "Former WWE Writer Reveals Charles Manson Wanted To Meet Bray Wyatt, WWE 'Immediately' Shut Idea Down",
    "summary": "Stories about the late Windham Rotunda. The newest episode of Freddie Prinze Jr.'s Wrestling with Freddie podcast featured former WWE writer Nick Manfredini. Manfredini worked closely with the late...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/former-wwe-writer-reveals-charles-manson-wanted-to-meet-bray-wyatt-wwe-immediately-shut-idea-down",
    "publishedAt": "2025-10-23T16:55:26+00:00",
    "category": "wwe"
  },
  {
    "title": "Karrion Kross Addresses Whether Post-Mania Rant Affected WWE Contract Negotiations",
    "summary": "Karrion Kross addresses whether or not his viral post-WrestleMania rant affected his contract negotiations with WWE in the months that followed",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2005366/wwe-wrestlemania-karrion-kross-viral-rant-contract-negotiations/",
    "publishedAt": "2025-10-23T16:52:22+00:00",
    "category": "wwe"
  },
  {
    "title": "Jelly Roll Says His Dream Scenario Is To Have A Six To Nine Month Run In WWE",
    "summary": "Jelly Roll caught the wrestling bug at WWE SummerSlam, making his in-ring debut in a tag team match alongside Randy Orton against Logan Paul and Drew McIntyre. While it is unknown when he will return...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/jelly-roll-says-his-dream-scenario-is-to-have-a-six-to-nine-month-run-in-wwe",
    "publishedAt": "2025-10-23T16:39:58+00:00",
    "category": "wwe"
  },
  {
    "title": "RAW GM Adam Pearce Teases Having Some Fun In Match With SmackDown Star",
    "summary": "WWE Raw General Manager Adam Pearce has teased an interesting match with a SmackDown star. During a recent appearance on Gorilla Position, Raw General Manager and former five-time NWA World’s...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586209-raw-gm-adam-pearce-teases-fun-match-with-smackdown-star",
    "publishedAt": "2025-10-23T16:29:13+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE's Naomi Shares Sonogram In Which Baby Appears To Be Imitating Uncle Jey Uso",
    "summary": "Naomi's baby is seen \"yeeting\" in recent photo from her sonogram this week.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2005337/wwe-naomi-sonogram-baby-imitating-jey-uso-yeet/",
    "publishedAt": "2025-10-23T16:25:14+00:00",
    "category": "wwe"
  },
  {
    "title": "D-Von Dudley Claims A ‘Higher Up’ Said He Didn’t Like Him Due To The Color Of His Skin",
    "summary": "WWE Hall of Famer D-Von Dudley opens up about a major challenge he endured during his original run in WWE. Inside the ring, D-Von Dudley is widely regarded as one of the best tag team wrestlers of...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586207-d-von-dudley-claims-higher-up-didnt-like-him-color-of-skin",
    "publishedAt": "2025-10-23T16:08:22+00:00",
    "category": "wwe"
  },
  {
    "title": "Scott D'Amore: WWE Cutting Wes Lee Was A Mistake, Watch For Him To Prove That Very Soon",
    "summary": "Scott D'Amore talks Wes Lee's release. On Friday, October 10, Wes Lee was released from WWE alongside other names like Stevie Turner, Lance Anoa’i, Jin Tala, and Drako Knox. The departure came as a...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/scott-damore-wes-lee-wwe-263977",
    "publishedAt": "2025-10-23T15:52:03+00:00",
    "category": "wwe"
  },
  {
    "title": "Jelly Roll Reveals Original Pitch For Him To Win SummerSlam Match",
    "summary": "Jelly Roll recalls the original plans for him at WWE SummerSlam 2025. Unlike most celebrities, Jelly Roll marked his WWE in-ring debut with a loss, courtesy of a Frog Splash from Logan Paul at WWE...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586193-jelly-roll-reveals-original-pitch-for-him-to-win-summerslam-match",
    "publishedAt": "2025-10-23T15:31:05+00:00",
    "category": "wwe"
  }
]