[
  {
    "title": "The Undertaker Says He Did Not Want The Streak To End At WWE WrestleMania 30",
    "summary": "On the latest episode of his “Six Feet Under” podcast, The Undertaker addressed the controversial end to his legendary WrestleMania streak, stating that the decision to lose to Brock Lesnar at...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/undertaker-says-did-not-want-streak-end-wwe-wrestlemania/",
    "publishedAt": "2025-10-01T17:26:39+00:00",
    "category": "wwe"
  },
  {
    "title": "Stephanie Vaquer Reveals New Tattoo After WWE Women’s World Title Win",
    "summary": "Stephanie Vaquer’s first reign as WWE Women’s World Champion is off to a memorable start, and she now has the ink to prove it. Following her first appearance as the new champion on the October 1,...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/stephanie-vaquer-reveals-new-tattoo-after-wwe-womens-world-title-win/",
    "publishedAt": "2025-10-01T17:17:03+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE LFG Contestant Has Been Working With A Serious Injury",
    "summary": "Brayden “BJ” Ray worked through a serious injury on WWE LFG. As WWE LFG season two heads into its finale, a contestant has a revelation about his time on the show. Over on X, Brayden “BJ” Ray shared...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582590-wwe-lfg-contestant-has-been-working-with-a-serious-injury",
    "publishedAt": "2025-10-01T16:48:14+00:00",
    "category": "wwe"
  },
  {
    "title": "IShowSpeed Tries To RKO Randy Orton",
    "summary": "Randy Orton is one of the legendary stars in the history of WWE. Over the past few years, the Viper has been engaged in many historic moments and matches. Recently, the Apex Predator made his...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582593-ishowspeed-tries-to-rko-randy-orton",
    "publishedAt": "2025-10-01T16:45:01+00:00",
    "category": "wwe"
  },
  {
    "title": "Bishop Dyer Discusses The Origin Of His New Ring Name And Game Of Thrones' Influence",
    "summary": "Bishop Dyer discusses the origin of his new ring name. Since making his debut in WWE in 2012, Dyer wrestled under the ring name Baron Corbin up until his time with the company came to an end with his...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/bishop-dyer-discusses-the-origin-of-his-new-ring-name-and-game-of-thrones-influence",
    "publishedAt": "2025-10-01T16:40:35+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Hall Of Famer Kevin Nash Discusses Recent Heart Procedure",
    "summary": "The former NWO founder and member of the Kliq discussed his recent outpatient procedure to fix an irregular heartbeat.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1984135/wwe-kevin-nash-recent-heart-procedure/",
    "publishedAt": "2025-10-01T16:40:18+00:00",
    "category": "wwe"
  },
  {
    "title": "TNA President Reacts To WWE Changing NXT Invasion To ‘Showdown’ Due To Controversy",
    "summary": "TNA President Carlos Silva reacts to WWE changing the name of an upcoming event due to the controversy surrounding it. Silva spoke with WrestleZone Managing Editor Bill Pritchard to promote two of...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582588-tna-president-comments-wwe-changing-invasion-to-nxt-showdown",
    "publishedAt": "2025-10-01T16:29:02+00:00",
    "category": "wwe"
  },
  {
    "title": "Vickie Guerrero Reveals “Excuse Me!” Catchphrase Was An On-Air Accident",
    "summary": "Vickie Guerrero recently filmed a “WWE Retrospective” for the WWE Vault YouTube channel, where she shared numerous backstage stories from her long career with the company. In the video, Guerrero...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/vickie-guerrero-reveals-excuse-catchphrase-air-accident/",
    "publishedAt": "2025-10-01T16:22:40+00:00",
    "category": "wwe"
  },
  {
    "title": "Mark Henry Pitches Surprising Name As John Cena’s Final Opponent in WWE",
    "summary": "John Cena’s WWE retirement tour, which is on the horizon, will come to an end soon. The WWE Universe is already speculating multiple names as Cena’s final opponent. Recently, WWE confirmed that...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582582-mark-henry-pitches-surprising-name-john-cena-final-opponent",
    "publishedAt": "2025-10-01T16:16:29+00:00",
    "category": "wwe"
  },
  {
    "title": "Mark Henry: LA Knight “Has Proved That He Belongs”",
    "summary": "WWE Hall of Famer Mark Henry has some high praise for LA Knight, admitting that he was not initially sold on the superstar but has since been won over by his performances and connection with the...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/mark-henry-knight-proved-belongs/",
    "publishedAt": "2025-10-01T16:00:18+00:00",
    "category": "wwe"
  },
  {
    "title": "Netflix Bringing 'Ultimate Sports Fan Experience' To Perth, Australia For WWE Crown Jewel Weekend",
    "summary": "Netflix x WWE partnership continues to expand. Coming up on October 11th is WWE's Crown Jewel Premium Live Event, taking place in Perth, Australia. The October 10th Friday Night SmackDown and the...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/netflix-bringing-ultimate-sports-fan-experience-to-perth-australia-for-wwe-crown-jewel-weekend",
    "publishedAt": "2025-10-01T15:55:06+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Women's Champion Tiffany Stratton Explains Excitement For WrestleMania 43 In Saudi",
    "summary": "With WWE WrestleMania 43 heading to Saudi Arabia in 2027, the company's Women's Champion Tiffany Stratton was asked to comment on the decision.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1984001/wwe-womens-champion-tiffany-stratton-excitement-wrestlemania-43-saudi/",
    "publishedAt": "2025-10-01T15:17:46+00:00",
    "category": "wwe"
  },
  {
    "title": "The Miz Looks Back On WWE WrestleMania XXVII, Comments On Whether Maryse Could Return",
    "summary": "The Miz looks back on his WrestleMania XXVII main event with John Cena and what he remembers from it, and whether his wife, Maryse, could return to wrestling",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1983996/miz-wwe-wrestlemania-xxvii-maryse-return/",
    "publishedAt": "2025-10-01T15:15:16+00:00",
    "category": "wwe"
  },
  {
    "title": "Mustafa Ali Still Wants To Do A WWE 205 Live Roundtable Reunion",
    "summary": "Mustafa Ali still hopes to do a 205 Live “reunion,” but he isn’t sure how likely it is to happen. Ali recently spoke with WrestleZone Managing Editor Bill Pritchard about his tenure on WWE’s 205 Live...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1576835-mustafa-ali-205-live-roundtable-reunion",
    "publishedAt": "2025-10-01T14:18:00+00:00",
    "category": "wwe"
  },
  {
    "title": "The Miz Talks WWE History With John Cena, Anger At Not Getting AJ Styles' Opportunity",
    "summary": "The Miz, one of John Cena's arch-rivals, has discussed not having the chance to face him one last time in WWE as part of Cena's retirement tour.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1983712/miz-wwe-history-john-cena-anger-aj-styles-opportunity/",
    "publishedAt": "2025-10-01T14:00:00+00:00",
    "category": "wwe"
  }
]