[
  {
    "title": "Maxxine Dupri: Winning WWE Women's IC Title Is So Much Bigger Than Me",
    "summary": "Maxxine Dupri shocked the world, or at least Becky Lynch, on Monday's WWE Raw, winning the WWE Women's Intercontinental Championship. Dupri made her in-ring debut in July 2023 and has competed in...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/maxxine-dupri-winning-wwe-womens-ic-title-is-so-much-bigger-than-me",
    "publishedAt": "2025-11-19T18:17:57+00:00",
    "category": "wwe"
  },
  {
    "title": "CM Punk: I’m A Big Marshmallow, Ask My Wife",
    "summary": "On WWE television, CM Punk may seem intimidating, and when approached by certain foes, angry. Outside of it, though, he’s more like a S’more. While appearing on WGN9 News to promote the 2026...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591572-cm-punk-big-marshmallow-ask-my-wife",
    "publishedAt": "2025-11-19T18:17:39+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Hall Of Famer Ricky Steamboat On AEW Blood & Guts Match: 'Too Much Going On'",
    "summary": "WWE Hall of Famer Ricky Steamboat reveals that he felt this AEW Blood & Guts match had \"too much going on,\" though he's largely complimentary towards AEW",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2031119/aew-blood-guts-wwe-ricky-steamboat-too-much-going-on/",
    "publishedAt": "2025-11-19T18:05:25+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Signs NIL Athlete To Developmental Deal",
    "summary": "A new NCAA standout has made the leap to full-time professional wrestling training. WWE has signed Nebraska Track and Field star Meghan Walker, 21, to a full-time developmental contract, according to...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-signs-nil-athlete-developmental-deal/",
    "publishedAt": "2025-11-19T18:04:16+00:00",
    "category": "wwe"
  },
  {
    "title": "PHOTOS: Nick Hogan Spotted Working Out In The Ring With NWA Star",
    "summary": "After Hulk Hogan claimed his son Nick was set to compete at WrestleMania 39 against Shane McMahon (a match that ultimately did not happen), rumors of a full-time wrestling career faded for Nick...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/photos-nick-hogan-spotted-working-out-ring-nwa-star/",
    "publishedAt": "2025-11-19T17:42:14+00:00",
    "category": "wwe"
  },
  {
    "title": "ESPN Host Criticizes Cam Skattebo For Getting Involved At WWE RAW While Injured",
    "summary": "New York Giants running back Cam Skattebo made several headlines coming out of WWE Raw this week after he shoved former WWE World Tag Team Champion JD McDonagh to the floor. McDonagh, along with...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591547-espn-criticizes-cam-skattebo-involved-wwe-raw-injured",
    "publishedAt": "2025-11-19T17:33:51+00:00",
    "category": "wwe"
  },
  {
    "title": "Kofi Kingston Brags About Stealing A Little Kid’s Money",
    "summary": "Kofi Kingston is showing no remorse over taking a little kid’s money. Former WWE Champion Kofi Kingston posted a video on his X/Twitter that showed him, Xavier Woods, and Grayson Waller having a...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591554-kofi-kingston-brags-about-stealing-a-little-kids-money",
    "publishedAt": "2025-11-19T17:32:17+00:00",
    "category": "wwe"
  },
  {
    "title": "Dominik Mysterio Dislikes His Current WWE Theme, Names Song He'd Prefer To Use",
    "summary": "Dominik Mysterio airs his frustrations over his WWE entrance theme, while listing alternative options that he would rather use instead.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2031034/wwe-dominik-mysterio-dislikes-theme-names-song/",
    "publishedAt": "2025-11-19T16:47:27+00:00",
    "category": "wwe"
  },
  {
    "title": "The Rock To Be Honored by American Black Film Festival Honors",
    "summary": "Dwayne “The Rock” Johnson is set to receive a major award next year. Variety reports that the former WWE Champion turned actor will be honored at the 8th American Black Film Festival Honors, slated...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591516-the-rock-american-black-film-festival-honors",
    "publishedAt": "2025-11-19T16:26:54+00:00",
    "category": "wwe"
  },
  {
    "title": "TNA Executives Attend NXT Gold Rush Tapings",
    "summary": "Championships from WWE, TNA, and AAA are being defended across the two-week NXT Gold Rush special, which emanates from The Theater at Madison Square Garden in New York City. Within the TNA realm,...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591528-tna-executives-attend-nxt-gold-rush-tapings",
    "publishedAt": "2025-11-19T16:18:16+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Launches Undertaker YouTube Channel",
    "summary": "Fans can get their Undertaker fix on The Undertaker's official YouTube channel. The channel will serve as the new home for Taker's podcast \"Six Feet Under.\" “It comes very naturally to him, just...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/wwe-launches-undertaker-youtube-channel",
    "publishedAt": "2025-11-19T16:10:59+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE launches brand new Undertaker YouTube Channel featuring ‘Six Feet Under’ podcast",
    "summary": "Variety is featuring a story on WWE launching a brand new specialized YouTube Channel devoted specifically for The… The post WWE launches brand new Undertaker YouTube Channel featuring ‘Six Feet...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/367477-undertaker-you-tube-channel/",
    "publishedAt": "2025-11-19T16:05:11+00:00",
    "category": "wwe"
  },
  {
    "title": "Dominik Mysterio Ripping On His Deadbeat Dad Leaves ESPN Host Flustered",
    "summary": "Dominik Mysterio’s commitment to kayfabe needs to be studied. The former WWE Intercontinental Champion was a guest on ESPN First Take following the six-man outing on RAW this week. For those unaware,...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591426-dominik-mysterio-ripping-on-his-deadbeat-dad-leaves-espn-host-flustered",
    "publishedAt": "2025-11-19T16:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Launches Dedicated YouTube Channel For The Undertaker",
    "summary": "WWE is expanding its digital content strategy by launching a dedicated YouTube channel for The Undertaker, real name Mark Calaway. The channel, which goes live today, November 19, will serve as the...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-launches-dedicated-youtube-channel-undertaker/",
    "publishedAt": "2025-11-19T15:45:51+00:00",
    "category": "wwe"
  },
  {
    "title": "John Cena Adds Another Impressive Stat To His WWE Resume",
    "summary": "John Cena wrapped up his Madison Square Garden appearance for WWE with a major career milestone. The Cenation Leader appeared on his final RAW this past Monday night at the world’s most famous arena....",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591374-john-cena-adds-another-impressive-stat-to-his-wwe-resume",
    "publishedAt": "2025-11-19T15:00:00+00:00",
    "category": "wwe"
  }
]