[
  {
    "title": "The Undertaker Shares Original Inspiration For His WWE Gimmick",
    "summary": "The Undertaker has shared what was the original inspiration behind the creation of his iconic Deadman character. Speaking on the 2 Bears, 1 Cave podcast with Tom Segura, The Undertaker opened up...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1587355-the-undertaker-shares-original-inspiration-for-his-wwe-gimmick",
    "publishedAt": "2025-10-30T18:19:36+00:00",
    "category": "wwe"
  },
  {
    "title": "Former WWE, AEW Star CJ Perry Launching New Podcast, First Guest To Be SNME Competitor",
    "summary": "CJ Perry announces new project titled the \"Identity Crisis Podcast,\" with a \"WWE Raw\" star scheduled to be the first guest on the show.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2012324/former-wwe-aew-cj-perry-new-podcast-first-guest-rusev-snme/",
    "publishedAt": "2025-10-30T18:10:37+00:00",
    "category": "wwe"
  },
  {
    "title": "CJ Perry launching new podcast, her first guest revealed",
    "summary": "CJ Perry has has announced she is launching a new podcast, beginning November 3. On a new Instagram… The post CJ Perry launching new podcast, her first guest revealed appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/365791-cj-perry-launching-new-podcast-her-first-guest-revealed/",
    "publishedAt": "2025-10-30T18:08:18+00:00",
    "category": "wwe"
  },
  {
    "title": "Booker T Invites Mercedes Mone To Show Up In Reality Of Wrestling",
    "summary": "Booker T is ready to add another major star to his Reality of Wrestling promotion, and he is aiming high. On The Hall of Fame podcast, the WWE Hall of Famer was asked if he would let the...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/other/booker-invites-mercedes-mone-show-reality-wrestling/",
    "publishedAt": "2025-10-30T17:35:07+00:00",
    "category": "wwe"
  },
  {
    "title": "Natalya Wanted To Look Like One WWE Hall Of Famer, Another Convinced Her To Fight",
    "summary": "WWE's Natalya revealed she wanted to look like a WWE Hall of Famer when she first started out, but was convinced to fight for more by another WWE Hall of Famer.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2012241/wwe-natalya-torrie-wilson-beth-phoenix-fight-worthy-imposter-syndrome/",
    "publishedAt": "2025-10-30T17:18:43+00:00",
    "category": "wwe"
  },
  {
    "title": "Enzo Amore Shares The Unfortunate Way He Got Permission To Wear Sneakers On WWE TV",
    "summary": "Enzo Amore has revealed how he got permission to wear sneakers on WWE television. Speaking to Dominic DeAngelo of Brass Ring Media, former WWE Cruiserweight Champion Enzo Amore claimed he was the...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1587318-enzo-amore-shares-the-unfortunate-way-he-got-permission-to-wear-sneakers-on-wwe-tv",
    "publishedAt": "2025-10-30T17:07:21+00:00",
    "category": "wwe"
  },
  {
    "title": "Raj Dhesi (Jinder Mahal) Undergoes Knee Surgery",
    "summary": "Raj Dhesi (Jinder Mahal in WWE) announced on Instagram that he has undergone knee surgery. Dhesi noted in the video that he underwent a knee scope and showed highlights from his rehab. “2 loose...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/raj-dhesi-jinder-mahal-undergoes-knee-surgery",
    "publishedAt": "2025-10-30T17:03:26+00:00",
    "category": "wwe"
  },
  {
    "title": "Nikki Bella Teases Changes For Upcoming WWE Match",
    "summary": "Nikki Garcia, aka Nikki Bella, is reflecting on a Monday Night RAW appearance and is already teasing changes for her next match. Speaking on SiriusXM’s The Nikki and Brie Show, the WWE Hall of Famer...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/nikki-bella-teases-changes-upcoming-wwe-match/",
    "publishedAt": "2025-10-30T17:02:54+00:00",
    "category": "wwe"
  },
  {
    "title": "Former WWE Star Braun Strowman Responds To Recent Comments Made By Paul Heyman",
    "summary": "Braun Strowman is still a little confused by Paul Heyman's recent outburst towards him on Twitter.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2012203/former-wwe-braun-strowman-responds-paul-heyman/",
    "publishedAt": "2025-10-30T16:55:03+00:00",
    "category": "wwe"
  },
  {
    "title": "Tommy Dreamer Says This WWE NXT Star Brings The Same Underdog As HOFer Rey Mysterio",
    "summary": "Tommy Dreamer compares one of \"WWE NXT's\" top champions to Rey Mysterio, claiming that both competitors have the same underdog mentality.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2012189/wwe-mxt-tommy-dreamer-tatum-paxley-underdog-rey-mysterio/",
    "publishedAt": "2025-10-30T16:41:35+00:00",
    "category": "wwe"
  },
  {
    "title": "Former WWE Champion Has Knee Surgery",
    "summary": "A former WWE Champion has announced that he recently underwent knee surgery. Former WWE Champion Jinder Mahal, who currently works the independent circuit under the name Raj Dhesi, took to Instagram...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1587335-former-wwe-champion-has-knee-surgery",
    "publishedAt": "2025-10-30T16:21:23+00:00",
    "category": "wwe"
  },
  {
    "title": "Tyler Breeze Believes The Fashion Files Got Canceled By Accident, Credits Social Media Buzz For Keeping The Show Alive",
    "summary": "Tyler Breeze discusses the Fashion Files. From 2016 to 2017, Tyler Breeze and Fandango took part in a multi-episode segment on SmackDown known as the Fashion Files. The segments were very popular,...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/tyler-breeze-fashion-files-264999",
    "publishedAt": "2025-10-30T16:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "TNA Star Reflects On WWE Release: ‘I Wasn’t Ready’",
    "summary": "TNA star Dani Luna recently commented on her time in WWE. Luna was released from her WWE contract in August 2022 after a two-and-a-half-year stint as part of the NXT UK brand. She was one of many...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/tna-star-reflects-wwe-release-wasnt-ready/",
    "publishedAt": "2025-10-30T15:47:45+00:00",
    "category": "wwe"
  },
  {
    "title": "CJ Perry Is Launching A New Podcast",
    "summary": "CJ Perry (Lana in WWE) is launching a new podcast called “Identity Crisis,” which is set to premiere on November 3. Her co-host for the new show will be film producer Jonathan Saba. According to the...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/perry-launching-new-podcast/",
    "publishedAt": "2025-10-30T15:44:12+00:00",
    "category": "wwe"
  },
  {
    "title": "Kevin Nash Says This WWE Star Just Took AEW's Kenny Omega's Spot At His Favorite Wrestler",
    "summary": "WWE legend Kevin Nash has revealed that AEW star Kenny Omega is no longer his favorite wrestler, naming a current WWE star as his favorite.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2011844/wwe-aew-kevin-nash-favorite-wrestler-rhea-ripley-kenny-omega/",
    "publishedAt": "2025-10-30T15:30:00+00:00",
    "category": "wwe"
  }
]