[
  {
    "title": "WWE Selling El Grande Americano Ring Singlets",
    "summary": "WWE has dropped brand new El Grande Americano merchandise for fans to grab. WWE Shop is currently selling Americano ring singlets in three different colors across a range of sizes. The official...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1589336-wwe-selling-el-grande-americano-ring-singlets",
    "publishedAt": "2025-11-06T00:58:52+00:00",
    "category": "wwe"
  },
  {
    "title": "Cody Rhodes Reflects On WWE Departure In 2016",
    "summary": "Cody Rhodes reflects on his WWE exit in 2016. The American Nightmare left the company in 2016 to find his own niche. His journey basically took him through several promotions. Including Ring of Honor...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1589326-cody-rhodes-reflects-on-wwe-departure-in-2016",
    "publishedAt": "2025-11-06T00:46:34+00:00",
    "category": "wwe"
  },
  {
    "title": "Glenn Jacobs Isn’t In Politics For Fame, It’s To Do The Right Thing",
    "summary": "Glenn Jacobs says he chose politics to do the right thing and not to gain fame. Knox County Mayor Glenn Jacobs, AKA Kane, a legendary WWE Hall of Famer, was recently a guest on former WWE Superstar...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1589320-glenn-jacobs-isnt-in-politics-for-fame-its-to-do-the-right-thing",
    "publishedAt": "2025-11-06T00:33:23+00:00",
    "category": "wwe"
  },
  {
    "title": "Ken Shamrock Recalls The Pushback He Received From WWE Locker Room For Being An Outsider",
    "summary": "Ken Shamrock says he received some pushback from the WWE locker room for being an outsider when he first signed with the company. Ken Shamrock was already an established name in the MMA world when he...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1589309-ken-shamrock-recalls-the-pushback-he-received-from-wwe-locker-room-for-being-an-outsider",
    "publishedAt": "2025-11-06T00:26:05+00:00",
    "category": "wwe"
  },
  {
    "title": "Nick Khan & Mark Shapiro Weigh In On How WWE's Partnership With ESPN Has Played Out So Far",
    "summary": "WWE/TKO execs weigh in. WWE's partnership with ESPN officially kicked off with the Wrestlepalooza Premium Live Event airing on ESPN's new direct-to-consumer service in September. The app has since...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/nick-khan-mark-shapiro-weigh-in-on-how-wwes-partnership-with-espn-has-played-out-so-far",
    "publishedAt": "2025-11-05T23:46:51+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE GM Adam Pearce Reflects On 30 Years In The Wrestling Business",
    "summary": "Adam Pearce Celebrates 30-Year Career Milestone WWE Raw General Manager Adam Pearce recently took to social media to celebrate a major career milestone. In a heartfelt post on X, Pearce reflected on...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-adam-pearce-reflects-years-wrestling-business/",
    "publishedAt": "2025-11-05T23:23:23+00:00",
    "category": "wwe"
  },
  {
    "title": "CM Punk Sends Birthday Warning To Roxanne Perez",
    "summary": "WWE Superstar Roxanne Perez is celebrating a birthday today, and CM Punk‘s birthday gift to her is a stern warning about her recent actions. The Prodigy turned 24 years old today, and the WWE...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1589341-cm-punk-sends-birthday-warning-to-roxanne-perez",
    "publishedAt": "2025-11-05T23:14:23+00:00",
    "category": "wwe"
  },
  {
    "title": "Drew McIntyre Will Keep Pushing Forward, WWE NXT Highlights, More | Fight Size",
    "summary": "Here is your fight size update for Wednesday, November 5, 2025. - Following his loss at WWE Saturday Night's Main Event, Drew McIntyre is pushing forward:...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/drew-mcintyre-will-keep-pushing-forward-wwe-nxt-highlights-more-fight-size",
    "publishedAt": "2025-11-05T23:02:55+00:00",
    "category": "wwe"
  },
  {
    "title": "Nick Khan: We've Increased Prices Appropriately With The Marketplace",
    "summary": "WWE has increased ticket prices for live events over the years, leading to record gates in multiple markets in the past two years. Fans have criticized WWE for the increase in ticket prices, but Nick...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/nick-khan-weve-increased-prices-appropriately-with-the-marketplace",
    "publishedAt": "2025-11-05T22:45:51+00:00",
    "category": "wwe"
  },
  {
    "title": "Jackson Drake Wants To Face Austin Theory, 'I'd Go As Far To Say That It's A Dream Match'",
    "summary": "Jackson Drake wants to face Austin Theory. Drake is clearly a name that will factor into the future of NXT, as he currently holds the WWE EVOLVE Championship. Drake won the title back in April and...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/jackson-drake-austin-theory-266804",
    "publishedAt": "2025-11-05T22:33:17+00:00",
    "category": "wwe"
  },
  {
    "title": "Maven Reveals Who He Thinks Should Retire John Cena",
    "summary": "Former WWE star Maven has weighed in on who he believes should face John Cena in his final match. Cena’s farewell tour is culminating in a 16-man tournament to determine his last opponent, and Maven...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/maven-reveals-who-thinks-should-retire-john-cena/",
    "publishedAt": "2025-11-05T21:30:29+00:00",
    "category": "wwe"
  },
  {
    "title": "Bully Ray Believes He Knows How WWE Can Get Fans Invested In LA Knight",
    "summary": "Bully Ray thinks that WWE fans should not lose hope on LA Knight.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2018363/wwe-la-knight-bully-ray-fans-invested/",
    "publishedAt": "2025-11-05T21:24:33+00:00",
    "category": "wwe"
  },
  {
    "title": "TKO Announces Revenue Of $1.120 Billion For 2025 Third Quarter, WWE Revenue At $402.1 Million",
    "summary": "TKO (WWE and UFC) announced its third quarter 2025 financial results. The company announced a revenue of $1.120 billion, which down 27% from the second quarter. UFC revenue was down 8% to $325.2...",
    "source": "Fightful",
    "url": "https://www.fightful.com/mma/tko-announces-revenue-of-1-120-billion-for-2025-third-quarter-wwe-revenue-at-402-1-million",
    "publishedAt": "2025-11-05T21:20:41+00:00",
    "category": "wwe"
  },
  {
    "title": "New Match Added To Next Week’s WWE NXT",
    "summary": "A new match has been added to the lineup for the November 11th installment of WWE NXT. Via social media, it was announced that Josh Briggs and Tavion Heights will face each other in a singles match....",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/new-match-added-next-weeks-wwe-nxt/",
    "publishedAt": "2025-11-05T21:13:30+00:00",
    "category": "wwe"
  },
  {
    "title": "Absent WWE Star Naomi Reveals Baby Bump On Social Media",
    "summary": "Former Women's World Champion Naomi took time off from WWE in August after learning that she and husband Jimmy Uso were expecting.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2018238/absent-wwe-star-naomi-baby-bump/",
    "publishedAt": "2025-11-05T19:33:39+00:00",
    "category": "wwe"
  }
]