[
  {
    "title": "Darby Allin Says The Referee Saw His 'Insides Hanging Out' After Glass Spot During Sting's Last Match",
    "summary": "Darby Allin recalls one of his gnarliest spots. In March 2024, Darby Allin and Sting teamed up to face the Young Bucks at the AEW Revolution event. Contested under Tornado Tag rules, this was the...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/darby-allin-aew-261698",
    "publishedAt": "2025-10-14T02:15:36+00:00",
    "category": "aew"
  },
  {
    "title": "Darby Allin: I Was Able To Retire My Dad With The Money That I've Made From AEW",
    "summary": "Darby Allin is putting his money to good use. There have been recent headlines about Darby Allin doing great things with the money he has made from his wrestling career. For example, news broke back...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/darby-allin-aew-dad-261696",
    "publishedAt": "2025-10-14T01:54:09+00:00",
    "category": "aew"
  },
  {
    "title": "Darby Allin Praises Jon Moxley For Being A Locker Room Leader: He Has No Ego",
    "summary": "Darby Allin praises Jon Moxley ahead of AEW WrestleDream. Mark Briscoe recently made headlines with his comments about Orange Cassidy being a locker room leader in AEW. Now, it's Darby Allin's turn,...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/darby-allin-jon-moxley-wwe-261687",
    "publishedAt": "2025-10-14T01:08:00+00:00",
    "category": "aew"
  },
  {
    "title": "AEW's Andrade Reportedly Pulled From Lucha Libre Show In Atlanta, No Reason Given",
    "summary": "AEW star Andrade has reportedly been pulled from a lucha libre show in Atlanta, where he was supposed to face LA Park, with no reason given for his removal",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1995823/aew-andrade-pulled-lucha-libre-atlanta-no-reason-given/",
    "publishedAt": "2025-10-13T21:55:48+00:00",
    "category": "aew"
  },
  {
    "title": "Dave Meltzer Reveals AEW Creative Plans For Kota Ibushi Before Injury On Collision",
    "summary": "Dave Meltzer reveals what AEW's creative plans were for Kota Ibushi before he suffered a broken femur wrestling Josh Alexander on AEW Collision",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1995753/dave-meltzer-aew-creative-kota-ibushi-injury-collision/",
    "publishedAt": "2025-10-13T20:53:38+00:00",
    "category": "aew"
  },
  {
    "title": "WINC Watchlist: Jon Moxley Vs. Darby Allin",
    "summary": "Before their massive \"I Quit\" match at AEW WrestleDream 2025, WINC takes a look at every previous singles match between Jon Moxley and Darby Allin!",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1995655/winc-watchlist-jon-moxley-vs-darby-allin-aew-wrestledream/",
    "publishedAt": "2025-10-13T19:44:43+00:00",
    "category": "aew"
  },
  {
    "title": "Tony Khan visits Kota Ibushi in the hospital after surgery, leaves him a note",
    "summary": "Kota Ibushi revealed on Instagram Sunday, that Tony Khan visited him in the hospital, after undergoing successful surgery… The post Tony Khan visits Kota Ibushi in the hospital after surgery, leaves...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/aew-news/364241-tony-khan-visits-kota-ibushi-in-the-hospital-after-surgery-leaves-him-a-note/",
    "publishedAt": "2025-10-13T04:35:33+00:00",
    "category": "aew"
  },
  {
    "title": "Two New Matches Set For AEW WrestleDream, Updated Card",
    "summary": "Two new matches have been confirmed for next week’s AEW WrestleDream pay-per-view, including a huge trios team rematch. During Saturday’s episode of AEW Collision, it was confirmed that Thekla and...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584545-two-new-matches-set-for-aew-wrestledream-updated-card",
    "publishedAt": "2025-10-12T03:11:21+00:00",
    "category": "aew"
  },
  {
    "title": "Trios Title Match And More Announced For 10/15 AEW Dynamite",
    "summary": "A handful of big matches and segments have been announced for this week’s special three-hour episode of AEW Dynamite. During Saturday’s episode of AEW Collision, several major matches were confirmed....",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584538-trios-title-match-and-more-announced-for-10-15-aew-dynamite",
    "publishedAt": "2025-10-12T03:01:36+00:00",
    "category": "aew"
  },
  {
    "title": "Tony Khan Responds To Kota Ibushi’s Injury On AEW Collision",
    "summary": "Tony Khan has reacted to the recent injury to AEW star Kota Ibushi on tonight’s episode of Collision. In a recent post on X, Khan said that he was very grateful for Ibushi and believes he’s one of...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584532-tony-khan-responds-to-kota-ibushis-injury-on-aew-collision",
    "publishedAt": "2025-10-12T01:54:04+00:00",
    "category": "aew"
  },
  {
    "title": "Orange Cassidy Has High Praise For This AEW Producer",
    "summary": "Orange Cassidy is all about giving credit where it’s due. All Elite Wrestling‘s Orange Cassidy was a recent guest on Off The Ropes. When asked if he would be open to a coaching or producer role when...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584438-orange-cassidy-has-high-praise-for-this-aew-producer",
    "publishedAt": "2025-10-11T22:30:00+00:00",
    "category": "aew"
  },
  {
    "title": "AEW Collision Results: Review, Grades, Card For October 11",
    "summary": "Our AEW Collision results for tonight include Women’s World Champion Kris Statlander teaming with Toni Storm and Harley Cameron to take on the Triangle of Madness, Kota Ibushi taking on Josh...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584433-aew-collision-results-review-grades-card-for-october-11",
    "publishedAt": "2025-10-11T22:00:00+00:00",
    "category": "aew"
  }
]