[
  {
    "title": "Darby Allin Baffles Ariel Helwani After Pouring Water On His Face During Interview",
    "summary": "Darby Allin embraces the extreme. Given his track record as a daredevil, the element of surprise is now relatively rare for former AEW TNT Champion Darby Allin. Still, he managed to stun journalist...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584791-darby-allin-baffles-ariel-helwani-after-pouring-water-on-his-face-during-interview",
    "publishedAt": "2025-10-14T18:10:14+00:00",
    "category": "aew"
  },
  {
    "title": "Darby Allin: I've Been Putting Myself Through Hell Training For This I Quit Match",
    "summary": "Darby Allin says that he's putting himself through hell preparing for his I Quit match with Jon Moxley. Darby is currently scheduled to take on Jon Moxley at AEW WrestleDream this weekend in an I...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/darby-allin-ive-been-putting-myself-through-hell-training-for-this-i-quit-match",
    "publishedAt": "2025-10-14T17:31:32+00:00",
    "category": "aew"
  },
  {
    "title": "Darby Allin: I’m So Grateful I’m At The Mental Spot I’m In Right Now",
    "summary": "Darby Allin is happy where he’s at. Earlier this year, Darby Allin conquered the lofty task of climbing Mount Everest, with the planting of an AEW flag as proof. Beyond the excitement, Allin says the...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584758-darby-allin-im-so-grateful-im-at-the-mental-spot-im-in-right-now",
    "publishedAt": "2025-10-14T17:30:58+00:00",
    "category": "aew"
  },
  {
    "title": "AEW couple to open ‘Victory Roll’ board game cafe in Indiana, grand opening set for Thursday",
    "summary": "ABC57 in South Bend, Indiana is reporting that AEW’s Ruby Soho and “Cool Hand” Angelo Parker are set… The post AEW couple to open ‘Victory Roll’ board game cafe in Indiana, grand opening set for...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/364351-aew-couple-to-open-victory-roll-board-game-cafe-in-indiana-grand-opening-set-for-thursday/",
    "publishedAt": "2025-10-14T17:19:15+00:00",
    "category": "aew"
  },
  {
    "title": "Released WWE Star To Tony Khan: “Your Boy Is Ready…Call Me”",
    "summary": "His time in WWE may have come to an abrupt and unexpected end, but BJ Ray is already looking to his future, and he has his sights set on AEW. Just days after the news of his WWE release broke, the...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/released-wwe-star-tony-khan-your-boy-readycall/",
    "publishedAt": "2025-10-14T17:17:05+00:00",
    "category": "aew"
  },
  {
    "title": "Darby Allin On AEW-DC Comics Crossover: Anything That's Cross-Promoting With Different Cultures Is Always Fun",
    "summary": "Darby Allin discusses the AEW-DC Comics Crossover event. Earlier this month, AEW and DC announced that there will be an upcoming two part crossover event where the heroes of the Justice League will...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/darby-allin-on-aew-dc-comics-crossover-anything-thats-cross-promoting-with-different-cultures-is-always-fun",
    "publishedAt": "2025-10-14T16:57:18+00:00",
    "category": "aew"
  },
  {
    "title": "Orange Cassidy On What DC Comics Villain He'd Like To Fight: Probably Lex Luthor, Just Because He's Just A Smart Dude, Right?",
    "summary": "Orange Cassidy names what DC Comics villain he'd like to fight given the chance. Earlier this month, AEW and DC announced that there will be an upcoming two part crossover event where the heroes of...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/orange-cassidy-on-what-dc-comics-villain-hed-like-to-fight-probably-lex-luthor-just-because-hes-just-a-smart-dude-right",
    "publishedAt": "2025-10-14T16:29:38+00:00",
    "category": "aew"
  },
  {
    "title": "AEW Stars Opening Unique Business In Indiana",
    "summary": "Two AEW stars are set to open a unique business this week. ABC 57 profiled Ruby Soho and Angelo Parker’s new business, a wrestling and board game-themed café called Victory Roll. The couple, credited...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584768-aew-stars-opening-unique-business-in-indiana",
    "publishedAt": "2025-10-14T16:10:22+00:00",
    "category": "aew"
  },
  {
    "title": "Tony Khan visits Kota Ibushi in the hospital after surgery, leaves him a note",
    "summary": "Kota Ibushi revealed on Instagram Sunday, that Tony Khan visited him in the hospital, after undergoing successful surgery… The post Tony Khan visits Kota Ibushi in the hospital after surgery, leaves...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/aew-news/364241-tony-khan-visits-kota-ibushi-in-the-hospital-after-surgery-leaves-him-a-note/",
    "publishedAt": "2025-10-13T04:35:33+00:00",
    "category": "aew"
  }
]