[
  {
    "title": "The AEW Roster Conglomerates For Hilarious Thanksgiving Ad",
    "summary": "AEW has released a brand-new Thanksgiving ad for their upcoming Dynamite and Collision tapings. All Elite Wrestling will present the Thanksgiving Eve episode of Dynamite live from Nashville, TN, on...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1589951-aew-roster-conglomerates-thanksgiving-ad",
    "publishedAt": "2025-11-10T21:57:26+00:00",
    "category": "aew"
  },
  {
    "title": "Taya Valkyrie Seemingly Reacts To Nixon Newell and Miranda Alize Walking Out On AEW Collision",
    "summary": "The Nixon Newell and Miranda Alize controversy continues to draw more opinions. Newell and Alize reportedly walked out during the November 8 AEW Collision taping due to an alleged disagreement over...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1589938-taya-valkyrie-seemingly-reacts-to-nixon-newell-and-miranda-alize-walking-out-on-aew-collision",
    "publishedAt": "2025-11-10T20:38:20+00:00",
    "category": "aew"
  },
  {
    "title": "AEW Roster Gathers For Dinner At Bryan Danielson's In Thanksgiving Dynamite Promo",
    "summary": "Members of the AEW roster gather for Thanksgiving dinner at Bryan Danielson's house for a commercial promoting shows on Thanksgiving and Thanksgiving Eve",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2022542/aew-roster-thanksgiving-dynamite-bryan-danielson/",
    "publishedAt": "2025-11-10T19:50:51+00:00",
    "category": "aew"
  },
  {
    "title": "Nixon Newell, Miranda Alize give their side of AEW Collision situation",
    "summary": "During a livestream on her Twitch channel, Nixon Newell addressed the situation that developed over the weekend regarding… The post Nixon Newell, Miranda Alize give their side of AEW Collision...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/366622-nixon-newell-miranda-alize-give-their-side-of-aew-collision-situation/",
    "publishedAt": "2025-11-10T03:07:55+00:00",
    "category": "aew"
  }
]