[
  {
    "title": "Tony Khan: I Would Love To Get Shaq Back In The Ring",
    "summary": "Tony Khan says he would love to get Shaq in the ring. Shaq's run with AEW was very brief, consisting of one appearance for the company but would not return to the promotion, that being said, Tony...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/tony-khan-i-would-love-to-get-shaq-back-in-the-ring",
    "publishedAt": "2025-11-12T17:52:06+00:00",
    "category": "aew"
  },
  {
    "title": "Tony Khan 'Would Love' To Take AEW To France And Germany",
    "summary": "Tony Khan comments on taking AEW to new markets. Since AEW's creation in 2019, the company has dipped into several international markets outside of the United States, including the likes of Canada,...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/tony-khan-would-love-to-take-aew-to-france-and-germany",
    "publishedAt": "2025-11-12T17:31:28+00:00",
    "category": "aew"
  },
  {
    "title": "Hangman Page: Attending An AEW Show Is ‘Like Going To Cook Out For The First Time’",
    "summary": "During an interview with WXII 12 News to promote the 2025 Blood & Guts edition of AEW Dynamite, AEW World Champion “Hangman” Adam Page described the unique AEW experience. Page’s ‘Cook Out’ Analogy...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/hangman-page-attending-aew-show-like-going-cook-out-first-time/",
    "publishedAt": "2025-11-12T17:26:13+00:00",
    "category": "aew"
  },
  {
    "title": "Tony Khan: If You're In AEW It's Very Likely That You're There Because You Really Love Wrestling",
    "summary": "Tony Khan discusses talent scouting. Since AEW's inception in 2019, the company have sourced talent from all over the globe, including from Japan, Mexico, the UK and Australia. In 2025, the company...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/tony-khan-if-youre-in-aew-its-very-likely-that-youre-there-because-you-really-love-wrestling",
    "publishedAt": "2025-11-12T17:09:06+00:00",
    "category": "aew"
  },
  {
    "title": "Tony Khan Wants To Take AEW To New European Markets",
    "summary": "Tony Khan wants to expand AEW’s reach into new European markets. Speaking to Sportico’s Sebastian Milo at the ‘Invest In Sports: New York’ conference, AEW President Tony Khan shared that he’d like to...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1590313-tony-khan-wants-to-take-aew-to-new-european-markets",
    "publishedAt": "2025-11-12T16:50:28+00:00",
    "category": "aew"
  },
  {
    "title": "Willow Nightingale Explains Affinity For Hardcore Matches Ahead Of AEW Blood & Guts",
    "summary": "AEW star Willow Nightingale explains her affinity for hardcore matches as she prepares to participate in the women's Blood & Guts match on Dynamite",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2024604/aew-blood-guts-willow-nightingale-hardcore-matches/",
    "publishedAt": "2025-11-12T16:20:32+00:00",
    "category": "aew"
  },
  {
    "title": "Hangman Page Compares AEW’s Family-Friendly Environment To Going To Cook Out",
    "summary": "Hangman Page paints a great picture of what AEW offers its fans. Page spoke with WXII 12’s John Johnson ahead of Wednesday’s AEW Blood & Guts event. The AEW World Champion compared the experience of...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1590300-hangman-page-compares-aew-family-friendly-to-cook-out",
    "publishedAt": "2025-11-12T15:49:34+00:00",
    "category": "aew"
  },
  {
    "title": "AEW Star Dustin Rhodes Sends Message to Wrestlers Amid Backstage Drama",
    "summary": "Dustin Rhodes has shared a strong message following the recent backstage drama involving Nixon Newell and Miranda Alize at AEW Collision. PWInsider reported that Nixon Newell and Miranda Alize left...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1590279-dustin-rhodes-aew-backstage-drama",
    "publishedAt": "2025-11-12T15:09:09+00:00",
    "category": "aew"
  },
  {
    "title": "Tony Khan Names His Dream Celebrity Signing For AEW",
    "summary": "Tony Khan wants AEW to have another Shaq Attack. Khan recently spoke with Sportico’s Sebastian Milo at the ‘Invest In Sports: New York’ conference. Khan was asked about bringing in celebrity...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1590289-tony-khan-names-his-dream-celebrity-signing-aew",
    "publishedAt": "2025-11-12T14:36:19+00:00",
    "category": "aew"
  },
  {
    "title": "Backstage News On Adam Copeland’s AEW Status Amid Hiatus",
    "summary": "Adam Copeland won’t be back on AEW programming in the immediate future. The former Edge has been away from AEW TV since the post-All Out episode of Dynamite in September. Why Copeland Is Away On that...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/backstage-news-adam-copelands-aew-status-amid-hiatus/",
    "publishedAt": "2025-11-12T13:00:13+00:00",
    "category": "aew"
  },
  {
    "title": "Tony Khan: ‘I Would Love For” Shaquille O’Neal To Come Back To AEW",
    "summary": "Tony Khan has named the non-wrestler “dream signing” he would most like to bring to AEW. Speaking with Sportico at its Invest in Sports: New York event at NASDAQ’s headquarters in New York last week,...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/tony-khan-would-love-shaquille-oneal-come-back-aew/",
    "publishedAt": "2025-11-12T12:33:08+00:00",
    "category": "aew"
  },
  {
    "title": "AEW Dynamite: Blood & Guts, Falls Count Anywhere Match",
    "summary": "AEW arrives in Greensboro, North Carolina, tonight for the annual Blood & Guts version of Dynamite. History will be made as, for the first time, women will be climbing inside the double-ringed steel...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/aew-dynamite-blood-guts-falls-count-anywhere-match/",
    "publishedAt": "2025-11-12T12:00:54+00:00",
    "category": "aew"
  }
]