[
  {
    "title": "‘We’ll See What Happens’: Tony Khan Addresses Chris Jericho’s AEW Absence",
    "summary": "AEW President Tony Khan recently appeared on “Busted Open Radio” and was asked about the status of Chris Jericho, who has been absent from AEW television. Dave Lagreca noted Jericho’s foundational...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/well-see-what-happens-tony-khan-addresses-chris-jerichos-aew-absence/",
    "publishedAt": "2025-10-20T23:24:30+00:00",
    "category": "aew"
  },
  {
    "title": "AEW's Mercedes Mone Wins 12th Title One Day After Breaking Record At WrestleDream",
    "summary": "Mercedes Mone officially became \"12 Belts Mone\" just one day after winning her eleventh title at AEW WrestleDream.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2002660/aew-mercedes-mone-12th-title-breaking-record-wrestledream/",
    "publishedAt": "2025-10-20T23:06:40+00:00",
    "category": "aew"
  },
  {
    "title": "MVP Refutes Rumor He Has Heat With AEW Star",
    "summary": "The Hurt Syndicate’s MVP has refuted claims that he has heat with a fellow AEW star. Rumors emerged about MVP having backstage heat with AEW star “Speedball” Mike Bailey a few months ago. While both...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585586-mvp-refutes-rumor-he-has-heat-with-aew-star",
    "publishedAt": "2025-10-20T20:42:53+00:00",
    "category": "aew"
  },
  {
    "title": "Tony Khan Explains Bryan Danielson’s AEW WrestleDream Absence",
    "summary": "Tony Khan has revealed why Bryan Danielson was absent from the commentary desk at AEW WrestleDream last Saturday. Following his return to All Elite Wrestling at All In: Texas last July, Bryan...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585582-tony-khan-explains-bryan-danielsons-aew-wrestledream-absence",
    "publishedAt": "2025-10-20T19:57:33+00:00",
    "category": "aew"
  },
  {
    "title": "MVP Dismisses Rumors Of Backstage Heat With AEW Star",
    "summary": "MVP has directly refuted claims that he has backstage heat with AEW star “Speedball” Mike Bailey, insisting that there is “no issue there” between the two men. The rumors of animosity surfaced over...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/mvp-dismisses-rumors-backstage-heat-aew-star/",
    "publishedAt": "2025-10-20T18:42:08+00:00",
    "category": "aew"
  },
  {
    "title": "Former AEW coach criticizes aquarium spot in I Quit Match at WrestleDream",
    "summary": "Former AEW coach Sarah Stock took to social media, criticizing the aquarium spot done during the I Quit… The post Former AEW coach criticizes aquarium spot in I Quit Match at WrestleDream appeared...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/364933-former-aew-coach-criticizes-aquarium-spot-in-i-quit-match-at-wrestledream/",
    "publishedAt": "2025-10-19T20:01:19+00:00",
    "category": "aew"
  }
]