[
  {
    "title": "Update On The Status Of Bandido Following Apparent Injury At AEW Collision Taping",
    "summary": "Bandido has been battling a shoulder injury for a number of weeks, but has the ROH World Champion taken a spill that could put him on the shelf?",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2012231/aew-collision-bandido-apparent-injury-update/",
    "publishedAt": "2025-10-30T17:11:26+00:00",
    "category": "aew"
  },
  {
    "title": "Kyle O'Reilly Thinks Jon Moxley Makes Everyone In AEW Step Their Game Up, Feels Like Moxley Is 'Captain Of This Ship'",
    "summary": "O'Reilly heaps praise onto Moxley. The last two weeks of AEW Dynamite featured single matches between Kyle O'Reilly and Jon Moxley. On the newest episode of AEW Unrestricted, O'Reilly spoke highly of...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/kyle-oreilly-thinks-jon-moxley-makes-everyone-in-aew-step-their-game-up-feels-like-moxley-is-captain-of-this-ship",
    "publishedAt": "2025-10-30T17:08:47+00:00",
    "category": "aew"
  },
  {
    "title": "Queen Aminata: We're Very Disappointed In Our Loss To The Sisters Of Shit, It's Not Over Until We Say So",
    "summary": "Queen Aminata reflects on a big loss. On the October 29 edition of AEW Dynamite, the tournament to crown the inaugural AEW Women's Tag Team Champions kicked off with a bang, as Queen Aminata and...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/queen-aminata-were-very-disappointed-in-our-loss-to-the-sisters-of-shit-its-not-over-until-we-say-so",
    "publishedAt": "2025-10-30T16:54:38+00:00",
    "category": "aew"
  },
  {
    "title": "PHOTO: Bayley Spotted With Top AEW Champion",
    "summary": "WWE star Bayley is often praised by her peers for being one of the best people behind the scenes, and it appears this reputation extends beyond just the WWE locker room. The former Women’s Champion...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/photo-bayley-spotted-top-aew-champion/",
    "publishedAt": "2025-10-30T13:00:38+00:00",
    "category": "aew"
  },
  {
    "title": "Injury forces creative change to AEW Women’s World Tag Team Title Tournament",
    "summary": "A legitimate injury has forced a creative change to the AEW Women’s World Tag Team Title Tournament. Penelope… The post Injury forces creative change to AEW Women’s World Tag Team Title Tournament...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/aew-news/365783-injury-forces-creative-change-to-aew-womens-world-tag-team-title-tournament/",
    "publishedAt": "2025-10-30T03:00:00+00:00",
    "category": "aew"
  }
]