[
  {
    "title": "AEW Full Gear Tailgate Brawl Preview, Start Time, How To Watch",
    "summary": "Viewing information and lineup for AEW Full Gear Tailgate Brawl on November 22, 2025. AEW Full Gear Tailgate Brawl (November 22, 2025) Venue: Prudential Center City: Newark, NJ Time: 7 pm ET Channel:...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/aew-full-gear-tailgate-brawl-preview-start-time-how-to-watch",
    "publishedAt": "2025-11-22T12:00:00+00:00",
    "category": "aew"
  },
  {
    "title": "Son of WWE Hall of Famer and former AEW Champion wins first singles match",
    "summary": "Steven Borden, son of WWE Hall of Famer and former AEW World Tag Team Champion Sting won his… The post Son of WWE Hall of Famer and former AEW Champion wins first singles match appeared first on WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/aew-news/367850-son-of-wwe-hall-of-famer-and-former-aew-champion-wins-first-singles-match/",
    "publishedAt": "2025-11-22T07:41:25+00:00",
    "category": "aew"
  },
  {
    "title": "Viewership and key demo for 3-hour block of AEW TV on TBS",
    "summary": "According to Programming Insider, this past Wednesday’s AEW Dynamite on TBS came in with 491,000 viewers and a… The post Viewership and key demo for 3-hour block of AEW TV on TBS appeared first on...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/aew-news/367809-viewership-and-key-demo-for-3-hour-block-of-aew-tv-on-tbs/",
    "publishedAt": "2025-11-22T03:42:43+00:00",
    "category": "aew"
  },
  {
    "title": "Kenny Omega: The Best Case Retirement Scenario Is For People To Not Realize I'm Gone",
    "summary": "Kenny Omega has been wrestling for over two decades, and was sidelined for the entirety of 2024 after a battle with diverticulitis. Though Omega is still regularly competing on AEW TV, notable...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/kenny-omega-the-best-case-retirement-scenario-is-for-people-to-not-realize-im-gone",
    "publishedAt": "2025-11-22T03:06:17+00:00",
    "category": "aew"
  },
  {
    "title": "Kenny Omega Comments On Andrade El Idolo’s Status",
    "summary": "Kenny Omega addressed the changes to the Full Gear card, specifically the absence of Andrade El Idolo, who was “sidelined” from the event. Speaking on Shak Wrestling, Omega remained positive about...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/kenny-omega-comments-andrade-idolos-status/",
    "publishedAt": "2025-11-22T00:16:31+00:00",
    "category": "aew"
  },
  {
    "title": "The Young Bucks Comment On Chris Jericho’s Future In AEW",
    "summary": "The Young Bucks want Chris Jericho to stay in AEW. Amid all the speculations surrounding Chris Jericho’s contract status with AEW, former three-time AEW World Tag Team Champion Nick Jackson of The...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591991-the-young-bucks-comment-on-chris-jericho-future-in-aew",
    "publishedAt": "2025-11-21T19:18:56+00:00",
    "category": "aew"
  },
  {
    "title": "Tony Khan Defends Adding More Titles To AEW Championship Count",
    "summary": "Tony Khan explains why it was necessary to introduce more championships to AEW. All Elite Wrestling currently features seven active championships, including five singles championships across both the...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591984-tony-khan-defends-adding-more-titles-to-aew-championship-count",
    "publishedAt": "2025-11-21T18:57:00+00:00",
    "category": "aew"
  },
  {
    "title": "Matt Hardy Shuts Down Claim He Walked Back Remarks About WWE-TNA Partnership Hurting AEW",
    "summary": "Matt Hardy isn’t changing his tune about anything; he’s just correcting a false narrative. This week’s episode of the Extreme Life of Matt Hardy podcast saw Matt address Tony Khan’s recent interview...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591992-matt-hardy-denies-walked-back-remarks-wwe-tna-partnership-hurting-aew",
    "publishedAt": "2025-11-21T18:54:30+00:00",
    "category": "aew"
  }
]