[
  {
    "title": "Sting's Son Steven Borden To Debut At Event Featuring AEW's Darby Allin, Killer Kross",
    "summary": "Wrestling legend Sting has seemingly inspired his son to follow in his footsteps. Steven Borden has been training with his father's AEW tag partner Darby Allin.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1983105/aew-sting-son-steven-borden-wrestling-debut-darby-allin-killer-kross/",
    "publishedAt": "2025-09-30T18:05:54+00:00",
    "category": "aew"
  },
  {
    "title": "Jack Perry Teases A Darker Version Of Jurassic Express",
    "summary": "After a long absence, Jack Perry is back in AEW, and he’s ready to unleash a new, darker version of Jurassic Express. Perry made his surprise return at the All Out pay-per-view earlier this month,...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/jack-perry-teases-darker-version-jurassic-express/",
    "publishedAt": "2025-09-30T16:58:42+00:00",
    "category": "aew"
  },
  {
    "title": "AEW Star Says They Didn’t Expect To Be Absent For So Long",
    "summary": "Jack Perry is happy to be back in AEW, even if it took longer than expected. Perry spoke with Haley Miller for VICE ahead of AEW’s 6th Anniversary episode of Dynamite on Wednesday. Perry was absent...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582403-aew-star-didnt-expect-to-be-absent-for-so-long",
    "publishedAt": "2025-09-30T16:28:36+00:00",
    "category": "aew"
  },
  {
    "title": "Jack Perry Thought He Was Only Going To Be Off A Month Or Two Following AEW Full Gear 2024",
    "summary": "At AEW Full Gear 2024, Jack Perry lost the AEW TNT Championship to Daniel Garcia. He was off AEW TV until returning at All Out 2025. “I feel great to be back. Especially under these circumstances...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/jack-perry-thought-he-was-only-going-to-be-off-a-month-or-two-following-aew-full-gear-2024",
    "publishedAt": "2025-09-30T16:21:12+00:00",
    "category": "aew"
  },
  {
    "title": "Sting’s Son Making In-Ring Debut",
    "summary": "There appears to be a new “Icon” in the making. Following his appearance as Wolfpac Sting at AEW Revolution 2024, news emerged that Steven Borden Jr. was training to become a pro wrestler, with Darby...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582384-stings-son-making-in-ring-debut",
    "publishedAt": "2025-09-30T16:18:09+00:00",
    "category": "aew"
  },
  {
    "title": "AEW Sets Date For Return Of Blood & Guts On Dynamite, Same Night As Local GWAR Concert",
    "summary": "AEW's most violent stipulation is making its return this November as the company has officially announced a date for this year's Blood and Guts event.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1982796/aew-dynamite-blood-guts-greensboro-november-12-gwar/",
    "publishedAt": "2025-09-30T15:19:19+00:00",
    "category": "aew"
  },
  {
    "title": "AEW Announces Return Of Blood And Guts",
    "summary": "All Elite Wrestling has announced its return to a city rich with professional wrestling history, as the company will be coming to Greensboro, North Carolina, on Wednesday, November 12. The event,...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/aew-announces-return-blood-guts/",
    "publishedAt": "2025-09-30T14:07:16+00:00",
    "category": "aew"
  }
]