[
  {
    "title": "Raja Jackson Set To Face Two Charges For Syko Stu Attack",
    "summary": "Raja Jackson, the son of UFC legend Quinton “Rampage” Jackson, will face two charges, including a felony, for his legitimate in-ring attack on independent wrestler Syko Stu (Stuart Smith) at a KnokX...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/other/raja-jackson-set-face-two-charges-syko-stu-attack/",
    "publishedAt": "2025-10-07T17:23:46+00:00",
    "category": "aew"
  },
  {
    "title": "Gail Kim Thinks Kenny Omega's 'Gift Basket' Comment Made AEW Fans Feel It Was Okay To Come At Her",
    "summary": "Gail Kim created headlines online by sharing her opinion on Riho, saying she was uncomfortable with the camera shooting up her skirt and that Riho's size made things less believable. Kim made the...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/gail-kim-thinks-kenny-omegas-gift-basket-comment-made-aew-fans-feel-it-was-okay-to-come-at-her",
    "publishedAt": "2025-10-07T17:22:53+00:00",
    "category": "aew"
  },
  {
    "title": "Lio Rush Is 'Disgusted' With The Idea Of Other Wrestlers Pulling Off CRU's Fashion Style",
    "summary": "Lio Rush and Action Andretti want others to stay out of their lane. Since debuting as a tag team in 2024, Rush and Andretti have stood out in AEW's crowded division, often wowing fans with their...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/lio-rush-action-andretti-243803",
    "publishedAt": "2025-10-07T17:00:00+00:00",
    "category": "aew"
  },
  {
    "title": "Scarlett: “If We Ever Go To AEW, We’re Going To Be Flying The AEW Flag. That Is Going To Be Our Home Forever”",
    "summary": "Now that they are free agents, Karrion Kross and Scarlett are carefully considering their next move. Speaking on Insight with Chris Van Vliet, the duo discussed their creative priorities, their...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/scarlett-ever-aew-going-flying-aew-flag-going-our-home-forever/",
    "publishedAt": "2025-10-07T10:38:14+00:00",
    "category": "aew"
  },
  {
    "title": "AEW Dynamite Preview: Title Matches, Hangman Page-Samoa Joe Confrontation",
    "summary": "All Elite Wrestling is returning to its home base of Daily’s Place in Jacksonville, Florida, for a special “Title Tuesday” edition of AEW Dynamite, and the card is loaded with championship matches....",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/aew-dynamite-preview-title-matches-hangman-page-samoa-joe-confrontation/",
    "publishedAt": "2025-10-07T10:23:56+00:00",
    "category": "aew"
  }
]