[
  {
    "title": "Matt Jackson: AEW's Current Tag Division Is Probably The Most Elite Tag Division Since The Beginning",
    "summary": "Matt Jackson has a ton of praise for AEW's tag team division. In 2019, AEW kicked off their existence with a loaded tag team roster that included duos like the Young Bucks, Best Friends, Santana &...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/matt-jackson-aew-tag-team-division-262411",
    "publishedAt": "2025-10-17T17:09:49+00:00",
    "category": "aew"
  },
  {
    "title": "Jamie Hayter Brings Her Own Personal Flair To AEW, Talks ‘Blood & Guts’",
    "summary": "Jamie Hayter is excited and curious about what’s in store at WrestleDream. Hayter spoke with WrestleZone Managing Editor Bill Pritchard ahead of her match with Thekla at AEW WrestleDream. The “Toxic...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585299-jamie-hayter-own-personal-flair-to-aew-talks-blood-guts",
    "publishedAt": "2025-10-17T16:44:32+00:00",
    "category": "aew"
  },
  {
    "title": "Nick Jackson: We Joke With The Locker Room Like, 'If You Don't Know How To Wrestle In 2025 On Dynamite, You're Screwed'",
    "summary": "The Young Bucks want the best of the best in AEW. Most fans believe that AEW has tightened things up from an in-ring perspective in 2025, leading to a ton of great matches and moments on television....",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/nick-jackson-262405",
    "publishedAt": "2025-10-17T16:43:09+00:00",
    "category": "aew"
  },
  {
    "title": "AEW's Dax Harwood Has Interesting Response To Question Of Whether FTR Are Still Great",
    "summary": "Going from good guys to bad, it appears some fans argue the relevancy/legacy of AEW's FTR in tag team wrestling. Dax Harwood had this to say about the matter.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1999610/aew-dax-harwood-interesting-response-question-ftr-still-great-tag-team-wembley-2023/",
    "publishedAt": "2025-10-17T16:28:01+00:00",
    "category": "aew"
  },
  {
    "title": "Jamie Hayter Respects Thekla But Plans To Kick Her Ass At AEW WrestleDream",
    "summary": "Jamie Hayter is ready to kick Thekla's ass at AEW WrestleDream. However, she admits that she does have a great deal of respect for her. Thekla made her debut in AEW by attacking Jamie Hayter. This...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/jamie-hayter-respects-thekla-but-plans-to-kick-her-ass-at-aew-wrestledream",
    "publishedAt": "2025-10-17T16:00:00+00:00",
    "category": "aew"
  },
  {
    "title": "AEW's Tony Khan Comments On Potentially Running Blood & Guts Matches For Both Genders",
    "summary": "AEW President Tony Khan addresses the possibility of hosting two Blood and Guts matches, one for both genders, this year.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1999527/aew-tony-khan-blood-guts-matches-both-genders/",
    "publishedAt": "2025-10-17T15:29:48+00:00",
    "category": "aew"
  },
  {
    "title": "Tony Khan Talks Kota Ibushi's Injury, Confirms It Changed Plans For AEW WrestleDream",
    "summary": "AEW CEO Tony Khan has discussed Kota Ibushi's devastating injury and revealed that the Japanese star was in his plans for the WrestleDream pay-per-view.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1999320/tony-khan-kota-ibushi-injury-changed-plans-aew-wrestledream/",
    "publishedAt": "2025-10-17T14:30:00+00:00",
    "category": "aew"
  },
  {
    "title": "Mercedes Mone Sets New Record In AEW",
    "summary": "Mercedes Mone has achieved another major milestone in her career, becoming the longest-reigning AEW TBS Champion in the title’s history. She has officially surpassed the inaugural champion Jade...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/mercedes-mone-sets-new-record-aew/",
    "publishedAt": "2025-10-17T10:49:48+00:00",
    "category": "aew"
  },
  {
    "title": "Tony Khan addresses reports of a potential AEW training facility",
    "summary": "During a media call ahead of AEW WrestleDream, the topic of a training facility associated with the company… The post Tony Khan addresses reports of a potential AEW training facility appeared first...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/aew-news/364643-tony-khan-addresses-reports-of-a-potential-aew-training-facility/",
    "publishedAt": "2025-10-17T01:38:38+00:00",
    "category": "aew"
  }
]