[
  {
    "title": "Tony Khan Talks Keeping AEW Prices 'Family Friendly' As WWE Ticket Costs Rise",
    "summary": "Tony Khan promises that AEW ticket prices will remain affordable as WWE continues to increase the cost for their events.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1984131/tony-khan-aew-prices-family-friendly-wwe-ticket-costs-rise/",
    "publishedAt": "2025-10-06T03:59:00+00:00",
    "category": "aew"
  },
  {
    "title": "Brian Cage: Don Callis Never Planned For His AEW Family To Grow So Much",
    "summary": "Brian Cage comments on the rapid growth of the Don Callis Family. Before Brian Cage was injured and underwent knee surgeries, he was on AEW TV as a member of the Don Callis Family. Since then, the...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/brian-cage-don-callis-never-planned-for-his-aew-family-to-grow-so-much",
    "publishedAt": "2025-10-06T03:09:56+00:00",
    "category": "aew"
  },
  {
    "title": "Brian Cage Continues To Keep AEW Return A Mystery After Knee Surgeries",
    "summary": "Brian Cage says there are no plans set in stone for his return to AEW. In April, Cage had surgery on his injured knee, confirming he’ll be out of action for the foreseeable future. Then, in June,...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/brian-cage-continues-to-keep-aew-return-a-mystery-after-knee-surgeries",
    "publishedAt": "2025-10-06T02:51:06+00:00",
    "category": "aew"
  },
  {
    "title": "Bandido Injury Update Regarding His Match At AEW Dynamite: Title Tuesday",
    "summary": "All Elite Wrestling and Ring of Honor Champion Bandido is scheduled to compete in a match this coming week, following a shoulder injury he sustained at a recent event. The injury occurred during a...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/bandido-injury-update-regarding-his-match-aew-dynamite-title-tuesday/",
    "publishedAt": "2025-10-05T22:55:21+00:00",
    "category": "aew"
  },
  {
    "title": "Injury Update On AEW And ROH Star Nick Wayne",
    "summary": "ROH World TV Champion Nick Wayne underwent a medical evaluation on his broken foot during Saturday's episode of \"AEW Collision.\"",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1987347/injury-update-aew-roh-star-nick-wayne/",
    "publishedAt": "2025-10-05T20:48:15+00:00",
    "category": "aew"
  },
  {
    "title": "AEW Star Quietly Gets Name Change During Recent Absence",
    "summary": "A current AEW star has quietly undergone a name change. On All Elite Wrestling’s official roster page, fans were quick to notice that Adam Copeland no longer goes by “Cope.” The star is now referred...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1583276-aew-star-quietly-gets-name-change-during-recent-absence",
    "publishedAt": "2025-10-05T20:00:00+00:00",
    "category": "aew"
  },
  {
    "title": "Multiple New Matches Set For AEW Dynamite: Title Tuesday",
    "summary": "Several big matches have been added to next week’s episode of AEW Dynamite, the show’s special “Title Tuesday” edition of the show. During Saturday’s episode of AEW Collision, it was announced that...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1583285-multiple-new-matches-set-for-aew-dynamite-title-tuesday",
    "publishedAt": "2025-10-05T01:15:21+00:00",
    "category": "aew"
  },
  {
    "title": "Several Big Matches Announced For AEW Collision: Homecoming",
    "summary": "A handful of big matches have been announced for next week’s episode of AEW Collision. During this week’s episode of the show, The former Acclaimed came one step closer to coming together again....",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1583306-several-big-matches-announced-for-aew-collision-homecoming",
    "publishedAt": "2025-10-05T01:06:39+00:00",
    "category": "aew"
  }
]