[
  {
    "title": "Darby Allin Attacks Jon Moxley At New York Comic Con",
    "summary": "Darby Allin and Jon Moxley continued their feud in an unexpected place this week. During a recent panel for All Elite Wrestling at New York Comic Con, Moxley appeared. After the panel, Moxley was...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584396-darby-allin-attacks-jon-moxley-at-new-york-comic-con",
    "publishedAt": "2025-10-11T00:57:35+00:00",
    "category": "aew"
  },
  {
    "title": "AEW TBS Champion Mercedes Mone Wins Yet Another International Title In Denmark",
    "summary": "\"The CEO\" AEW TBS Champion Mercedes Mone is officially \"10 Belts Mone\" after another international title win, this time in Denmark.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1993308/aew-tbs-champion-mercedes-mone-wins-bodyslam-womens-title-denmark/",
    "publishedAt": "2025-10-11T00:52:28+00:00",
    "category": "aew"
  },
  {
    "title": "Orange Cassidy: If You Watched A Really Awesome Match Recently In AEW, With Some Main Events, Chuck Taylor Was Producing & Coaching That",
    "summary": "Orange Cassidy gives Chuck Taylor his credit. Joining Jonathan Coachman and Thunder Rosa for the latest recording of Off The Ropes was Orange Cassidy. As the conversation moved along, the two-time...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/orange-cassidy-if-you-watched-a-really-awesome-match-recently-in-aew-with-some-main-events-chuck-taylor-was-producing-coaching-that",
    "publishedAt": "2025-10-11T00:24:46+00:00",
    "category": "aew"
  },
  {
    "title": "AEW’s Darby Allin Jumps Jon Moxley At NY Comic Con",
    "summary": "The intense rivalry between Darby Allin and Jon Moxley erupted into violence at New York Comic Con, just a week before their scheduled “I Quit” match at AEW WrestleDream. During an AEW panel at the...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/aews-darby-allin-jumps-jon-moxley-comic-con/",
    "publishedAt": "2025-10-10T23:14:15+00:00",
    "category": "aew"
  }
]