[
  {
    "title": "Tony Khan Provides An Update On The Status Of AEW Shockwave",
    "summary": "Tony Khan has opened up about the AEW Shockwave trademark and if he intends to move forward with the name. All Elite Wrestling President Tony Khan was a recent guest on The Ariel Helwani Show. When...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591421-tony-khan-provides-an-update-on-the-status-of-aew-shockwave",
    "publishedAt": "2025-11-19T00:56:36+00:00",
    "category": "aew"
  },
  {
    "title": "Tony Khan Feels Only Time Darby Allin Went Too Far Was Diving Through Glass At AEW Revolution 2024",
    "summary": "The one time Khan thought Darby took it too far. An extensive interview with AEW President Tony Khan was conducted by Ariel Helwani, and during the chat, a conversation was struck up about Darby...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/tony-khan-feels-only-time-darby-allin-went-too-far-was-diving-through-glass-at-aew-revolution-2024",
    "publishedAt": "2025-11-19T00:44:34+00:00",
    "category": "aew"
  },
  {
    "title": "Tony Khan addresses AEW “maintaining great prices”",
    "summary": "In an interview with Ariel Helwani, Tony Khan talked about AEW’s pay-per-view model and ticket prices. With the… The post Tony Khan addresses AEW “maintaining great prices” appeared first on WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/367434-tony-khan-addresses-aew-maintaining-great-prices/",
    "publishedAt": "2025-11-19T00:40:46+00:00",
    "category": "aew"
  },
  {
    "title": "Tony Khan Reveals If WWE Contacted Him To Use Adam Copeland For John Cena’s Farewell Tour",
    "summary": "Did WWE reach out to Tony Khan and AEW to use Adam Copeland during John Cena’s farewell tour? All Elite Wrestling President Tony Khan was a recent guest on The Ariel Helwani Show. When asked if WWE...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591428-tony-khan-reveals-if-wwe-contacted-him-to-use-adam-copeland-for-john-cena-farewell-tour",
    "publishedAt": "2025-11-19T00:38:59+00:00",
    "category": "aew"
  },
  {
    "title": "Kyle Fletcher Believes He’s Doing Better Than Cody Rhodes",
    "summary": "Kyle Fletcher has had a very impressive year in AEW, but does it top what Cody Rhodes did during his time with the company? AEW TNT Champion Kyle Fletcher was a recent guest on TMZ’s Inside The Ring....",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591442-kyle-fletcher-believes-hes-doing-better-than-cody-rhodes",
    "publishedAt": "2025-11-19T00:34:19+00:00",
    "category": "aew"
  },
  {
    "title": "Tony Khan Gets Candid About WWE's Counterprogramming Of AEW, TNA Partnership",
    "summary": "AEW President Tony Khan got candid with Ariel Helwani about WWE's counterprogramming efforts, as well as its partnership with TNA.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2030589/tony-khan-candid-wwe-aew-tna-counterprogramming/",
    "publishedAt": "2025-11-19T00:22:37+00:00",
    "category": "aew"
  },
  {
    "title": "Tony Khan Comments On Potentially Bringing Killer Kross To AEW",
    "summary": "Has Tony Khan spoken with Killer Kross about coming to AEW since he departed WWE several months ago? All Elite Wrestling President Tony Khan was a recent guest on The Ariel Helwani Show. When asked...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591431-tony-khan-comments-on-potentially-bringing-killer-kross-to-aew",
    "publishedAt": "2025-11-19T00:17:32+00:00",
    "category": "aew"
  },
  {
    "title": "Bobby Lashley vs. Ricochet, Mike Bailey vs. Shelton Benjamin Set For 11/19 AEW Dynamite",
    "summary": "Bobby Lashley and Ricochet will clash on the November 19th episode of AEW Dynamite. The winner will be the first man to enter the casino gauntlet for the AEW National Title at AEW Full Gear. Plus,...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/bobby-lashley-vs-ricochet-set-for-11-19-aew-dynamite",
    "publishedAt": "2025-11-19T00:16:13+00:00",
    "category": "aew"
  },
  {
    "title": "Tony Khan Hoping Will Ospreay's AEW Return Will Happen In First Half Of 2026",
    "summary": "A potential timetable for Ospreay's return. A Lights Out Steel Cage match headlined the 2025 installment of AEW x NJPW Forbidden Door in late August. That bout was the last time Will Ospreay wrestled...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/tony-khan-hoping-will-ospreays-aew-return-will-happen-in-first-half-of-2026",
    "publishedAt": "2025-11-18T23:45:53+00:00",
    "category": "aew"
  },
  {
    "title": "Tony Khan Speaks About Andrade: \"Anytime He's Free & Whenever That Is, He Is Absolutely Always Welcome In AEW\"",
    "summary": "Andrade has not been on AEW programming for one month. After departing WWE, Andrade made his way back to All Elite Wrestling. He showed up at the sixth anniversary of Dynamite and ambushed Kenny...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/tony-khan-speaks-about-andrade-anytime-hes-free-whenever-that-is-he-is-absolutely-always-welcome-in-aew",
    "publishedAt": "2025-11-18T23:36:11+00:00",
    "category": "aew"
  },
  {
    "title": "Tony Khan Confirms That He Expects MJF To Return To AEW Soon",
    "summary": "Khan states that he's hopeful MJF will be back soon. Sean Ross Sapp of Fightful Select pushed out a report that MJF is expected to return to All Elite Wrestling 'sooner than later.' A question about...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/tony-khan-confirms-that-he-expects-mjf-to-return-to-aew-soon",
    "publishedAt": "2025-11-18T23:26:34+00:00",
    "category": "aew"
  },
  {
    "title": "AEW's Tony Khan On Cope In Cena Tournament: 'WWE Never Asked'",
    "summary": "AEW's Tony Khan throws cold water on Adam Copeland being in John Cena's retirement tournament, revealing that WWE never even asked AEW about it",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2030536/tony-khan-aew-cope-cena-wwe-never-asked/",
    "publishedAt": "2025-11-18T23:19:57+00:00",
    "category": "aew"
  },
  {
    "title": "Tony Khan Says He Wants To Keep AEW Ticket Prices Affordable",
    "summary": "There has been much discussion over WWE ticket prices as they have gone up over the years with fans complaining that they are no longer affordable, especially for larger families. Appearing on the...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/tony-khan-says-he-wants-to-keep-aew-ticket-prices-affordable",
    "publishedAt": "2025-11-18T22:55:56+00:00",
    "category": "aew"
  },
  {
    "title": "Tony Khan Provides Unfortunate Update On Adam Cole’s AEW Status",
    "summary": "Tony Khan‘s update on Adam Cole‘s AEW status doesn’t sound very promising. All Elite Wrestling President Tony Khan was a recent guest on The Ariel Helwani Show. When asked for a status update on Adam...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591415-tony-khan-provides-unfortunate-update-on-adam-cole-aew-status",
    "publishedAt": "2025-11-18T21:55:52+00:00",
    "category": "aew"
  },
  {
    "title": "Tony Khan: I Do Think WWE Counterprograms AEW On Purpose",
    "summary": "Tony Khan believes WWE‘s counter-programming efforts against AEW are very much intentional. All Elite Wrestling President Tony Khan was a recent guest on The Ariel Helwani Show. When asked about...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591399-tony-khan-i-do-think-wwe-counterprograms-aew-on-purpose",
    "publishedAt": "2025-11-18T21:26:46+00:00",
    "category": "aew"
  }
]