[
  {
    "title": "WWE NXT Preview, Start Time, How To Watch (10/28): TNA Knockouts Title Bout",
    "summary": "Viewership information and lineup for the October 28, 2025 episode of WWE NXT. WWE NXT (October 28, 2025) Venue: WWE Performance Center City: Orlando, FL Time: 8pm ET How To Watch: CW Network (US),...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/wwe-nxt-preview-start-time-how-to-watch-10-28-tna-knockouts-title-bout",
    "publishedAt": "2025-10-28T12:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Omos Pitches Interesting Character Idea Amid WWE TV Hiatus",
    "summary": "WWE Superstar Omos has pitched a new direction for his character and has already set his sights on a major WrestleMania rematch. The seven-foot-plus giant has been largely absent from WWE’s main...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/omos-pitches-interesting-character-idea-amid-wwe-hiatus/",
    "publishedAt": "2025-10-28T11:30:12+00:00",
    "category": "wwe"
  },
  {
    "title": "Mickie James Explains Why Vince McMahon Changed Her Ring Name Ahead Of WWE Debut",
    "summary": "Mickie James is one of the few wrestlers who managed to compete under her real name for much of her WWE career, a fact she is very grateful for. During her interview on Insight With Chris Van Vliet,...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/mickie-james-explains-why-vince-mcmahon-changed-her-ring-name-ahead-wwe-debut/",
    "publishedAt": "2025-10-28T11:18:23+00:00",
    "category": "wwe"
  },
  {
    "title": "Ortiz Confirms “Some Of Those Hits Were Potatoes” In Match With Santana",
    "summary": "The feud between former partners Ortiz and Santana was marked by a particularly brutal match on AEW Rampage. Speaking on the Wombreezy podcast, Ortiz confirmed that the tension and physicality in the...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/ortiz-confirms-some-those-hits-potatoes-match-santana/",
    "publishedAt": "2025-10-28T11:00:43+00:00",
    "category": "aew"
  },
  {
    "title": "IYO SKY Recalls Mayu Iwatani Wanting To Quit Wrestling, Set Her Sights On Becoming A Dog Groomer",
    "summary": "SKY shares a story about Iwatani. There's an interview on HypeTalkTV's YouTube channel with IYO SKY. The interview was recorded after SKY defeated Mayu Iwatani in the main event of Dream Star...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/iyo-sky-recalls-mayu-iwatani-wanting-to-quit-wrestling-set-her-sights-on-becoming-a-dog-groomer",
    "publishedAt": "2025-10-28T11:00:00+00:00",
    "category": "general"
  },
  {
    "title": "Rikishi: ‘Grateful To Be Alive’ After Unexpected Surgery",
    "summary": "WWE Hall of Famer Rikishi has shared a positive update after undergoing unexpected surgery recently. The former Intercontinental and Tag Team Champion shared his gratitude on social media. Posting a...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/rikishi-grateful-alive-after-unexpected-surgery/",
    "publishedAt": "2025-10-28T10:49:43+00:00",
    "category": "wwe"
  },
  {
    "title": "AJ Lee And Saraya Hint Their WWE Feud Isn’t Finished",
    "summary": "A social media exchange has sparked renewed interest in the classic rivalry between former WWE Divas Champions AJ Lee and Saraya. The interaction suggests the door might still be open for another...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/lee-saraya-hint-their-wwe-feud-isnt-finished/",
    "publishedAt": "2025-10-28T10:41:43+00:00",
    "category": "wwe"
  },
  {
    "title": "Former TNA World Champion’s Contract Is Reportedly Expiring Soon",
    "summary": "An update has surfaced regarding the contract status of the current TNA International Champion, Steve Maclin. As previously reported by Fightful Select, Maclin’s TNA contract is indeed set to expire...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/tna-news/former-tna-world-champions-contract-reportedly-expiring-soon/",
    "publishedAt": "2025-10-28T10:34:49+00:00",
    "category": "tna"
  },
  {
    "title": "REPORT: WWE Concerned Bron Breakker & Bronson Reed Would Get Babyface Reactions",
    "summary": "There was reportedly internal concern within WWE about how fans might react to Bron Breakker and Bronson Reed following their attack on Seth Rollins two weeks ago on Raw. According to a tweet citing...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/report-wwe-concerned-bron-breakker-bronson-reed-would-get-babyface-reactions/",
    "publishedAt": "2025-10-28T10:25:23+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE RAW 10/27/2025: 3 Things We Hated And 3 Things We Loved",
    "summary": "On a night that saw Charlexa defend their women's tag titles, here are three things we hated and three things we loved about the 10/27/25 episode of \"WWE Raw!\"",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2009436/wwe-raw-october-27-2025-3-things-we-hated-3-things-we-loved/",
    "publishedAt": "2025-10-28T04:18:50+00:00",
    "category": "wwe"
  },
  {
    "title": "10/27 WWE Raw Highlights: Final Show Before SNME",
    "summary": "WWE has posted highlights from Monday’s (10/27) episode of Raw, which aired live on Netflix from the Honda… The post 10/27 WWE Raw Highlights: Final Show Before SNME appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/365619-10-27-wwe-raw-highlights-final-show-before-snme/",
    "publishedAt": "2025-10-28T03:48:34+00:00",
    "category": "wwe"
  },
  {
    "title": "Report: TNA Champion’s contract set to expire at the end of 2025",
    "summary": "According to Fightful Select a source, has indicated that Steve Maclin’s current contract with TNA Wrestling is set… The post Report: TNA Champion’s contract set to expire at the end of 2025 appeared...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/impact-wrestling-news/365616-report-tna-champions-contract-set-to-expire-at-the-end-of-2025/",
    "publishedAt": "2025-10-28T03:45:03+00:00",
    "category": "tna"
  },
  {
    "title": "Ortiz reveals length of time left on his AEW contract, has been working in a backstage roll",
    "summary": "During his appearance on the Wombreezy Wrestling Podcast, AEW’s Ortiz revealed he has about one year left on… The post Ortiz reveals length of time left on his AEW contract, has been working in a...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/aew-news/365610-ortiz-reveals-length-of-time-left-on-his-aew-contract-has-been-working-in-a-backstage-roll/",
    "publishedAt": "2025-10-28T03:36:11+00:00",
    "category": "aew"
  },
  {
    "title": "New Title Match added to WWE Saturday Night’s Main Event",
    "summary": "Dominik Mysterio defending the Intercontinental Championship has been added to WWE Saturday Night’s Main Event. Mysterio will defend… The post New Title Match added to WWE Saturday Night’s Main Event...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/365607-new-title-match-added-to-wwe-saturday-nights-main-event/",
    "publishedAt": "2025-10-28T03:22:03+00:00",
    "category": "general"
  },
  {
    "title": "Title Match set for next Monday’s WWE Raw",
    "summary": "Next Monday’s episode of WWE Raw is set to feature World Tag Team Champions AJ Styles and Dragon… The post Title Match set for next Monday’s WWE Raw appeared first on WWE News, WWE Results, AEW News,...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/365602-title-match-set-for-next-mondays-wwe-raw/",
    "publishedAt": "2025-10-28T03:08:13+00:00",
    "category": "wwe"
  },
  {
    "title": "Another Title Match Added To WWE Saturday Night’s Main Event, Updated Card",
    "summary": "WWE Saturday Night’s Main Event has added yet another big title match. The WWE Intercontinental Championship is up for grabs at the show this weekend. During Monday’s episode of WWE RAW, Penta and...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586783-another-title-match-added-to-wwe-saturday-nights-main-event-updated-card",
    "publishedAt": "2025-10-28T03:03:38+00:00",
    "category": "wwe"
  },
  {
    "title": "Nikki Bella Teaming With Stephanie Vaquer After Clean Pin By Roxanne Perez On WWE Raw",
    "summary": "Nikki Bella and Stephanie Vaquer have helped each other out with Roxanne Perez and Raquel Rodriguez.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2009418/wwe-raw-nikki-bella-stephanie-vaquer-clean-pin-roxanne-perez/",
    "publishedAt": "2025-10-28T02:57:48+00:00",
    "category": "wwe"
  },
  {
    "title": "Charlotte Flair & Alexa Bliss Retain WWE Women's Tag Titles In Raw Main Event",
    "summary": "Charlotte Flair and Alexa Bliss defended their WWE Women's Tag Team Championship in the main event of \"WWE Raw.\"",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2009417/wwe-raw-charlotte-flair-alexa-bliss-womens-tag-titles-main-event/",
    "publishedAt": "2025-10-28T02:56:40+00:00",
    "category": "wwe"
  },
  {
    "title": "Charlotte Flair And Alexa Bliss Successfully Defend Women's Tag Team Titles On WWE Raw",
    "summary": "Charlotte Flair and Alexa Bliss hold onto the gold. The October 27 edition of WWE Raw was headlined by a huge match for the Women's Tag Team Championships, as Charlotte Flair and Alexa Bliss defended...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/charlotte-flair-alexa-bliss-264870",
    "publishedAt": "2025-10-28T02:43:22+00:00",
    "category": "wwe"
  },
  {
    "title": "Poker Chip 2026 Teaser Airs On WWE Raw",
    "summary": "WWE has been airing a series of teasers since Sunday morning with people walking, sitting, and pouring drinks. On Monday's WWE Raw, the latest teaser aired with a poker chip hitting the table. The...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/poker-chip-2026-teaser-airs-on-wwe-raw",
    "publishedAt": "2025-10-28T02:37:42+00:00",
    "category": "wwe"
  },
  {
    "title": "Maxxine Dupri Earns WWE Women's IC Title Match Against Becky Lynch",
    "summary": "Maxxine Dupri will challenge Becky Lynch for the WWE Women's Intercontinental Championship....at some point. Dupri met with WWE Raw general manager Adam Pearce on Monday's Raw with Pearce saying that...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/maxxine-dupri-earns-wwe-womens-ic-title-match-against-becky-lynch",
    "publishedAt": "2025-10-28T02:29:19+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE World Tag Team Title Match, Nikki Bella And Stephanie Vaquer Tag Bout Set For 11/3 WWE Raw",
    "summary": "Here's what's on tap for the November 3 episode of WWE Raw. First, just weeks after switching hands, the WWE World Tag Team Championships will be up for grabs, as AJ Styles and Dragon Lee will defend...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/wwe-raw-november-264864",
    "publishedAt": "2025-10-28T02:20:10+00:00",
    "category": "wwe"
  },
  {
    "title": "Another TNA Champion’s Contract Set To Expire — Report",
    "summary": "A TNA champion’s contract is set to expire toward the end of the year, according to a new report. According to a new report from Sean Ross Sapp of Fightful Select, TNA International Champion Steve...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586754-another-tna-champions-contract-set-to-expire-report",
    "publishedAt": "2025-10-28T02:19:27+00:00",
    "category": "tna"
  },
  {
    "title": "Dominik Mysterio To Defend WWE Men's Intercontinental Title In Triple Threat At SNME",
    "summary": "It is official: \"Dirty\" Dominik Mysterio will put his Intercontinental Championship up for grabs in a Triple Threat at \"Saturday Night's Main Event.\"",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2009404/dominik-mysterio-wwe-mens-intercontinental-title-triple-threat-snme-rusev-penta/",
    "publishedAt": "2025-10-28T02:04:18+00:00",
    "category": "general"
  },
  {
    "title": "Triple Threat Match For WWE Intercontinental Title Set For Saturday Night Main Event",
    "summary": "The WWE Intercontinental Championship picture was thrown into chaos on Monday Night Raw. A #1 contender’s match between Rusev and Penta to determine the next challenger for Dominik ended in disaster,...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/triple-threat-match-wwe-intercontinental-title-match-set-saturday-night-main-event/",
    "publishedAt": "2025-10-28T01:58:55+00:00",
    "category": "wwe"
  },
  {
    "title": "AJ Lee And Saraya Reflect On Iconic WWE Moment",
    "summary": "The rivalry between AJ Lee and Saraya will never be over. October 26, 2025, marked the 11-year anniversary of the final AJ Lee vs. Paige match in WWE. The two stars clashed for the Divas Championship...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586710-aj-lee-and-saraya-reflect-on-iconic-wwe-moment",
    "publishedAt": "2025-10-28T01:48:58+00:00",
    "category": "general"
  },
  {
    "title": "Dominik Mysterio To Defend Intercontinental Championship Against Penta And Rusev At WWE Saturday Night's Main Event",
    "summary": "Dominik Mysterio might be in trouble at Saturday Night's Main Event. On the October 27 edition of WWE Raw, Penta and Rusev faced each other to decide the number one contender to Dominik Mysterio's...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/dominik-mysterio-to-defend-intercontinental-championship-against-penta-and-rusev-at-wwe-saturday-nights-main-event",
    "publishedAt": "2025-10-28T01:46:05+00:00",
    "category": "wwe"
  },
  {
    "title": "Former WWE Star Claims They Quit The Company Due To Bullying",
    "summary": "A former WWE star has claimed that she had to quit the company because she felt bullied. Krissy Vaine, who was part of WWE between 2006 and 2007, recently appeared on the Wrestling with Heart...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586697-former-wwe-star-claims-they-quit-the-company-due-to-bullying",
    "publishedAt": "2025-10-28T01:28:18+00:00",
    "category": "wwe"
  },
  {
    "title": "Shawn Michaels reveals NXT Deadline poster",
    "summary": "Following WWE’s official announcement that NXT Deadline would return, Shawn Michaels revealed the poster for the event on… The post Shawn Michaels reveals NXT Deadline poster appeared first on WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/365579-shawn-michaels-reveals-nxt-deadline-poster/",
    "publishedAt": "2025-10-28T01:20:41+00:00",
    "category": "wwe"
  },
  {
    "title": "Ortiz Confirms His AEW Contract Status",
    "summary": "AEW star Ortiz hasn’t been seen much at all over the past year, but recently gave fans an update on his status. Speaking to Wombreezy (via Fightful) in a recent interview, Ortiz was asked about his...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586729-ortiz-confirms-his-aew-contract-status",
    "publishedAt": "2025-10-28T01:20:29+00:00",
    "category": "aew"
  },
  {
    "title": "WWE IC Title No. 1 Contender's Match Ends In Controversy When Los Americanos Interfere",
    "summary": "Los Americanos interfered during the number one contender's match for the Intercontinental Championship on \"WWE Raw,\" making sure neither competitor moved on.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2009384/wwe-ic-title-contenders-controversy-los-americanos-dominik-mysterio-penta-rusev/",
    "publishedAt": "2025-10-28T01:10:47+00:00",
    "category": "wwe"
  },
  {
    "title": "Report: Details on AEW events coming to HBO Max",
    "summary": "Following a media statement from Warner Bros. Discovery on the addition of new content coming to HBO Max,… The post Report: Details on AEW events coming to HBO Max appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/aew-news/365573-report-details-on-aew-events-coming-to-hbo-max/",
    "publishedAt": "2025-10-28T01:07:11+00:00",
    "category": "wwe"
  },
  {
    "title": "CM Punk Reveals Aesthetic Change He Made During First WWE Run That Upset Vince McMahon",
    "summary": "Vince McMahon liked things done a certain way, which is why he was outraged when CM Punk wanted to make a change to his look in WWE.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2007260/cm-punk-reveals-aesthetic-change-first-wwe-run-upset-vince-mcmahon-hair-color/",
    "publishedAt": "2025-10-28T01:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Chris Bey Emotionally Reflects On One-Year Anniversary Of Serious Neck Injury",
    "summary": "Chris Bey looks back on the neck injury that nearly left him paralyzed for life. It’s been a year since TNA star Chris Bey suffered a career-altering neck injury. Bey broke his neck during the...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586698-chris-bey-emotionally-reflects-on-one-year-anniversary-of-serious-neck-injury",
    "publishedAt": "2025-10-28T00:57:28+00:00",
    "category": "tna"
  },
  {
    "title": "WWE Intercontinental Championship Contender Match Ends In No Contest After Los Americanos Interference",
    "summary": "The fate of the Intercontinental Championship is up in the air. Following the opening segment between CM Punk and Jey Uso, the October 27 edition of WWE Raw featured a match between Penta and Rusev....",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/intercontinental-championship-wwe-raw-264831",
    "publishedAt": "2025-10-28T00:50:50+00:00",
    "category": "wwe"
  },
  {
    "title": "Steve Maclin's TNA Contract 'Up In The Coming Months'",
    "summary": "An update on Maclin's deal. There's a note about Steve Maclin's contract status with TNA Wrestling on the Fightful Select service. Fightful's own Sean Ross Sapp pushed out the report that Maclin's...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/steve-maclins-tna-contract-up-in-the-coming-months",
    "publishedAt": "2025-10-28T00:36:54+00:00",
    "category": "tna"
  },
  {
    "title": "Former WWE Superstar Refutes Claim That Brock Lesnar Didn’t Want To Work With Him",
    "summary": "A former WWE Superstar has refuted the rumors that Brock Lesnar once refused to work with him. Speaking on Inside The Ropes, former WWE Champion Jinder Mahal addressed the rumors about Brock Lesnar...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586692-former-wwe-superstar-refutes-claim-that-brock-lesnar-didnt-want-to-work-with-him",
    "publishedAt": "2025-10-28T00:35:26+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW Reveals New Slogan In Office-Style Promo",
    "summary": "AEW is where wrestlers work. All Elite Wrestling burst onto the scene in 2019 and has since made several notable changes to its product and roster, which now includes stars like Bobby Lashley, Will...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586690-aew-reveals-new-slogan-in-office-style-promo",
    "publishedAt": "2025-10-28T00:26:16+00:00",
    "category": "aew"
  },
  {
    "title": "WWE Hall Of Famer Believes It’s Time For Jimmy Uso To Stand On His Own",
    "summary": "A WWE Hall of Famer believes it’s time for Jimmy Uso to carve his own path or risk being replaced by other family members. Jimmy Uso may be thriving in singles competition, but he has not been pushed...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586678-wwe-hall-of-famer-believes-its-time-for-jimmy-uso-to-stand-on-his-own",
    "publishedAt": "2025-10-28T00:08:02+00:00",
    "category": "wwe"
  },
  {
    "title": "TNA Star Believes Mercedes Moné Should Vacate Most Of Her Titles For Heat",
    "summary": "This TNA star believes Mercedes Moné should relinquish most of her championships just to be hated more. Speaking on Busted Open, TNA Wrestling’s Tommy Dreamer stated that Mercedes Moné should defeat...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586676-mercedes-mone-should-vacate-most-of-her-titles-for-heat-says-tommy-dreamer",
    "publishedAt": "2025-10-27T23:59:29+00:00",
    "category": "general"
  },
  {
    "title": "WWE’s latest teaser video raises new speculation",
    "summary": "WWE has kept quite busy on social media over the past couple days, releasing a series of teaser… The post WWE’s latest teaser video raises new speculation appeared first on WWE News, WWE Results, AEW...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/365554-wwes-latest-teaser-video-raises-new-speculation/",
    "publishedAt": "2025-10-27T23:03:08+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Monday Night Raw: Live Coverage",
    "summary": "WWE Monday Night Raw October 27, 2025 Honda Center Anaheim, CA We are live with ongoing coverage of WWE Monday Night Raw. As always, we will post updates immediately after every match so refresh this...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-monday-night-raw-live-coverage/",
    "publishedAt": "2025-10-27T23:00:04+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Raw Results 10/27 - Intercontinental Championship #1 Contenders Match, Roxanne Perez Faces Nikki Bella",
    "summary": "This is Wrestling Inc.'s results for \"WWE Raw\" on October 27, 2025, with a match between WWE Hall of Famer Nikki Bella and Roxanne Perez of Judgment Day!",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2009304/wwe-raw-october-27-intercontinental-championship-number-one-contenders-match-roxanne-perez-nikki-bella/",
    "publishedAt": "2025-10-27T22:58:43+00:00",
    "category": "general"
  },
  {
    "title": "AJ Lee Clarifies Social Media Presence, Debunks Fake Facebook Account",
    "summary": "AJ Lee (AJ Mendez) recently took to social media to clarify her official online presence and warn fans about a fake Facebook account impersonating her and spreading misinformation. The former WWE...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/lee-clarifies-social-media-presence-debunks-fake-facebook-account/",
    "publishedAt": "2025-10-27T22:57:11+00:00",
    "category": "wwe"
  },
  {
    "title": "Report: Face Off Between Two Top Stars Set To Open Tonight's WWE Raw",
    "summary": "A face-off between two top \"WWE Raw\" stars is reportedly set to open tonight's show from Anaheim, California.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2009297/face-off-cm-punk-jey-uso-open-tonight-wwe-raw/",
    "publishedAt": "2025-10-27T22:47:01+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Raw Results – 10/27/25 (CM Punk and Jey Uso meet before title match, Rusev vs. Penta in an IC Title No. 1 Contender’s Match)",
    "summary": "WWE Raw ResultsOctober 27, 2025Anaheim, California (Honda Center)Commentary: Joe Tessitore and Wade BarrettResults by: Mike Tedesco of Wrestleview.com… The post WWE Raw Results – 10/27/25 (CM Punk...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-raw-results/365549-live-wwe-raw-results-october-27-2025-anaheim/",
    "publishedAt": "2025-10-27T22:35:23+00:00",
    "category": "wwe"
  },
  {
    "title": "TNA's Chris Bey, Brittnie Brooks Comment On One-Year Anniversary Of His Neck Injury",
    "summary": "TNA star Chris Bey, and his girlfriend Brittnie Brooks, spoke out on social media on Monday, commenting on the one-year anniversary of Bey's neck injury.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2009267/tna-chris-bey-brittnie-brooks-one-year-anniversary-neck-injury/",
    "publishedAt": "2025-10-27T22:27:28+00:00",
    "category": "tna"
  },
  {
    "title": "Controversial Ex-WWE Star Rich Swann Reportedly Re-Joins TNA On Per-Appearance Deal",
    "summary": "Controversial former WWE star and former TNA World Heavyweight Champion Rich Swann appears to be back in TNA,t his time on a pay-per-appearance deal",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2009231/controversial-wwe-rich-swann-re-joins-tna-per-appearance/",
    "publishedAt": "2025-10-27T21:57:07+00:00",
    "category": "wwe"
  },
  {
    "title": "John Cena’s final WWE Raw appearance confirmed",
    "summary": "John Cena’s retirement tour is coming to its final dates, with Netflix promoting via social media the 17-time… The post John Cena’s final WWE Raw appearance confirmed appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/365546-john-cenas-final-wwe-raw-appearance-confirmed/",
    "publishedAt": "2025-10-27T20:58:46+00:00",
    "category": "wwe"
  }
]