[
  {
    "title": "Lexa Valo Is ‘Grateful’ For Mercedes Moné Title Match, Wants Another One",
    "summary": "Lexa Valo looks back on her encounter with “The CEO.” As it stands, Mercedes Moné is the proud owner of nine championship belts, one of which she gained after her surprise appearance at the European...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/features/1580728-lexa-valo-grateful-mercedes-mone-match-wants-another-one",
    "publishedAt": "2025-09-25T18:09:50+00:00",
    "category": "general"
  },
  {
    "title": "Ash By Elegance Wants To Wrestle Mickie James, Congratulates Her On TNA Hall Of Fame Induction",
    "summary": "Ash By Elegance comments on Mickie James going into the TNA Wrestling Hall of Fame. She also praised James as a supporter of hers and noted that she wants the opportunity to step back in the ring...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/ash-by-elegance-wants-to-wrestle-mickie-james-congratulates-her-on-tna-hall-of-fame-induction",
    "publishedAt": "2025-09-25T18:04:18+00:00",
    "category": "tna"
  },
  {
    "title": "Darby Allin To Organize & Perform In Live Wrestling Shows At Art Exhibition",
    "summary": "A new venture for Allin. There is an art exhibition in New York City that opens on September 26th and will run until October 11th. AEW's Darby Allin is advertised for it as he will be competing in...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/darby-allin-to-organize-perform-in-live-wrestling-shows-at-art-exhibition",
    "publishedAt": "2025-09-25T18:00:51+00:00",
    "category": "aew"
  },
  {
    "title": "6 Booking Mistakes Haunting The Triple H Era",
    "summary": "WWE fans have not been universally pleased with the creative decisions coming from the Cerebral Assassin.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1976549/wwe-booking-mistakes-triple-h-era/",
    "publishedAt": "2025-09-25T18:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Shotzi Blackheart On WWE Departure: I Always Thought Triple H Really Believed In Me, It Was A Little Disappointing",
    "summary": "Shotzi Blackheart didn’t get a chance to show her fire. Blackheart made her return to the indie scene in June 2025, just a few weeks after her contract with WWE expired. The departure came as a...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/shotzi-blackheart-triple-h-257442",
    "publishedAt": "2025-09-25T17:59:06+00:00",
    "category": "wwe"
  },
  {
    "title": "Logan Paul’s Official WWE Roster Status Revealed",
    "summary": "A new report has shed light on the official internal roster status of the current WWE United States Champion, Logan Paul. According to WrestleVotes Radio, the social media megastar is listed...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/logan-pauls-official-wwe-roster-status-revealed/",
    "publishedAt": "2025-09-25T17:52:14+00:00",
    "category": "wwe"
  },
  {
    "title": "The Rock Gets Emotional While Speaking About Ava, Credits Ava For Carving Her Own Lane In Wrestling",
    "summary": "The Rock stated that Ava never asked him to make any calls for her. Dwayne 'The Rock' Johnson is continuing his press run to promote 'The Smashing Machine' movie. He was at an event for the film (via...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/the-rock-gets-emotional-while-speaking-about-ava-credits-ava-for-carving-her-own-lane-in-wrestling",
    "publishedAt": "2025-09-25T17:30:40+00:00",
    "category": "general"
  },
  {
    "title": "Charlotte Flair Gives Her Take On What It Takes To Be A Great WWE Superstar",
    "summary": "Charlotte Flair shares her thoughts on what makes a great WWE Superstar. Charlotte Flair is a trailblazer and a history-maker. While she had to struggle for some time in her father Ric Flair's...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/charlotte-flair-gives-her-take-on-what-it-takes-to-be-a-great-wwe-superstar",
    "publishedAt": "2025-09-25T17:30:21+00:00",
    "category": "wwe"
  },
  {
    "title": "Santino Marella: TNA Is Not A Secondary Brand, We Won’t Be Portrayed Like That",
    "summary": "Santino Marella had some strong words about TNA’s place in the pro wrestling world. Marella is currently the on-air Director of Authority in TNA. For the most part, the company has enjoyed its...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/features/interviews/1581093-santino-marella-tna-is-not-a-secondary-brand",
    "publishedAt": "2025-09-25T17:28:24+00:00",
    "category": "general"
  },
  {
    "title": "WWE Champ Tiffany Stratton Offers Injury Update Ahead Of Scheduled SmackDown Defense",
    "summary": "WWE Women's Champion Tiffany Stratton gives an update on her injury status ahead of tomorrow's triple threat against Jade Cargill and Nia Jax on \"SmackDown.\"",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1978593/wwe-smackdown-tiffany-stratton-injury-update-defense-nia-jax-jade-cargill/",
    "publishedAt": "2025-09-25T17:14:03+00:00",
    "category": "wwe"
  },
  {
    "title": "There Were People In WWE Reportedly “Stunned” By ESPN’s “C” Grade For Wrestlepalooza",
    "summary": "The inaugural WWE Wrestlepalooza premium live event was a major business milestone for the company, but it was not a critical success in the eyes of their new broadcast partner, ESPN, and that has...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/there-people-wwe-reportedly-stunned-espns-grade-wrestlepalooza/",
    "publishedAt": "2025-09-25T17:10:18+00:00",
    "category": "wwe"
  },
  {
    "title": "The Miz Was Shocked CM Punk Apologized To Him In 2023, Says Punk Seems Happy Now",
    "summary": "In April 2023, CM Punk showed up backstage to WWE Raw in Chicago despite still being under contract to AEW. While backstage, Punk apologized to The Miz, whom he had previously called out over WWE's...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/the-miz-was-shocked-cm-punk-apologized-to-him-in-2023-says-punk-seems-happy-now",
    "publishedAt": "2025-09-25T17:03:44+00:00",
    "category": "wwe"
  },
  {
    "title": "REPORT: Brock Lesnar Scheduled For Major 2026 WWE Events",
    "summary": "Brock Lesnar’s destructive return at WWE SummerSlam was just the beginning, as “The Beast Incarnate” is tentatively scheduled to be a part of the two biggest WWE events of early 2026. According to a...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/report-brock-lesnar-scheduled-major-2026-wwe-events/",
    "publishedAt": "2025-09-25T17:00:54+00:00",
    "category": "wwe"
  },
  {
    "title": "Mercedes Mone Reacts To AEW Women's Tag Team Titles Announcement: Who Wants To Be My Tag Partner?",
    "summary": "Mercedes Mone wants more gold. On the September 25 edition of AEW Dynamite, Tony Khan and Renee Paquette shocked the world of wrestling by introducing AEW Women's Tag Team Championships. Plenty of...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/mercedes-mone-reacts-to-aew-womens-tag-team-titles-announcement-who-wants-to-be-my-tag-partner",
    "publishedAt": "2025-09-25T16:55:11+00:00",
    "category": "aew"
  },
  {
    "title": "WWE To Announce John Cena’s Final Match Details Soon",
    "summary": "The details surrounding John Cena’s final match are expected to be announced by WWE within the coming week, with a potential announcement as early as this Sunday, September 28. According to a report...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-announce-john-cenas-final-match-details-soon/",
    "publishedAt": "2025-09-25T16:54:11+00:00",
    "category": "wwe"
  },
  {
    "title": "Joe Hendry vs. Eric Young Added To TNA Victory Road",
    "summary": "Joe Hendry will be in action against Eric Young at TNA Victory Road on Friday, September 26. Young has been on a mission to cleanse TNA, targeting Hendry in the process. Hendry has been regularly...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/joe-hendry-vs-eric-young-added-to-tna-victory-road",
    "publishedAt": "2025-09-25T16:47:03+00:00",
    "category": "tna"
  },
  {
    "title": "Top WWE Star Shares Excitement For WrestleMania 43 In Saudi Arabia",
    "summary": "Tiffany Stratton is excited for WWE WrestleMania 43 taking place in Saudi Arabia. WWE announced a few weeks ago that the event will be held outside the U.S. for the first time. To make the...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1580943-top-wwe-star-reacts-wrestlemania-43-saudi-arabia",
    "publishedAt": "2025-09-25T16:27:22+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Referee Details Getting Bit By A Bat",
    "summary": "Is Charles Robinson the new Batman? Through his work as a pro wrestling referee, Charles Robinson often encounters, and sometimes becomes victim to, physical risks. As revealed on Insight With Chris...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1581140-wwe-referee-details-getting-bit-by-a-bat",
    "publishedAt": "2025-09-25T16:22:39+00:00",
    "category": "general"
  },
  {
    "title": "The Rock: Tom Aspinall Would Be A Great WWE Performer, I'll Rock Bottom His Candy Ass",
    "summary": "The Rock responds to Tom Aspinall. Earlier this week, UFC's Tom Aspinall made some headlines after saying that he would choose to wrestle The Rock if he had the opportunity to have one match in WWE....",
    "source": "Fightful",
    "url": "https://www.fightful.com/mma/the-rock-tom-aspinall-wwe-257408",
    "publishedAt": "2025-09-25T16:22:18+00:00",
    "category": "wwe"
  },
  {
    "title": "Backstage Update On TNA Star Masha Slamovich's Potential Future",
    "summary": "Several reports have emerged regarding the TNA and WWE positions on Masha Slamovich after she was accused of domestic violence on social media this week.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1978516/update-tna-wwe-nxt-star-masha-slamovich-potential-future/",
    "publishedAt": "2025-09-25T16:18:22+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW's Mercedes Mone Says Is Auditioning Official 'Belt Boys'",
    "summary": "Mercedes Mone is looking to hire more \"belt boys\" for her entrance to the ring in the near future.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1978499/aew-mercedes-mone-belt-boys-auditions/",
    "publishedAt": "2025-09-25T16:03:34+00:00",
    "category": "aew"
  },
  {
    "title": "Santino Marella Says A TV Deal Would Make TNA The Number Two Wrestling Company",
    "summary": "Santino Marella believes a new television deal would put TNA Wrestling in position to be recognized as the number two wrestling company. Marella spoke with Lucha Libre Online and praised TNA’s growth...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1581167-santino-marella-tv-deal-would-make-tna-number-two",
    "publishedAt": "2025-09-25T15:57:30+00:00",
    "category": "tna"
  },
  {
    "title": "CM Punk Reveals the Real Reason He Left WWE Back in 2014",
    "summary": "It is no secret that former WWE World Heavyweight Champion CM Punk left WWE in 2014. He was gone from the world of professional wrestling for nearly seven years until he returned in 2021. There have...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1580944-cm-punk-reveals-the-real-reason-he-left-wwe-back-in-2014",
    "publishedAt": "2025-09-25T15:42:22+00:00",
    "category": "general"
  },
  {
    "title": "AEW Files For Bacon-Related Trademarks",
    "summary": "You’ve heard of the AEW Tailgate Brawl. Now get ready for a… Bacon Brawl? AEW filed to trademark “AEW Bacon Brawl” on September 24. The mark, along with the similar “Bacon Brawl,” would be used for...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1581157-aew-files-for-bacon-related-trademarks",
    "publishedAt": "2025-09-25T15:39:42+00:00",
    "category": "wwe"
  },
  {
    "title": "AJ Styles vs. John Cena Was Planned For WWE Crown Jewel Longer Than You Think",
    "summary": "On the surface, the final match between John Cena and AJ Styles seems to have come about after the former gauged interest from fans online. According to a new report, however, internal plans for this...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1581134-how-long-aj-styles-vs-john-cena-planned-wwe-crown-jewel",
    "publishedAt": "2025-09-25T15:18:15+00:00",
    "category": "wwe"
  },
  {
    "title": "Former WWE NXT Star Hints At How Low Their Salary Was",
    "summary": "Jazmyn Nyx recently announced she was leaving WWE, and the financial terms of a new contract influenced her decision. Now, a new response to her announcement hints at how much she was actually making...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1581150-former-wwe-nxt-star-how-low-their-salary-was",
    "publishedAt": "2025-09-25T15:14:46+00:00",
    "category": "wwe"
  },
  {
    "title": "The Rock On UFC Champion: “He’d Be A Great WWE Performer”",
    "summary": "Dwayne “The Rock” Johnson has responded to recent comments from UFC Heavyweight Champion Tom Aspinall, who named the WWE legend as a dream opponent for a potential crossover match. The Rock, who now...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/rock-ufc-champion-hed-great-wwe-performer/",
    "publishedAt": "2025-09-25T15:10:31+00:00",
    "category": "wwe"
  },
  {
    "title": "Ricochet: AEW Is Focused On Selling Tickets To Families Who Can't Afford WWE Shows",
    "summary": "Ricochet comments on AEW making their shows more affordable than WWE, while sharing his thoughts on being counter-programmed by the competition.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1978411/ricochet-aew-focused-selling-tickets-families-cant-afford-wwe-shows/",
    "publishedAt": "2025-09-25T14:53:44+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Referee Admits He Lied About Injury During Goldberg Match",
    "summary": "WWE referee Charles Robinson has taken some pretty nasty-looking bumps. As it turns out, he recently admitted to making up one of the most vicious ones. Robinson spoke with Chris Van Vliet on his...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1581142-wwe-referee-admits-he-lied-about-injury-during-goldberg-match",
    "publishedAt": "2025-09-25T14:45:11+00:00",
    "category": "wwe"
  },
  {
    "title": "Brock Lesnar Featured On New Promotional Advertising For WWE WrestleMania 42",
    "summary": "WWE is using Brock Lesnar to promote the upcoming WrestleMania 42 PLE, along with several other top stars of the promotion.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1978192/brock-lesnar-featured-new-promotional-advertising-wwe-wrestlemania-42/",
    "publishedAt": "2025-09-25T14:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Former TNA Knockouts Champion Masha Slamovich Addresses Domestic Violence Allegations",
    "summary": "TNA Wrestling's Masha Slamovich has opened up for the first time about the abuse allegations against her, apologizing to everyone she has hurt.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1978160/former-tna-knockouts-champion-masha-slamovich-addresses-domestic-violence-allegations/",
    "publishedAt": "2025-09-25T13:30:00+00:00",
    "category": "general"
  },
  {
    "title": "The Undertaker Tells Critics Of His New Podcast Format To “Relax And Enjoy The Ride”",
    "summary": "WWE Hall of Famer The Undertaker has directly addressed the fan criticism surrounding his wife, Michelle McCool, becoming the new co-host of his Six Feet Under podcast. On the latest episode of the...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/undertaker-tells-critics-his-new-podcast-format-relax-enjoy-ride/",
    "publishedAt": "2025-09-25T13:00:24+00:00",
    "category": "wwe"
  },
  {
    "title": "Former NXT Star Jazmyn Nyx Explains WWE Departure",
    "summary": "Jazmyn Nyx, who was kicked out of the Fatal Influence faction this week, has given her first reactions to her WWE exit and explained why she left.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1978153/former-nxt-star-jazmyn-nyx-explains-wwe-departure/",
    "publishedAt": "2025-09-25T13:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE HOFer Mark Henry Reflects On John Cena & Brock Lesnar's Journey",
    "summary": "WWE Hall of Famer Mark Henry knew both John Cena and Brock Lesnar when they were first starting out at OVW in Louisville. He comments on their journeys.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1975303/wwe-hofer-mark-henry-reflects-john-cena-brock-lesnar-journey/",
    "publishedAt": "2025-09-25T12:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Backstage News On John Cena Vs. AJ Styles At WWE Crown Jewel",
    "summary": "The recent social media campaign and storyline teasers surrounding a final match between John Cena and AJ Styles were reportedly part of a deliberate, long-term plan to build hype for the bout, which...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/backstage-news-john-cena-styles-wwe-crown-jewel/",
    "publishedAt": "2025-09-25T12:22:15+00:00",
    "category": "wwe"
  },
  {
    "title": "Tyrese Haliburton Says He’s Trying To Get Physical In WWE",
    "summary": "Indiana Pacers All-Star point guard Tyrese Haliburton is not content with just sitting ringside. He wants to get in on the action. Speaking on the latest episode of What’s Your Story?, Haliburton...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/tyrese-haliburton-says-hes-trying-get-physical-wwe/",
    "publishedAt": "2025-09-25T12:02:03+00:00",
    "category": "wwe"
  },
  {
    "title": "Tiffany Stratton’s WrestleMania Entrance Was Years In The Making",
    "summary": "WWE Women’s Champion Tiffany Stratton made one of the most memorable entrances at WrestleMania 41, embracing her “Buff Barbie” persona by emerging from a life-sized replica doll box. The...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/tiffany-strattons-wrestlemania-entrance-years-making/",
    "publishedAt": "2025-09-25T12:00:48+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW Dynamite - 9/24/2025: 3 Things We Loved & 3 We Hated",
    "summary": "The best and the worst of this week's AEW Dynamite.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1978156/aew-dynamite-september-24-2025-3-things-we-loved-hated/",
    "publishedAt": "2025-09-25T07:01:33+00:00",
    "category": "aew"
  },
  {
    "title": "Masha Slamovich issues statement on domestic violence allegations",
    "summary": "TNA Masha Slamovich took to X on Wednesday, issuing a statement on the recent domestic violence allegations, which… The post Masha Slamovich issues statement on domestic violence allegations appeared...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/impact-wrestling-news/362641-masha-slamovich-issues-statement-on-domestic-violence-allegations/",
    "publishedAt": "2025-09-25T03:50:00+00:00",
    "category": "tna"
  },
  {
    "title": "AEW Dynamite Highlights: New Titles Revealed And More!",
    "summary": "AEW has posted highlights from Wednesday night’s Dynamite that featured Tony Khan’s important announcement, which was the reveal… The post AEW Dynamite Highlights: New Titles Revealed And More!...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/aew-news/362636-aew-dynamite-highlights-new-titles-revealed-and-more/",
    "publishedAt": "2025-09-25T03:41:36+00:00",
    "category": "aew"
  },
  {
    "title": "AEW Tailgate Brawl scheduled for day of WrestleDream PPV",
    "summary": "In a press release issued on Wednesday, Warner Bros Discovery revealed a Tailgate Brawl will air live coast-to-coast… The post AEW Tailgate Brawl scheduled for day of WrestleDream PPV appeared first...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/aew-news/362603-aew-tailgate-brawl-scheduled-for-day-of-wrestledream-ppv/",
    "publishedAt": "2025-09-25T00:27:40+00:00",
    "category": "wwe"
  },
  {
    "title": "Coyote Promotions announce multi-year agreement to bring co-branded WWE Nights to professional sports teams",
    "summary": "Coyote Promotions and WWE announced the following on Wednesday. Coyote Promotions to Bring Co-Branded WWE Nights to Professional… The post Coyote Promotions announce multi-year agreement to bring...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/362598-coyote-promotions-announce-multi-year-agreement-to-bring-co-branded-wwe-nights-to-professional-sports-teams/",
    "publishedAt": "2025-09-25T00:10:16+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW Dynamite Results – 9/24/25 (All Out Fallout: Three title matches, major announcement from Tony Khan, and more!)",
    "summary": "AEW Dynamite ResultsSeptember 24, 2025Pittsburgh, Pennsylvania (Peterson Events Center)Results by: Alex Kahrs of Wrestleview.com Do you remember the… The post AEW Dynamite Results – 9/24/25 (All Out...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/top-story/362592-aew-dynamite-results-9-24-25-all-out-fallout-three-title-matches-and-more/",
    "publishedAt": "2025-09-25T00:00:00+00:00",
    "category": "aew"
  },
  {
    "title": "NXT talent confirms departure, says contract offer didn’t ‘cut it financially’",
    "summary": "NXT talent Jazmyn Nyx took to Instagram, confirming reports that she is indeed departing WWE after her current… The post NXT talent confirms departure, says contract offer didn’t ‘cut it financially’...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/362576-nxt-talent-confirms-departure-says-contract-offer-didnt-cut-it-financially/",
    "publishedAt": "2025-09-24T20:45:28+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Champion provides injury update after missing NXT Homecoming",
    "summary": "WWE Women’s Champion Tiffany Stratton provided an injury update during her appearance on the most recent Going Ringside… The post WWE Champion provides injury update after missing NXT Homecoming...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/362571-wwe-champion-provides-injury-update-after-missing-nxt-homecoming/",
    "publishedAt": "2025-09-24T19:08:03+00:00",
    "category": "wwe"
  },
  {
    "title": "Match featuring Masha Slamovich pulled from TNA Victory Road",
    "summary": "TNA Wrestling has pulled the match Title Match between Knockouts Champion Ash by Elegance vs. Masha Slamovich, that was… The post Match featuring Masha Slamovich pulled from TNA Victory Road appeared...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/impact-wrestling-news/362565-match-featuring-masha-slamovich-pulled-from-tna-victory-road/",
    "publishedAt": "2025-09-24T18:49:22+00:00",
    "category": "general"
  },
  {
    "title": "John Cena Sr. expresses disappointment with how WWE booked his son’s heel turn",
    "summary": "During a recent appearance on the UnSKrippted Podcast, John Cena Sr. (father of WWE’s John Cena), spoke on… The post John Cena Sr. expresses disappointment with how WWE booked his son’s heel turn...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/362559-john-cena-sr-expresses-disappointment-with-how-wwe-booked-his-sons-heel-turn/",
    "publishedAt": "2025-09-24T18:19:44+00:00",
    "category": "wwe"
  }
]