[
  {
    "title": "Sting's Son Steven Borden To Debut At Event Featuring AEW's Darby Allin, Killer Kross",
    "summary": "Wrestling legend Sting has seemingly inspired his son to follow in his footsteps. Steven Borden has been training with his father's AEW tag partner Darby Allin.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1983105/aew-sting-son-steven-borden-wrestling-debut-darby-allin-killer-kross/",
    "publishedAt": "2025-09-30T18:05:54+00:00",
    "category": "aew"
  },
  {
    "title": "Big E Expects This Young Star To Hold A World Title In WWE Within 5 Years",
    "summary": "Big E had high praise for this young superstar, saying it is not crazy to think that he could be a future world champion in WWE in the near future.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1983093/wwe-big-e-world-title-dominik-mysterio-5-years/",
    "publishedAt": "2025-09-30T18:01:05+00:00",
    "category": "general"
  },
  {
    "title": "Booker T Believes This WWE NXT Star Is Ready for the Main Roster",
    "summary": "Booker T says former WWE NXT Champion Oba Femi is ready for the main roster. Oba Femi dropped his WWE NXT Title to Ricky Saints this past weekend at NXT No Mercy. Despite the loss, WWE Hall of Famer...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582292-booker-t-wwe-nxt-star-main-roster-ready",
    "publishedAt": "2025-09-30T17:57:04+00:00",
    "category": "wwe"
  },
  {
    "title": "Tommy Dreamer Hails Seth Rollins as the Central Thread of WWE RAW",
    "summary": "Tommy Dreamer explained why Seth Rollins was the central figure on this week’s WWE Raw. The show took place at the Lenovo Center in Raleigh, North Carolina, and featured a segment with Rollins and...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582313-tommy-dreamer-seth-rollins-central-figure-wwe-raw",
    "publishedAt": "2025-09-30T17:56:26+00:00",
    "category": "wwe"
  },
  {
    "title": "Randy Orton And Cody Rhodes vs Bron Breakker And Bronson Reed Set For Friday's WWE SmackDown",
    "summary": "Randy Orton and Cody Rhodes will take on The Vision on this Friday's edition of WWE SmackDown. Since WWE Wrestlepalooza, Cody Rhodes has been dealing with The Vision as he looks to win the WWE Crown...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/randy-orton-and-cody-rhodes-vs-bron-breakker-and-bronson-reed-set-for-fridays-wwe-smackdown",
    "publishedAt": "2025-09-30T17:55:53+00:00",
    "category": "wwe"
  },
  {
    "title": "Chelsea Green Calls Nia Jax a Locker Room Leader",
    "summary": "Last week on SmackDown, the main event had an awkward ending. A pinfall that did not go as planned created chaos, which ended up being a bad match. The match was a Triple Threat match for the WWE...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582327-chelsea-green-calls-nia-jax-a-locker-room-leader",
    "publishedAt": "2025-09-30T17:54:02+00:00",
    "category": "wwe"
  },
  {
    "title": "Dream Girl Ellie Believes She’d Be A Strategic Threat On Survivor",
    "summary": "Could a Survivor run be in Dream Girl Ellie‘s future? In September 2023, Netflix debuted a docuseries, titled Wrestlers, following the behind-the-scenes workings of Ohio Valley Wrestling and its...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/features/1582296-dream-girl-ellie-believes-shed-be-a-strategic-threat-on-survivor",
    "publishedAt": "2025-09-30T17:52:53+00:00",
    "category": "general"
  },
  {
    "title": "Triple H: WWE Will Give John Cena An ‘Unforgettable Sendoff’",
    "summary": "Triple H is excited to honor his former rival. On December 13, John Cena will step into Monumental Sports & Entertainment’s Capital One Arena in Washington, D.C. for the final match of his Hall of...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582399-triple-h-wwe-will-give-john-cena-an-unforgettable-sendoff",
    "publishedAt": "2025-09-30T17:50:59+00:00",
    "category": "wwe"
  },
  {
    "title": "Stephanie Vaquer Says She Felt Like She Was Home Again At NXT Homecoming",
    "summary": "Stephanie Vaquer reflects on NXT Homecoming. At NXT Homecoming, Vaquer would return to the brand to team with Lyra Valkyria and Rhea Ripley to take on the faction of Fatal Influence (Jacy Jayne,...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/stephanie-vaquer-says-she-felt-like-she-was-home-again-at-nxt-homecoming",
    "publishedAt": "2025-09-30T17:39:42+00:00",
    "category": "wwe"
  },
  {
    "title": "Donovan Dijak Announced For MLW Slaughterhouse’25 This Saturday In Long Beach, CA",
    "summary": "Major League Wrestling (MLW) has announced that Donovan Dijak is coming to MLW Slaughterhouse’25 this Saturday, October 4, at Thunder Studios Arena in Long Beach, CA. The event will be presented live...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/mlw-news/donovan-dijak-announced-mlw-slaughterhouse25-saturday-long-beach/",
    "publishedAt": "2025-09-30T17:16:42+00:00",
    "category": "general"
  },
  {
    "title": "Jey Uso Wants To Make It To 20 Years Of The Usos In WWE",
    "summary": "Jey Uso has his eyes set on a milestone celebration for himself and his twin brother, Jimmy Uso. In recent years, Jey Uso and Jimmy Uso have gone their separate ways and branched out as singles...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/jey-uso-wants-to-make-it-to-20-years-of-the-usos-in-wwe",
    "publishedAt": "2025-09-30T17:07:42+00:00",
    "category": "wwe"
  },
  {
    "title": "Eric Bischoff Grades John Cena's WWE Retirement Run, With And Without Heel Turn",
    "summary": "The WWE Hall of Famer weighed in on the victory lap John Cena has been taking all of 2025.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1982986/wwe-eric-bischoff-grades-john-cena-retirement-tour-heel-turn/",
    "publishedAt": "2025-09-30T17:01:34+00:00",
    "category": "wwe"
  },
  {
    "title": "Jack Perry Teases A Darker Version Of Jurassic Express",
    "summary": "After a long absence, Jack Perry is back in AEW, and he’s ready to unleash a new, darker version of Jurassic Express. Perry made his surprise return at the All Out pay-per-view earlier this month,...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/jack-perry-teases-darker-version-jurassic-express/",
    "publishedAt": "2025-09-30T16:58:42+00:00",
    "category": "aew"
  },
  {
    "title": "IYO SKY Says She Prefers Being A Babyface More Than Being A Heel Because She Gets To Always Smile While Wrestling",
    "summary": "IYO SKY says she prefers to be a babyface. For a large portion of IYO SKY's career in WWE, she has been a heel, with the majority of her run in WWE NXT being as a heel. Following the breakup of...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/iyo-sky-says-she-prefers-being-a-babyface-more-than-being-a-heel-because-she-gets-to-always-smile-while-wrestling",
    "publishedAt": "2025-09-30T16:54:27+00:00",
    "category": "wwe"
  },
  {
    "title": "Bayley Freaks Out Over WWE Raw Graphic",
    "summary": "Bayley takes to social media to express her frustration over her new matchup render.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1982938/wwe-raw-bayley-graphics-render/",
    "publishedAt": "2025-09-30T16:46:08+00:00",
    "category": "wwe"
  },
  {
    "title": "Donovon Dijak Set To Compete At MLW Slaughterhouse",
    "summary": "Donovan Dijak will be in action at MLW Slaughterhouse in Long Beach, California. MLW announced that the other half of the MLW World Tag Team Champions will be in action as part of the event on...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/donovon-dijak-set-to-compete-at-mlw-slaughterhouse",
    "publishedAt": "2025-09-30T16:35:34+00:00",
    "category": "general"
  },
  {
    "title": "The Usos: We're Always Excited About Newcomers To The Tag Team Division",
    "summary": "The Usos say that they are always excited about newcomers to the WWE tag team division. At WWE Wrestlepalooza, The Usos would reunite after both enjoying some time apart as singles wrestlers,...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/the-usos-were-always-excited-about-newcomers-to-the-tag-team-division",
    "publishedAt": "2025-09-30T16:33:23+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW Star Says They Didn’t Expect To Be Absent For So Long",
    "summary": "Jack Perry is happy to be back in AEW, even if it took longer than expected. Perry spoke with Haley Miller for VICE ahead of AEW’s 6th Anniversary episode of Dynamite on Wednesday. Perry was absent...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582403-aew-star-didnt-expect-to-be-absent-for-so-long",
    "publishedAt": "2025-09-30T16:28:36+00:00",
    "category": "aew"
  },
  {
    "title": "Jack Perry Thought He Was Only Going To Be Off A Month Or Two Following AEW Full Gear 2024",
    "summary": "At AEW Full Gear 2024, Jack Perry lost the AEW TNT Championship to Daniel Garcia. He was off AEW TV until returning at All Out 2025. “I feel great to be back. Especially under these circumstances...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/jack-perry-thought-he-was-only-going-to-be-off-a-month-or-two-following-aew-full-gear-2024",
    "publishedAt": "2025-09-30T16:21:12+00:00",
    "category": "aew"
  },
  {
    "title": "Booker T On Hulk Hogan: “I Can Only Treat People The Way They Treated Me”",
    "summary": "In a recent interview on the Underground Dialogue podcast, WWE Hall of Famer Booker T offered his detailed perspective on the late Hulk Hogan, addressing the racism controversy, their professional...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/booker-hulk-hogan-can-only-treat-people-way-they-treated/",
    "publishedAt": "2025-09-30T16:20:36+00:00",
    "category": "wwe"
  },
  {
    "title": "Sting’s Son Making In-Ring Debut",
    "summary": "There appears to be a new “Icon” in the making. Following his appearance as Wolfpac Sting at AEW Revolution 2024, news emerged that Steven Borden Jr. was training to become a pro wrestler, with Darby...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582384-stings-son-making-in-ring-debut",
    "publishedAt": "2025-09-30T16:18:09+00:00",
    "category": "aew"
  },
  {
    "title": "Konnan Doesn't Understand Finish For Cena-Lesnar At WWE Wrestlepalooza",
    "summary": "Konnan wonders why WWE creative decided to book the John Cena–Brock Lesnar match the way they did, and why they didn't go down that route.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1982517/wwe-wrestlepalooza-konnan-john-cena-brock-lesnar-finish/",
    "publishedAt": "2025-09-30T16:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW Dynamite Blood & Guts date and location revealed",
    "summary": "AEW has officially announced the date and location for Blood & Guts. The double ring/double cage match will… The post AEW Dynamite Blood & Guts date and location revealed appeared first on WWE News,...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/363004-aew-dynamite-blood-guts-date-and-location-revealed/",
    "publishedAt": "2025-09-30T15:51:41+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE And Ghostwrite Release Exclusive John Cena Collectible",
    "summary": "To commemorate the final match of John Cena’s career, WWE has partnered with the collectible toy company ghostwrite to release an exclusive and unique figure. The collectible, known as a “ghost,” is...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-ghostwrite-release-exclusive-john-cena-collectible/",
    "publishedAt": "2025-09-30T15:33:02+00:00",
    "category": "wwe"
  },
  {
    "title": "Cody Rhodes Has Hilarious Reaction To WWE Screwing Up His Entrance",
    "summary": "Cody Rhodes let out his usual “Woah!” this week, but without the pyro. On this week’s episode of WWE Raw, Seth Rollins cited issues with the fans chanting for his Crown Jewel opponent, Cody Rhodes....",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582356-cody-rhodes-has-hilarious-reaction-to-wwe-screwing-up-his-entrance",
    "publishedAt": "2025-09-30T15:31:27+00:00",
    "category": "wwe"
  },
  {
    "title": "Major Update On Burgeoning Wrestling Career Of Legendary WWE & AEW Star Sting's Son",
    "summary": "Sting's son, Steven Borden, who appeared at his father's last match, has been training to be a wrestler and is set to have his first matches in October.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1982490/burgeoning-wrestling-career-steve-borden-legendary-wwe-aew-sting-son/",
    "publishedAt": "2025-09-30T15:30:00+00:00",
    "category": "general"
  },
  {
    "title": "John Cena Comments On Last Match Announcement",
    "summary": "John Cena is ready for his last time. On Tuesday, WWE announced that John Cena’s final match will headline its next Saturday Night’s Main Event on Saturday, December 13. The event will take place at...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582390-john-cena-comments-on-last-match-announcement",
    "publishedAt": "2025-09-30T15:28:59+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW Sets Date For Return Of Blood & Guts On Dynamite, Same Night As Local GWAR Concert",
    "summary": "AEW's most violent stipulation is making its return this November as the company has officially announced a date for this year's Blood and Guts event.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1982796/aew-dynamite-blood-guts-greensboro-november-12-gwar/",
    "publishedAt": "2025-09-30T15:19:19+00:00",
    "category": "aew"
  },
  {
    "title": "Big E: IYO SKY Has ‘Left Rhea Ripley In The Dust’ In 2025",
    "summary": "Big E says Rhea Ripley might be WWE’s greatest overall performer, but IYO SKY has passed her in a few key areas. Rhea Ripley and IYO SKY will face Asuka and Kairi Sane at WWE Crown Jewel in Perth....",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582385-iyo-sky-has-left-rhea-ripley-in-the-dust-big-e",
    "publishedAt": "2025-09-30T15:12:45+00:00",
    "category": "wwe"
  },
  {
    "title": "Backstage Report On Future Of Netflix Docuseries WWE Unreal",
    "summary": "WWE Unreal, which aired its first season earlier this year, is set to return for a second season, with a release date reportedly being planned.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1982464/wwe-unreal-future-netlfix-season-2/",
    "publishedAt": "2025-09-30T15:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Files Trademarks For “Rayo Americano” And “Bravo Americano”",
    "summary": "WWE has officially filed trademarks for the individual ring names of the new members of the “Los Americanos” faction, which were revealed on this past Monday’s episode of Raw. On the same day that...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-files-trademarks-rayo-americano-bravo-americano/",
    "publishedAt": "2025-09-30T14:56:43+00:00",
    "category": "wwe"
  },
  {
    "title": "Pro Wrestling NOAH Announces Departure Of Former 5x GHC Heavyweight Champ Go Shiozaki",
    "summary": "Pro Wrestling NOAH have announced that the former five-time GHC Heavyweight Champion Go Shiozaki will be leaving the company at the end of the month.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1982745/pro-wrestling-noah-departure-former-5x-ghc-heavyweight-champion-go-shiozaki/",
    "publishedAt": "2025-09-30T14:38:12+00:00",
    "category": "general"
  },
  {
    "title": "WWE HOFer: ESPN Writer Who Gave Wrestlepalooza A Bad Grade Would Be Fired In Vince Era",
    "summary": "A WWE legend has criticized ESPN's report on Wrestlepalooza and shared his thoughts on how Vince McMahon would've reacted if a show had received a bad grade.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1982455/wwe-wrestlepalooza-jbl-espn-bad-grade-fired-vince-mcmahon-era/",
    "publishedAt": "2025-09-30T14:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW Announces Return Of Blood And Guts",
    "summary": "All Elite Wrestling has announced its return to a city rich with professional wrestling history, as the company will be coming to Greensboro, North Carolina, on Wednesday, November 12. The event,...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/aew-announces-return-blood-guts/",
    "publishedAt": "2025-09-30T14:07:16+00:00",
    "category": "aew"
  },
  {
    "title": "Big E: The “Eddie Guerrero Spot” Now Belongs To Dominik Mysterio",
    "summary": "Former WWE Champion Big E believes that the “lie, cheat, steal” spot, made famous by the legendary Eddie Guerrero, should now be exclusively owned by Dominik Mysterio. Speaking on the Raw Recap show,...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/big-eddie-guerrero-spot-now-belongs-dominik-mysterio/",
    "publishedAt": "2025-09-30T14:00:13+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE confirms date, location and venue for John Cena’s retirement match",
    "summary": "-Updated Tuesday, Sept. 30- WWE has officially announced on social media, John Cena’s retirement match. Tickets go on… The post WWE confirms date, location and venue for John Cena’s retirement match...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/362963-wwe-confirms-date-location-and-venue-for-john-cenas-retirement-match/",
    "publishedAt": "2025-09-30T13:55:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Booker T On Jazmyn Nyx’s WWE Departure: “You’ve Gotta Respect” It",
    "summary": "WWE Hall of Famer and NXT commentator Booker T has shared his thoughts on the recent departure of Jazmyn Nyx from WWE, stating that he understands and respects her decision to leave. Nyx was written...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/booker-jazmyn-nyxs-wwe-departure-youve-gotta-respect/",
    "publishedAt": "2025-09-30T12:30:26+00:00",
    "category": "wwe"
  },
  {
    "title": "John Cena’s Retirement Match To Headline WWE Saturday Night’s Main Event In Washington, DC",
    "summary": "WWE issued the following: JOHN CENA’S FINAL MATCH TO HEADLINE SATURDAY NIGHT’S MAIN EVENT ON DECEMBER 13 AT CAPITAL ONE ARENA IN WASHINGTON, D.C. Tickets On Sale Friday, October 17 at 10am ET/7am PT...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/john-cenas-retirement-match-headline-wwe-saturday-nights-main-event-washington/",
    "publishedAt": "2025-09-30T12:03:10+00:00",
    "category": "wwe"
  },
  {
    "title": "Booker T: Oba Femi Is Ready To “Run With The Big Dogs” On The Main Roster",
    "summary": "WWE Hall of Famer and NXT commentator Booker T has given his strong endorsement to Oba Femi, stating that the former NXT Champion is ready to “run with the big dogs” on the main roster. On his Hall...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/booker-oba-femi-ready-run-big-dogs-main-roster/",
    "publishedAt": "2025-09-30T11:18:56+00:00",
    "category": "wwe"
  },
  {
    "title": "Updated Lineup For WWE Crown Jewel",
    "summary": "Below is the updated lineup for WWE Crown Jewel on Saturday, October 11 in Perth Australia. -Men’s Crown… The post Updated Lineup For WWE Crown Jewel appeared first on WWE News, WWE Results, AEW...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/362994-updated-lineup-for-wwe-crown-jewel/",
    "publishedAt": "2025-09-30T03:28:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Mid-West independent pro wrestling promotion shutting down in early 2026",
    "summary": "Mid-West independent pro wrestling promotion, Ruthless Pro Wrestling announced in a press release on Facebook, they are shutting… The post Mid-West independent pro wrestling promotion shutting down...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/misc-news/362989-mid-west-independent-pro-wrestling-promotion-shutting-down-in-early-2026/",
    "publishedAt": "2025-09-30T03:15:29+00:00",
    "category": "general"
  },
  {
    "title": "WWE Raw Highlights: IC Title Match, Tornado Tag, Former Champion Returns",
    "summary": "WWE has posted highlights from Monday’s Raw, which featured an Intercontinental Championship defense, a Tornado Tag Match and… The post WWE Raw Highlights: IC Title Match, Tornado Tag, Former...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/362985-wwe-raw-highlights-ic-title-match-tornado-tag-former-champion-returns/",
    "publishedAt": "2025-09-30T03:02:22+00:00",
    "category": "wwe"
  },
  {
    "title": "Son of Hall of Famer to make pro wrestling debut at 52W Hardway Art Exhibit",
    "summary": "Steven Borden, son of WWE Hall of Famer and former AEW star Sting, is set to make his… The post Son of Hall of Famer to make pro wrestling debut at 52W Hardway Art Exhibit appeared first on WWE News,...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/misc-news/362979-son-of-hall-of-famer-to-make-pro-wrestling-debut-at-52w-hardway-art-exhibit/",
    "publishedAt": "2025-09-30T02:49:47+00:00",
    "category": "wwe"
  },
  {
    "title": "CM Punk returns to WWE Raw next week",
    "summary": "WWE has announced the return of CM Punk to next week’s Raw. Also scheduled for the October 6… The post CM Punk returns to WWE Raw next week appeared first on WWE News, WWE Results, AEW News, AEW...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/362973-cm-punk-returns-to-wwe-raw-next-week/",
    "publishedAt": "2025-09-30T02:19:06+00:00",
    "category": "wwe"
  },
  {
    "title": "Former WWE exec, assistants among subpoenas in shareholder lawsuit",
    "summary": "Brandon Thurston of Wrestlenomics has reported that more subpoenas have been filed in the ongoing Delaware Chancery Court… The post Former WWE exec, assistants among subpoenas in shareholder lawsuit...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/362962-former-wwe-exec-assistants-among-subpoenas-in-shareholder-lawsuit/",
    "publishedAt": "2025-09-30T01:43:55+00:00",
    "category": "wwe"
  },
  {
    "title": "NXT talent announces his departure from WWE",
    "summary": "NXT talent Edris Enofe has announced his departure from WWE. He made the announcement on social media, saying… The post NXT talent announces his departure from WWE appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/362956-nxt-talent-announces-his-departure-from-wwe/",
    "publishedAt": "2025-09-30T01:29:56+00:00",
    "category": "wwe"
  },
  {
    "title": "Ridge Holland confirms injury following TNA tapings",
    "summary": "At the tapings for TNA IMPACT over the weekend, Ridge Holland was helped to the back after appearing… The post Ridge Holland confirms injury following TNA tapings appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/362930-ridge-holland-confirms-injury-following-tna-tapings/",
    "publishedAt": "2025-09-29T23:59:03+00:00",
    "category": "wwe"
  }
]