[
  {
    "title": "Nick Jackson: It Feels Like Everyone Is Retiring, It's Like A Whole Generation Is Wrapping Up",
    "summary": "The Young Bucks talk retirement. As of 2025, the Young Bucks have been active performers in the world of wrestling for over 20 years. In the past, the duo has been open about being in the late stages...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/young-bucks-aew-262417",
    "publishedAt": "2025-10-17T17:58:43+00:00",
    "category": "general"
  },
  {
    "title": "John Cena Confirms WWE Saturday Night's Main Event In December Will Be His Final Match",
    "summary": "John Cena reaffirms fans on social media that he will truly be retiring after his last match at Saturday Night's Main Event.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1999703/john-cena-confirms-wwe-saturday-nights-main-event-december-final-match/",
    "publishedAt": "2025-10-17T17:46:30+00:00",
    "category": "wwe"
  },
  {
    "title": "Speedball Mike Bailey Explains 'Worst' Thing About FTR",
    "summary": "\"Speedball\" Mike Bailey is ready for battle again with FTR at \"Tailgate Brawl\" before WrestleDream on Saturday. However, as he prepares, there's one thing he's hoping FTR won't try to do in their...",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1999700/speedball-mike-bailey-explains-worst-thing-ftr/",
    "publishedAt": "2025-10-17T17:43:55+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Reportedly Transitioning Toward AI-Based Creative Despite 'Absurdly Bad' Pitches",
    "summary": "WWE is reportedly moving toward an AI-based writer's room with Writer AI, despite the fact that it has pitched some embarrassingly bad storylines.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1999698/wwe-ai-creative-absurdly-bad-pitches-bobby-lashley/",
    "publishedAt": "2025-10-17T17:40:39+00:00",
    "category": "wwe"
  },
  {
    "title": "Orange Cassidy Explains How The Tombstone Piledriver Is A Standing 69, Says It Can Be Stinky Having Your Head In Someone's Crotch",
    "summary": "Orange Cassidy breaks down the piledriver vs. the tombstone. Wrestling fans are familiar with the difference between a normal piledriver and a tombstone piledriver. If you're not, allow Orange...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/orange-cassidy-explains-how-the-tombstone-piledriver-is-a-standing-69-says-it-can-be-stinky-having-your-head-in-someones-crotch",
    "publishedAt": "2025-10-17T17:32:49+00:00",
    "category": "general"
  },
  {
    "title": "Matt Jackson: AEW's Current Tag Division Is Probably The Most Elite Tag Division Since The Beginning",
    "summary": "Matt Jackson has a ton of praise for AEW's tag team division. In 2019, AEW kicked off their existence with a loaded tag team roster that included duos like the Young Bucks, Best Friends, Santana &...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/matt-jackson-aew-tag-team-division-262411",
    "publishedAt": "2025-10-17T17:09:49+00:00",
    "category": "aew"
  },
  {
    "title": "Bron Breakker Naps During Jey Uso’s Entrance In Japan",
    "summary": "Bron Breakker decided to take a quick nap while Jey Uso was yeeting with the fans at a live event. The WWE Superstars are currently in Japan for a couple of SuperShow events. The first show took...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585326-bron-breakker-naps-during-jey-uso-entrance-wwe-japan",
    "publishedAt": "2025-10-17T16:55:47+00:00",
    "category": "wwe"
  },
  {
    "title": "AAA World Cruiserweight Championship Match Added To AAA Héroes Inmortales",
    "summary": "New title match added to the mix. October 25th is the date of AAA's Héroes Inmortales event at Gimnasio Olímpico Juan de la Barrera in Mexico City, Mexico. The newest addition to the card is a AAA...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/aaa-world-cruiserweight-championship-match-added-to-aaa-heroes-inmortales",
    "publishedAt": "2025-10-17T16:51:29+00:00",
    "category": "general"
  },
  {
    "title": "Jamie Hayter Brings Her Own Personal Flair To AEW, Talks ‘Blood & Guts’",
    "summary": "Jamie Hayter is excited and curious about what’s in store at WrestleDream. Hayter spoke with WrestleZone Managing Editor Bill Pritchard ahead of her match with Thekla at AEW WrestleDream. The “Toxic...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585299-jamie-hayter-own-personal-flair-to-aew-talks-blood-guts",
    "publishedAt": "2025-10-17T16:44:32+00:00",
    "category": "aew"
  },
  {
    "title": "Karrion Kross Addresses Whether The Door Is Still Open At WWE",
    "summary": "Former WWE star Karrion Kross addresses whether the door is still open for he and Scarlett at WWE, where they spent their last three years.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1999628/wwe-karrion-kross-door-still-open/",
    "publishedAt": "2025-10-17T16:43:56+00:00",
    "category": "wwe"
  },
  {
    "title": "Nick Jackson: We Joke With The Locker Room Like, 'If You Don't Know How To Wrestle In 2025 On Dynamite, You're Screwed'",
    "summary": "The Young Bucks want the best of the best in AEW. Most fans believe that AEW has tightened things up from an in-ring perspective in 2025, leading to a ton of great matches and moments on television....",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/nick-jackson-262405",
    "publishedAt": "2025-10-17T16:43:09+00:00",
    "category": "aew"
  },
  {
    "title": "REPORT: WWE Has Big Plans For Chris Jericho If He Returns",
    "summary": "With Chris Jericho’s AEW contract reportedly expiring at the end of the year, speculation about a potential return to WWE has been rampant. A new report from the latest edition of the Wrestling...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/report-wwe-big-plans-chris-jericho-returns/",
    "publishedAt": "2025-10-17T16:35:21+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW's Dax Harwood Has Interesting Response To Question Of Whether FTR Are Still Great",
    "summary": "Going from good guys to bad, it appears some fans argue the relevancy/legacy of AEW's FTR in tag team wrestling. Dax Harwood had this to say about the matter.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1999610/aew-dax-harwood-interesting-response-question-ftr-still-great-tag-team-wembley-2023/",
    "publishedAt": "2025-10-17T16:28:01+00:00",
    "category": "aew"
  },
  {
    "title": "Dave Meltzer Discusses Chris Jericho's Potential To Return To AEW, Move To WWE",
    "summary": "Dave Meltzer provides an update on Chris Jericho finishing his career in WWE instead of AEW.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1999604/wwe-aew-chris-jericho-return/",
    "publishedAt": "2025-10-17T16:24:19+00:00",
    "category": "wwe"
  },
  {
    "title": "Cyrus Kowsari Hired As WWE Senior Director of Creative Strategy, Will Focus On AI Storytelling And Integration",
    "summary": "WWE hired Cyrus Kowsari as the Senior Director of Creative Strategy in early October. Cyrus wrote on his LinkedIn, \"If you've known me for any part of my life, you know how passionate I am about WWE....",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/cyrus-kowsari-hired-as-wwe-senior-director-of-creative-strategy-will-focus-on-ai-storytelling-and-integration",
    "publishedAt": "2025-10-17T16:21:04+00:00",
    "category": "wwe"
  },
  {
    "title": "Matt Hardy On TNA Contract: “We May Have Re-signed Already, Who Knows”",
    "summary": "On the latest episode of his podcast, The Extreme Life of Matt Hardy, the current TNA World Tag Team Champion addressed recent reports that his and his brother Jeff’s contracts with the promotion are...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/tna-news/matt-hardy-tna-contract-may-have-resigned-already-who-knows/",
    "publishedAt": "2025-10-17T16:02:57+00:00",
    "category": "tna"
  },
  {
    "title": "Jamie Hayter Respects Thekla But Plans To Kick Her Ass At AEW WrestleDream",
    "summary": "Jamie Hayter is ready to kick Thekla's ass at AEW WrestleDream. However, she admits that she does have a great deal of respect for her. Thekla made her debut in AEW by attacking Jamie Hayter. This...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/jamie-hayter-respects-thekla-but-plans-to-kick-her-ass-at-aew-wrestledream",
    "publishedAt": "2025-10-17T16:00:00+00:00",
    "category": "aew"
  },
  {
    "title": "New WWE Hire Will Focus Transition To AI-Based Storytelling — Report",
    "summary": "WWE is trying to see how it can integrate AI into its storylines on television. Cyrus Kowsari was recently hired as WWE’s new Senior Director of Creative Strategy. He previously held roles at ONE MMA...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585319-new-wwe-hire-will-focus-transition-to-ai-based-storytelling-report",
    "publishedAt": "2025-10-17T15:54:46+00:00",
    "category": "wwe"
  },
  {
    "title": "Drew McIntyre Continues To Ensure Fans That WWE SmackDown Match With Jacob Fatu Will Happen",
    "summary": "Drew McIntyre insists that his match with Jacob Fatu will happen. After weeks of turmoil, McIntyre and Fatu are set to go to war on Friday's episode of SmackDown, as they'll clash in a singles...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/drew-mcintyre-jacob-fatu-wwe-262395",
    "publishedAt": "2025-10-17T15:45:50+00:00",
    "category": "wwe"
  },
  {
    "title": "Peter Rosenberg: Bobby Heenan Is The Greatest Manager, Paul Heyman Is Something Different",
    "summary": "Peter Rosenberg says no one outranks Bobby Heenan in his mind. Rosenberg recently appeared on Insight with Chris Van Vliet, where he named WWE Hall of Famer Bobby Heenan as his number one manager of...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585286-peter-rosenberg-on-wwe-bobby-heenan-legacy",
    "publishedAt": "2025-10-17T15:35:22+00:00",
    "category": "wwe"
  },
  {
    "title": "John Cena Reiterates He Will Retire On December 13 'Despite Any Speculation Or Rumors'",
    "summary": "John Cena is set to have his retirement match on December 13th at WWE Saturday Night's Main Event. At WWE Money in the Bank 2024, Cena announced that 2025 will be his last year as an in-ring...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/john-cena-reiterates-he-will-retire-on-december-13-despite-any-speculation-or-rumors",
    "publishedAt": "2025-10-17T15:34:03+00:00",
    "category": "wwe"
  },
  {
    "title": "Triple H Shares Footage Developing WWE Star Stephanie Vaquer's Entrance",
    "summary": "In a new video posted on social media, Stephanie Vaquer and Triple H are seen re-working Vaquer's entrance ahead of the Crown Jewel PLE in Australia.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1999358/wwe-triple-h-staphanie-vaquer-entrance-pyro-production/",
    "publishedAt": "2025-10-17T15:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW's Tony Khan Comments On Potentially Running Blood & Guts Matches For Both Genders",
    "summary": "AEW President Tony Khan addresses the possibility of hosting two Blood and Guts matches, one for both genders, this year.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1999527/aew-tony-khan-blood-guts-matches-both-genders/",
    "publishedAt": "2025-10-17T15:29:48+00:00",
    "category": "aew"
  },
  {
    "title": "Former Marigold Referee Found Dead After Bear Attack",
    "summary": "Katsumi Sasazaki was involved in a tragic accident in Japan. Former pro wrestling referee Katsumi Sasazaki went missing on Thursday while working at a hot spring inn in Kitakami, Japan. As he was...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/former-marigold-referee-found-dead-after-bear-attack",
    "publishedAt": "2025-10-17T15:26:09+00:00",
    "category": "general"
  },
  {
    "title": "Top WWE Star Makes Bold Claim About John Cena’s Final Match",
    "summary": "Natalya reveals her picks for John Cena’s final WWE opponent and predicts the outcome for the match. John Cena’s retirement tour is reaching its final stretch, with only four appearances left. He is...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585293-wwe-star-bold-claim-john-cena-final-match",
    "publishedAt": "2025-10-17T15:14:19+00:00",
    "category": "wwe"
  },
  {
    "title": "Mick Foley Has A Message For President Donald Trump",
    "summary": "WWE Hall of Famer Mick Foley shared an emotional video message to the 45th and 47th U.S. President, Donald Trump. Mick Foley shared an emotional video on his YouTube channel directed at U.S....",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585290-wwe-mick-foley-message-for-us-president-donald-trump",
    "publishedAt": "2025-10-17T15:10:47+00:00",
    "category": "wwe"
  },
  {
    "title": "John Cena Reacts To Rumor He’ll Extend His WWE Retirement Tour",
    "summary": "John Cena says he’s a man of his word. Cena is set to compete in his final match at WWE Saturday Night’s Main event on December 13. Tickets for the event went on sale on Friday morning. In response...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585304-john-cena-reacts-rumor-extend-his-wwe-retirement-tour",
    "publishedAt": "2025-10-17T15:06:01+00:00",
    "category": "wwe"
  },
  {
    "title": "Ex-WWE Star Mickie James Issues Statement After Being Inducted Into TNA Hall Of Fame",
    "summary": "Mickie James has issued a touching statement after her induction into the TNA Hall of Fame, thanking various current and former TNA personnel.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1999332/ex-wwe-mickie-james-statement-induction-tna-hall-of-fame/",
    "publishedAt": "2025-10-17T15:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Star Reaches Out to Becky Lynch After Seth Rollins’ Exit from The Vision",
    "summary": "Omos offered to help Becky Lynch after The Vision launched a shocking attack on Seth Rollins. On this week’s WWE RAW, The Vision turned on Rollins, ending his alliance with Bronson Reed, Bron...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585295-wwe-star-reaches-out-becky-lynch-seth-rollins",
    "publishedAt": "2025-10-17T14:57:48+00:00",
    "category": "wwe"
  },
  {
    "title": "REPORT: Seth Rollins’ Injury Scrapped Plans For WWE Title Change",
    "summary": "The recent shoulder injury to Seth Rollins has forced a significant overhaul of WWE’s creative plans. According to the latest edition of the Wrestling Observer Newsletter, prior to Rollins being...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/report-seth-rollins-injury-scrapped-plans-wwe-title-change/",
    "publishedAt": "2025-10-17T14:43:44+00:00",
    "category": "wwe"
  },
  {
    "title": "REPORT: WWE Discussing Big Title Win For John Cena",
    "summary": "A potential new wrinkle has been added to the plans for John Cena’s farewell tour, as a recent report suggests WWE has discussed having the legend win the Intercontinental Championship before he...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/report-wwe-discussing-big-title-win-john-cena/",
    "publishedAt": "2025-10-17T14:30:17+00:00",
    "category": "general"
  },
  {
    "title": "Tony Khan Talks Kota Ibushi's Injury, Confirms It Changed Plans For AEW WrestleDream",
    "summary": "AEW CEO Tony Khan has discussed Kota Ibushi's devastating injury and revealed that the Japanese star was in his plans for the WrestleDream pay-per-view.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1999320/tony-khan-kota-ibushi-injury-changed-plans-aew-wrestledream/",
    "publishedAt": "2025-10-17T14:30:00+00:00",
    "category": "aew"
  },
  {
    "title": "WWE Hires Director To Lead AI Storytelling, Wild Return Pitch Involving AEW Star Revealed",
    "summary": "WWE has reportedly hired a new executive to spearhead a move toward incorporating artificial intelligence into its creative process. According to the latest Wrestling Observer Newsletter, Cyrus...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-hires-director-lead-storytelling-wild-return-pitch-involving-aew-star-revealed/",
    "publishedAt": "2025-10-17T14:21:10+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Forced To Scrap Major Saturday Night’s Main Event Angle",
    "summary": "A new report has revealed WWE’s creative plans for Austin Theory prior to the injury suffered by World Heavyweight Champion Seth Rollins. According to the latest edition of the Wrestling Observer...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-forced-scrap-major-saturday-nights-main-event-angle/",
    "publishedAt": "2025-10-17T14:17:26+00:00",
    "category": "general"
  },
  {
    "title": "MLW To Present Symphony Of Horrors Special On October 25",
    "summary": "MLW issued the following: MLW Presents “Symphony of Horrors” — A Free Two-Hour Special Airing Saturday, October 25 on YouTube and beIN SPORTS at 10PM ET Major League Wrestling (MLW) invites fans to...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/mlw-news/mlw-present-symphony-horrors-special-october/",
    "publishedAt": "2025-10-17T13:13:45+00:00",
    "category": "general"
  },
  {
    "title": "WWE Announces Several New Live Events",
    "summary": "WWE issued the following: WWE® ANNOUNCES SEVEN NEW RAW AND SMACKDOWN DATES & 10 LIVE EVENTS AS PART OF ANNUAL HOLIDAY TOUR Tickets On Sale Friday, October 24 at 10am Local in Each Market Presale...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-announces-several-new-live-events-3/",
    "publishedAt": "2025-10-17T13:11:41+00:00",
    "category": "wwe"
  },
  {
    "title": "Lilian Garcia filling in for Alicia Taylor on this Monday’s WWE Raw",
    "summary": "WWE ring announcer Lilian Garcia posted on social media that she will be filling in for Alicia Taylor… The post Lilian Garcia filling in for Alicia Taylor on this Monday’s WWE Raw appeared first on...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/364686-lilian-garcia-filling-in-for-alicia-taylor-on-this-mondays-wwe-raw/",
    "publishedAt": "2025-10-17T12:54:00+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE announces new dates for Raw, SmackDown and Live Holiday Tour events",
    "summary": "WWE has announced new dates for Raw, SmackDown and Holiday Tour events. The full announcement from WWE is… The post WWE announces new dates for Raw, SmackDown and Live Holiday Tour events appeared...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/364682-wwe-announces-new-dates-for-raw-smackdown-and-live-holiday-tour-events/",
    "publishedAt": "2025-10-17T12:45:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Matt Hardy Reveals The Secrets Of The Dudley Boyz’ Last Match",
    "summary": "Matt Hardy provided a detailed breakdown of The Hardy Boyz’s final match against The Dudley Boyz at TNA’s Bound For Glory pay-per-view. On his podcast, The Extreme Life of Matt Hardy, he discussed...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/matt-hardy-reveals-secrets-dudley-boyz-last-match/",
    "publishedAt": "2025-10-17T12:15:26+00:00",
    "category": "tna"
  },
  {
    "title": "WWE SmackDown Preview: Fallout From Crown Jewel, Tag Title Match",
    "summary": "WWE SmackDown airs live tonight on the USA Network in the United States and Netflix internationally, emanating from… The post WWE SmackDown Preview: Fallout From Crown Jewel, Tag Title Match appeared...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/top-story/364661-wwe-smackdown-preview-fallout-from-crown-jewel-tag-title-match/",
    "publishedAt": "2025-10-17T12:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Mercedes Mone Sets New Record In AEW",
    "summary": "Mercedes Mone has achieved another major milestone in her career, becoming the longest-reigning AEW TBS Champion in the title’s history. She has officially surpassed the inaugural champion Jade...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/mercedes-mone-sets-new-record-aew/",
    "publishedAt": "2025-10-17T10:49:48+00:00",
    "category": "aew"
  },
  {
    "title": "Full Event: NWA Clash of the Champions IX – Flair vs. Funk in an “I Quit” Match (VIDEO)",
    "summary": "The WCW YouTube Channel has posted the full NWA Clash of the Champions IX: New York Knockout event… The post Full Event: NWA Clash of the Champions IX – Flair vs. Funk in an “I Quit” Match (VIDEO)...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/364675-full-event-nwa-clash-of-the-champions-ix-flair-vs-funk-in-an-i-quit-match-video/",
    "publishedAt": "2025-10-17T03:54:28+00:00",
    "category": "general"
  },
  {
    "title": "Tony Khan comments on AEW status of Andrade El Idolo",
    "summary": "During a media call promoting AEW WrestleDream, Tony Khan was asked about the status of Andrade El Idolo… The post Tony Khan comments on AEW status of Andrade El Idolo appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/aew-news/364673-tony-khan-comments-on-aew-status-of-andrade-el-idolo/",
    "publishedAt": "2025-10-17T03:44:39+00:00",
    "category": "wwe"
  },
  {
    "title": "Backstage news on the status of Hall of Famer in WWE",
    "summary": "Fightful Select has provided details on WWE Hall of Famer Nikki Bella’s current status in the company. Per… The post Backstage news on the status of Hall of Famer in WWE appeared first on WWE News,...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/364648-backstage-news-on-the-status-of-hall-of-famer-in-wwe/",
    "publishedAt": "2025-10-17T01:58:59+00:00",
    "category": "wwe"
  },
  {
    "title": "Tony Khan addresses reports of a potential AEW training facility",
    "summary": "During a media call ahead of AEW WrestleDream, the topic of a training facility associated with the company… The post Tony Khan addresses reports of a potential AEW training facility appeared first...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/aew-news/364643-tony-khan-addresses-reports-of-a-potential-aew-training-facility/",
    "publishedAt": "2025-10-17T01:38:38+00:00",
    "category": "aew"
  },
  {
    "title": "WWF Raw Results – 10/16/95 (Bret Hart vs. Isaac Yankem in a Steel Cage Match, In Your House injury changes, Bill Watts gone)",
    "summary": "WWF Monday Night Raw ResultsOctober 16, 1995 (Taped September 25)Grand Rapids, Michigan (Civic Auditorium)Commentary: Vince McMahon and Jerry… The post WWF Raw Results – 10/16/95 (Bret Hart vs. Isaac...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/retro/364636-wwf-raw-results-october-16-1995-grand-rapids/",
    "publishedAt": "2025-10-17T01:33:18+00:00",
    "category": "wwe"
  },
  {
    "title": "TNA Tag Team Champions working without a contract, expected to sign an extension",
    "summary": "According to Fightful Select, TNA World Tag Team Knockouts Champions (Cassie Lee and Jessica McKay) The IInspiration are… The post TNA Tag Team Champions working without a contract, expected to sign...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/impact-wrestling-news/364642-tna-tag-team-champions-working-without-a-contract-expected-to-sign-an-extension/",
    "publishedAt": "2025-10-17T01:30:51+00:00",
    "category": "tna"
  },
  {
    "title": "NXT viewership up this week, key demo stays the same",
    "summary": "This week’s episode of NXT, live on the CW came in with 690,000 viewers and a 0.12 rating… The post NXT viewership up this week, key demo stays the same appeared first on WWE News, WWE Results, AEW...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/364638-nxt-viewership-up-this-week-key-demo-stays-the-same/",
    "publishedAt": "2025-10-17T01:16:08+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE NXT Viewership & Demo Revealed For 10/14 Episode",
    "summary": "WWE NXT saw an increase in viewership on October 14. According to Wrestlenomics, NXT averaged 690,000 viewers on Tuesday. The show drew a 0.12 rating in the 18 to 49 demographic. The viewership is up...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1585037-wwe-nxt-viewership-demo-revealed-for-10-14-episode",
    "publishedAt": "2025-10-16T23:59:05+00:00",
    "category": "wwe"
  }
]