[
  {
    "title": "Tito Santana Comments On WWE-AAA Acquisition, Thanks The 'New WWE'",
    "summary": "Tito Santana is happy for AAA. During WrestleMania 41 week in Las Vegas, WWE announced their acquisition of AAA, one of the top lucha libre promotions in Mexico. Since then, the crossover has been...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/tito-santana-comments-on-wwe-aaa-acquisition-thanks-the-new-wwe",
    "publishedAt": "2025-11-14T18:17:12+00:00",
    "category": "wwe"
  },
  {
    "title": "John Cena To Wrestle At WWE RAW In MSG",
    "summary": "John Cena will be competing on the upcoming episode of WWE RAW in Madison Square Garden. Following his final appearance as a wrestler in his hometown of Boston on November 10, new Intercontinental...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1590763-john-cena-to-wrestle-at-wwe-raw-in-msg",
    "publishedAt": "2025-11-14T17:40:19+00:00",
    "category": "wwe"
  },
  {
    "title": "Logan Paul: “Aligning With Paul Heyman Is The Smartest Thing That Any WWE Wrestler Can Do”",
    "summary": "Logan Paul has officially explained his decision to align with Paul Heyman and his “Vision” faction on the November 10 episode of WWE Raw. On the latest episode of his vlog, “The Maverick” spoke...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/logan-paul-aligning-paul-heyman-smartest-thing-any-wwe-wrestler-can/",
    "publishedAt": "2025-11-14T17:40:11+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE's Rey Mysterio Believes Eddie Guerrero Would Be 'Beaming With Pride' At Dominik",
    "summary": "Rey Mysterio wishes that Eddie Guerrero was still here to witness the ascent of Dominik Mysterio within WWE.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2026631/wwe-rey-mysterio-eddie-guerrero-dominik-beaming-pride/",
    "publishedAt": "2025-11-14T17:30:25+00:00",
    "category": "wwe"
  },
  {
    "title": "MVP Reveals He's Signed New Contract With AEW, Teases New Member Of Hurt Syndicate",
    "summary": "MVP confirms that he has signed a new contact with All Elite Wrestling and is open to adding a new member to The Hurt Syndicate.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2026628/aew-mvp-contract-new-member-hurt-syndicate/",
    "publishedAt": "2025-11-14T17:30:10+00:00",
    "category": "aew"
  },
  {
    "title": "Las Vegas Reportedly Paying WWE Seven-Figure Sum For WrestleMania 42 Week",
    "summary": "For the second consecutive year, WWE will hold WrestleMania 42 in Las Vegas. How much Las Vegas is paying to host WWE once more is quite the sum of money, according to reports.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2026613/wwe-wrestlemania-42-las-vegas-nevada-seven-figure-sum/",
    "publishedAt": "2025-11-14T17:20:06+00:00",
    "category": "wwe"
  },
  {
    "title": "Thea Hail Doesn't Consent To Being Creamed By Chelsea Green And Ethan Page",
    "summary": "Thea Hail sets the record straight. Night one of NXT Gold Rush is set to feature a big match for the AAA World Mixed Tag Team Championships, as Ethan Page and Chelsea Green will defend their belts...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/thea-hail-doesnt-consent-to-being-creamed-by-chelsea-green-and-ethan-page",
    "publishedAt": "2025-11-14T17:07:46+00:00",
    "category": "general"
  },
  {
    "title": "Rey Mysterio To Appear At 11/28 AAA Alianzas",
    "summary": "Rey Mysterio is set to appear at the November 28th AAA Alianzas event. Mysterio has been making appearances, both live and via video, at AAA events since the promotion was purchased by WWE in April....",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/rey-mysterio-to-appear-at-11-28-aaa-alianzas",
    "publishedAt": "2025-11-14T17:02:27+00:00",
    "category": "wwe"
  },
  {
    "title": "Former WWE Champ Kofi Kingston Explains What Made The New Day Stand Apart",
    "summary": "Kofi Kingston has discussed why fans gravitated toward The New Day and how they differed from the many other characters and groups in WWE.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2026354/wwe-kofi-kingston-new-day-stand-apart/",
    "publishedAt": "2025-11-14T17:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Frankie Kazarian Reacts To Shocking TNA World Title Win",
    "summary": "New TNA World Champion Frankie Kazarian has reacted to his massive victory. Following a four-week hiatus since Bound For Glory 2025, TNA iMPACT returned with a shocking twist as Frankie Kazarian...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1590745-frankie-kazarian-reacts-to-shocking-tna-world-title-win",
    "publishedAt": "2025-11-14T16:58:22+00:00",
    "category": "tna"
  },
  {
    "title": "TNA Impact Spoilers From November 13",
    "summary": "TNA Wrestling taped content for future episodes of TNA iMPACT on November 13 at Full Sail University in Winter Park, Florida. The spoilers, courtesy of PWInsider, are as follows: TNA Wrestling Is Set...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1590759-tna-impact-spoilers-from-november-13",
    "publishedAt": "2025-11-14T16:58:06+00:00",
    "category": "tna"
  },
  {
    "title": "WWE Signs Two New Athletes To NXT Deals",
    "summary": "WWE has officially signed two new athletes to its developmental system, PWInsiderElite.com has confirmed. Champion gymnast Jessica Bogdanov and football player Cyrus Habibi-Likio have both signed...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-signs-two-new-athletes-nxt-deals/",
    "publishedAt": "2025-11-14T16:44:40+00:00",
    "category": "wwe"
  },
  {
    "title": "Logan Paul: Aligning With Paul Heyman Is The Smartest Thing That Any WWE Wrestler Can Do",
    "summary": "Logan Paul comments on aligning with Paul Heyman. On the latest episode of his vlog, Logan Paul talked about officially aligning with Heyman and his Vision faction on the November 10 episode of WWE...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/logan-paul-paul-heyman-268769",
    "publishedAt": "2025-11-14T16:30:03+00:00",
    "category": "wwe"
  },
  {
    "title": "Booker T Doesn't Think Fans Will 'Embrace' Former WWE Star Ronda Rousey Ever Again",
    "summary": "WWE Hall of Famer Booker T has criticized former WWE star Ronda Rousey for her recent comments and questioned why she seems so bitter.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2026327/wwe-booker-t-ronda-rousey-fans-embrace/",
    "publishedAt": "2025-11-14T16:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Backstage Update On Joe Hendry's Contract Status With WWE & TNA",
    "summary": "Joe Hendry's transition from TNA to WWE has reportedly taken a significant leap, and fans should expect to see him on \"NXT\" more often.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2026554/wwe-tna-joe-hendry-contract-status/",
    "publishedAt": "2025-11-14T16:27:02+00:00",
    "category": "wwe"
  },
  {
    "title": "Booker T Calls Former AEW Star Among The 'Best Pick-Ups' Possible For WWE NXT",
    "summary": "WWE Hall of Famer Booker T believes a former AEW star has proven themselves to be a valuable asset to the \"WWE NXT\" brand.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2026553/wwe-nxt-aew-booker-t-ethan-page-best-pick-ups/",
    "publishedAt": "2025-11-14T16:26:24+00:00",
    "category": "wwe"
  },
  {
    "title": "Undertaker’s Six Feet Under podcast to air live from Washington, DC",
    "summary": "WWE Hall of Famer The Undertaker has announced that he taking his Six Feet Under podcast on the… The post Undertaker’s Six Feet Under podcast to air live from Washington, DC appeared first on WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/367074-undertakers-six-feet-under-podcast-to-air-live-from-washington-dc/",
    "publishedAt": "2025-11-14T16:19:48+00:00",
    "category": "wwe"
  },
  {
    "title": "Sami Zayn Segment Added To 11/14 WWE SmackDown",
    "summary": "Sami Zayn is set to appear on the November 14th episode of WWE SmackDown to address Solo Sikoa. Zayn is \"not medically cleared\" after being attacked by the MFTs on the October 17th episode of...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/sami-zayn-segment-added-to-11-14-wwe-smackdown",
    "publishedAt": "2025-11-14T16:07:58+00:00",
    "category": "wwe"
  },
  {
    "title": "Eric Bischoff: Chris Jericho Is ‘Constantly Playing Chess’",
    "summary": "Eric Bischoff weighed in on the recent, controversial comments from Chris Jericho, who praised a TNA Bound for Glory crowd as “WWE level” while comparing an AEW Dynamite show to “a Tony Condello...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/eric-bischoff-chris-jericho-constantly-playing-chess/",
    "publishedAt": "2025-11-14T16:00:31+00:00",
    "category": "aew"
  },
  {
    "title": "AEW Star Harley Cameron Looks Back On Marquee Match Vs. Mercedes Mone In Australia",
    "summary": "AEW's Harley Cameron has opened up about fan support for her, which she feels grew in the lead-up to her clash with Mercedes Mone at Grand Slam Australia.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2026303/aew-harley-cameron-mercedes-mone-marquee-australia/",
    "publishedAt": "2025-11-14T16:00:00+00:00",
    "category": "aew"
  },
  {
    "title": "Paul Heyman Explains What Makes Roman Reigns So Breathtaking To Watch",
    "summary": "Paul Heyman shared his thoughts on what makes Roman Reigns‘ Tribal Chief character so breathtaking to watch. Speaking on What’s Your Story? With Steph McMahon, WWE Hall of Famer Paul Heyman...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1590629-paul-heyman-why-roman-reigns-so-breathtaking",
    "publishedAt": "2025-11-14T15:57:43+00:00",
    "category": "wwe"
  },
  {
    "title": "TNA Star Announces His Plans To Retire",
    "summary": "Johnny Dango Curtis is calling it a career. Thursday’s episode of TNA Impact saw JDC, fka Fandango and Dirty Dango, announce that he will be retiring from in-ring competition in the near future....",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1590726-tna-star-announces-plans-to-retire",
    "publishedAt": "2025-11-14T15:43:38+00:00",
    "category": "tna"
  },
  {
    "title": "WWE's Seth Rollins Shares Kind Words For John Cena On Good Morning Football",
    "summary": "After John Cena captured the Intercontinental Title last Monday, Seth Rollins offered his appreciation for him during an appearance on \"Good Morning Football.\"",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2026510/wwe-seth-rollins-john-cena-kind-words/",
    "publishedAt": "2025-11-14T15:39:02+00:00",
    "category": "wwe"
  },
  {
    "title": "AJ Styles Offers Context For WWE Live Promo That Had Fans Talking",
    "summary": "WWE star AJ Styles has elaborated on his promo from a Raw commercial break, where he alleged that someone backstage didn't want him in the company.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2026294/wwe-aj-styles-context-shoot-promo/",
    "publishedAt": "2025-11-14T15:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Andrade’s WWE Non-Compete Clause May Be Worldwide",
    "summary": "New details have emerged regarding Andrade El Idolo’s status following his reported walkout from The Crash’s 14th-anniversary show in Tijuana, Mexico, on Friday, November 7. Andrade was present for...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/andrades-wwe-non-compete-clause-may-worldwide/",
    "publishedAt": "2025-11-14T15:28:49+00:00",
    "category": "wwe"
  },
  {
    "title": "Tatum Paxley Speaks About Her Rise In WWE NXT: \"It’s Just Almost Like This Indescribable Feeling\"",
    "summary": "It is an indescribable feeling for Paxley. It is coming up on a full month that Tatum Paxley has been the NXT Women's Champion. She captured the title by defeating Jacy Jayne at the Halloween Havoc...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/tatum-paxley-speaks-about-her-rise-in-wwe-nxt-its-just-almost-like-this-indescribable-feeling",
    "publishedAt": "2025-11-14T15:26:46+00:00",
    "category": "wwe"
  },
  {
    "title": "Live Episode Of “Six Feet Under With The Undertaker” Set For December 12 In Washington D.C.",
    "summary": "WWE issued the following: TICKETS FOR “SIX FEET UNDER WITH THE UNDERTAKER” IN WASHINGTON, D.C. ON SALE WEDNESDAY, NOVEMBER 19 Live Episode of “Six Feet Under with The Undertaker” Set for Friday,...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/live-episode-six-feet-under-undertaker-set-december-washington/",
    "publishedAt": "2025-11-14T15:19:19+00:00",
    "category": "wwe"
  },
  {
    "title": "Dustin Rhodes Gives Update on His In-Ring Return",
    "summary": "AEW star Dustin Rhodes has shared a new update on his recovery after undergoing double knee replacement surgery earlier this year. Dustin Rhodes lost the TNT Championship to Kyle Fletcher on the July...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1590715-aew-dustin-rhodes-in-ring-return-update",
    "publishedAt": "2025-11-14T14:58:22+00:00",
    "category": "general"
  },
  {
    "title": "WWE Is Selling A Long-Awaited Piece Of Chelsea Green Merchandise",
    "summary": "WWE has officially launched a long-requested Chelsea Green merchandise item her signature hat after years of fans asking for it. The new item, priced at $34.99, is now available on WWE Shop. Chelsea...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1590717-wwe-chelsea-green-merch-release",
    "publishedAt": "2025-11-14T14:55:12+00:00",
    "category": "wwe"
  },
  {
    "title": "Joe Hendry Officially Signs With WWE — Report",
    "summary": "Former TNA World Heavyweight Champion Joe Hendry is now officially a WWE star. Last month, TNA fans were surprised when Joe Hendry didn’t appear at Bound For Glory. Instead, he kept showing up on WWE...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1590721-joe-hendry-signs-wwe-contract",
    "publishedAt": "2025-11-14T14:55:07+00:00",
    "category": "tna"
  },
  {
    "title": "Pro Wrestling Illustrated Apologizes For Notable Omission On 2025 Women’s PWI 250",
    "summary": "Pro Wrestling Illustrated apologized after they accidentally left Hyan off the 2025 Women’s PWI 250 list. This year’s PWI list named AEW star Mercedes Moné as the No. 1 women’s wrestler, followed by...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1590719-pwi-apology-womens-250-omission-hyan",
    "publishedAt": "2025-11-14T14:48:25+00:00",
    "category": "general"
  },
  {
    "title": "Frankie Kazarian Defeats Mike Santana For TNA World Title",
    "summary": "This week’s episode of TNA Impact ended with a shocking title switch. Santana’s TNA World Title run began at Bound For Glory, where he defeated Trick Williams for the title. However, TNA went on a...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1590727-frankie-kazarian-defeats-mike-santana-for-tna-world-title",
    "publishedAt": "2025-11-14T14:45:37+00:00",
    "category": "tna"
  },
  {
    "title": "John Cena To Wrestle On Next Week’s WWE Raw",
    "summary": "John Cena has confirmed that he will wrestle one last time on Monday Night Raw. His final match on WWE’s flagship show will take place on November 17, 2025. In a statement, Cena reflected on his long...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/john-cena-wrestle-next-weeks-wwe-raw-2/",
    "publishedAt": "2025-11-14T13:33:02+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE SmackDown: Jade Cargill In Action, Last Time Is Now Tournament Matches",
    "summary": "WWE SmackDown emanates from the MVP Arena in Albany, New York, as John Cena’s farewell tour continues to dominate WWE programming. The “Last Time is Now” Tournament moves to the blue brand tonight...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-smackdown-jade-cargill-action-last-time-now-tournament-matches/",
    "publishedAt": "2025-11-14T13:10:27+00:00",
    "category": "wwe"
  },
  {
    "title": "Matt Hardy: John Cena Is The “Greatest WWE Wrestler Of All Time”",
    "summary": "On the latest episode of The Extreme Life of Matt Hardy, Matt Hardy officially declared John Cena as the greatest WWE superstar of all time, placing him above other Mount Rushmore-level names like...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/matt-hardy-john-cena-greatest-wwe-wrestler-all-time/",
    "publishedAt": "2025-11-14T12:40:46+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Veteran Wrestles At NXT Live Event",
    "summary": "WWE Raw superstar Sheamus made a surprise appearance at the NXT live event on November 13, which took place at the Roy Wilkins Auditorium in Saint Paul, Minnesota. Sheamus stepped into the ring to...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-veteran-wrestles-nxt-live-event/",
    "publishedAt": "2025-11-14T11:34:51+00:00",
    "category": "wwe"
  },
  {
    "title": "TNA Impact Spoilers: Turning Point Match Revealed, Turkey Bowl Bout",
    "summary": "TNA Wrestling taped an upcoming episode of Impact on November 13, from Full Sail University in Orlando, FL. A new match was set for the Turning Point event. The spoilers come courtesy of a report...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/tna-news/tna-impact-spoilers-turning-point-match-revealed-turkey-bowl-bout/",
    "publishedAt": "2025-11-14T11:22:54+00:00",
    "category": "tna"
  },
  {
    "title": "Updated: WWE SmackDown Preview: Sami Zayn Segment has a message for Solo Sikoa",
    "summary": "WWE has announced a new segment for tonight’s SmackDown, with Sami Zayn who has a message for Solo… The post Updated: WWE SmackDown Preview: Sami Zayn Segment has a message for Solo Sikoa appeared...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/top-story/367066-wwe-smackdown-preview-the-last-time-is-now-tournament-first-round-matches/",
    "publishedAt": "2025-11-14T08:10:00+00:00",
    "category": "wwe"
  },
  {
    "title": "TNA taping SPOILERS from Full Sail on 11/13",
    "summary": "Prior to the company’s live episode of IMPACT, TNA Wrestling taped matches at Full Sail in Winter Park,… The post TNA taping SPOILERS from Full Sail on 11/13 appeared first on WWE News, WWE Results,...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/impact-news/367065-tna-taping-spoilers-from-full-sail-on-11-13/",
    "publishedAt": "2025-11-14T04:46:15+00:00",
    "category": "wwe"
  },
  {
    "title": "TNA IMPACT Results – 11/13/25 (Live from Full Sail: World Championship and more!)",
    "summary": "This week’s TNA IMPACT results are courtesy of TNAWrestling.com: Just 24 hours before Turning Point, TNA iMPACT! is… The post TNA IMPACT Results – 11/13/25 (Live from Full Sail: World Championship...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/impact-results/367062-tna-impact-results-11-13-25-live-from-full-sail-world-championship-and-more/",
    "publishedAt": "2025-11-14T03:36:26+00:00",
    "category": "tna"
  },
  {
    "title": "Report: Former TNA World Champion signs with WWE",
    "summary": "Fightful Select has reported that Joe Hendry has signed a full-time contract to join WWE, after several appearances… The post Report: Former TNA World Champion signs with WWE appeared first on WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/367057-report-former-tna-world-champion-signs-with-wwe/",
    "publishedAt": "2025-11-14T02:46:34+00:00",
    "category": "wwe"
  },
  {
    "title": "Footage showcases WWE stars in upcoming Disney film",
    "summary": "Disney Animation Studios has released behind the scenes footage for their upcoming film Zootopia 2, featuring various cast… The post Footage showcases WWE stars in upcoming Disney film appeared first...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/367054-footage-showcases-wwe-stars-in-upcoming-disney-film/",
    "publishedAt": "2025-11-14T01:41:26+00:00",
    "category": "wwe"
  },
  {
    "title": "Rey Mysterio remembers Eddie Guerrero in letter to late WWE Hall of Famer",
    "summary": "Rey Mysterio has released a letter written to Eddie Guerrero, on the anniversary of the late WWE Hall… The post Rey Mysterio remembers Eddie Guerrero in letter to late WWE Hall of Famer appeared...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/367049-rey-mysterio-remembers-eddie-guerrero-in-letter-to-late-wwe-hall-of-famer/",
    "publishedAt": "2025-11-14T00:43:10+00:00",
    "category": "wwe"
  },
  {
    "title": "AJ Styles explains off-air WWE Raw promo",
    "summary": "In an interview with the No-Contest Wrestling podcast, AJ Styles talked about the promo he cut on the… The post AJ Styles explains off-air WWE Raw promo appeared first on WWE News, WWE Results, AEW...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/367043-aj-styles-explains-off-air-wwe-raw-promo/",
    "publishedAt": "2025-11-13T23:05:54+00:00",
    "category": "wwe"
  },
  {
    "title": "Jim Ross says he will be returning to AEW commentary ‘in the next few weeks’",
    "summary": "During his most recent Grilling JR podcast, WWE Hall of Famer and AEW broadcaster Jim Ross said that… The post Jim Ross says he will be returning to AEW commentary ‘in the next few weeks’ appeared...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/367036-jim-ross-says-he-will-returning-aew-commentary-in-the-next-few-weeks/",
    "publishedAt": "2025-11-13T19:54:10+00:00",
    "category": "wwe"
  }
]