[
  {
    "title": "Teddy Long Names Vince McMahon As One Of The Best People He Met In Wrestling",
    "summary": "Bill Apter and Teddy Long Detail Best and Worst People in Wrestling During an appearance on the “Road Trip After Hours” podcast, Bill Apter and Teddy Long discussed the best and worst people they...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/teddy-long-names-vince-mcmahon-one-best-people-met-wrestling/",
    "publishedAt": "2025-11-21T18:11:56+00:00",
    "category": "general"
  },
  {
    "title": "Shelly Martinez Says WWE Planned a ‘New Brood’ Faction For ECW",
    "summary": "Shelly Martinez says WWE had plans to form a new Brood in ECW. Speaking on The Velvet Ropes podcast, former WWE Superstar Shelly Martinez, who’s known for being Kevin Thorn’s valet, revealed WWE had...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591970-shelly-martinez-said-wwe-planned-a-new-brood-faction-for-ecw",
    "publishedAt": "2025-11-21T18:05:29+00:00",
    "category": "wwe"
  },
  {
    "title": "Aleister Black Details Original Plans In WWE With Zelina Vega",
    "summary": "Aleister Black has revealed the original plans for him and Zelina Vega in WWE. Real-life couple Alesiter Black and Zelina Vega recently paired up on WWE television. Now, speaking on the Cody Tucker...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591955-aleister-black-details-original-plans-in-wwe-with-zelina-vega",
    "publishedAt": "2025-11-21T18:03:38+00:00",
    "category": "wwe"
  },
  {
    "title": "Cody Rhodes Discusses Backlash To His January 6th Tweet, People Insisting That He's A Republican",
    "summary": "Some political conversation from Cody Rhodes. The latest episode of comedian Bert Kreischer's 'Bertcast' featured a sit-down chat with Undisputed WWE Champion Cody Rhodes. Rhodes recounted the...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/cody-rhodes-discusses-backlash-to-his-january-6th-tweet-people-insisting-that-hes-a-republican",
    "publishedAt": "2025-11-21T18:01:47+00:00",
    "category": "wwe"
  },
  {
    "title": "Santos Escobar: \"Waiting, Patiently\"",
    "summary": "A brief message from Santos. In early October, it was reported by Mike Johnson of PWInsider that WWE and Santos Escobar came to terms on a new contract. Later that month, the outlet noted that...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/santos-escobar-waiting-patiently",
    "publishedAt": "2025-11-21T17:38:30+00:00",
    "category": "wwe"
  },
  {
    "title": "The Young Bucks Were ‘Pretty Close’ To Joining WWE In 2019",
    "summary": "The Young Bucks have confirmed that they were in serious negotiations to join WWE prior to the launch of All Elite Wrestling. Speaking with Adam’s Apple ahead of AEW Full Gear, Matt and Nick Jackson...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/young-bucks-pretty-close-joining-wwe-2019/",
    "publishedAt": "2025-11-21T17:35:11+00:00",
    "category": "aew"
  },
  {
    "title": "WWE NXT Viewership & Ratings Report: 11/18/2025",
    "summary": "\"WWE NXT's\" viewership significantly improves for the first week of \"Gold Rush\" this past Tuesday.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2032665/wwe-nxt-viewership-ratings-november-18-2025/",
    "publishedAt": "2025-11-21T17:34:24+00:00",
    "category": "wwe"
  },
  {
    "title": "Bron Breakker Defeats Other WWE Stars In Contest Of Balancing A Quarter On A Lemon",
    "summary": "When prompted to balance a quarter on a lemon, only one WWE Superstar commanded and conquered this challenge. His name: Bron Breakker.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2032641/bron-breakker-wwe-stars-contest-balancing-quarter-lemon/",
    "publishedAt": "2025-11-21T17:16:10+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Shop Releases Undertaker Legacy Title For $849.99",
    "summary": "WWE Shop has released a new legacy title honoring The Undertaker and his 35 years in WWE. The title is selling for $849.99 and is limited to 475. From WWE Shop: Celebrate 35 years of The Undertaker's...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/wwe-shop-releases-undertaker-legacy-title-for-849-99",
    "publishedAt": "2025-11-21T17:09:16+00:00",
    "category": "wwe"
  },
  {
    "title": "Young Bucks Contemplated Returning As Babyfaces At AEW Dynasty, 'I Don't Know If We Can Squeeze Any More Out Of This Heel Thing'",
    "summary": "The Young Bucks nearly returned to AEW as babyfaces. At the Dynasty pay-per-view in April, the Young Bucks made their long-awaited return to AEW, ending their six-month hiatus from the promotion...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/young-bucks-contemplated-returning-as-babyfaces-at-aew-dynasty-i-dont-know-if-we-can-squeeze-any-more-out-of-this-heel-thing",
    "publishedAt": "2025-11-21T17:07:09+00:00",
    "category": "aew"
  },
  {
    "title": "Wheeler Yuta: My Godmother, She Is Not A Fan Of The Way Fans Treat Me",
    "summary": "Wheeler Yuta talks about her families reaction to him taking heat from AEW fans. Since turning heel last year and siding with The Death Riders over Bryan Danielson, Wheeler Yuta has been the...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/wheeler-yuta-my-godmother-she-is-not-a-fan-of-the-way-fans-treat-me",
    "publishedAt": "2025-11-21T17:00:00+00:00",
    "category": "aew"
  },
  {
    "title": "Tony Khan Discusses Adam Cole's AEW Hiatus",
    "summary": "AEW CEO Tony Khan has discussed whether Adam Cole, who has been out with head injuries, could potentially return to the ring.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2032359/tony-khan-adam-cole-aew-hiatus/",
    "publishedAt": "2025-11-21T17:00:00+00:00",
    "category": "aew"
  },
  {
    "title": "Young Bucks: We Want Tag Team Wrestling To Be At The Forefront Of AEW, Now Both Women And Men Get To Showcase That",
    "summary": "The Young Bucks tout the introduction of Women’s Tag Titles in AEW. The company is in the midst of a tournament that will eventually crown the inaugural Women’s Tag Team Champions. As of publish...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/young-bucks-we-want-tag-team-wrestling-to-be-at-the-forefront-of-aew-now-both-women-and-men-get-to-showcase-that",
    "publishedAt": "2025-11-21T16:42:12+00:00",
    "category": "general"
  },
  {
    "title": "Why Haku Is Universally Recognized As Wrestling’s Toughest Man",
    "summary": "The God of War: Why Haku Is Universally Recognized as Wrestling’s Toughest Man In the world of professional wrestling, the debate over who is the “toughest” legitimate fighter is a favorite topic...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/stories/why-haku-universally-recognized-wrestlings-toughest-man/",
    "publishedAt": "2025-11-21T16:33:47+00:00",
    "category": "general"
  },
  {
    "title": "Update On Contract Status Of AEW Star Anna Jay",
    "summary": "Since April 2020, Anna Jay has been a member of the All Elite Wrestling women's division, but in a matter of months, that could change.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2032604/aew-anna-jay-contract-status/",
    "publishedAt": "2025-11-21T16:25:12+00:00",
    "category": "aew"
  },
  {
    "title": "Kenny Omega credits WWE star for saving his career and inspiring AEW",
    "summary": "Ahead of Saturday’s Full Gear, AEW Executive Vice President Kenny Omega spoke with CBS Sports, not only to… The post Kenny Omega credits WWE star for saving his career and inspiring AEW appeared...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/367703-kenny-omega-credits-wwe-star-for-saving-his-career-and-inspiring-aew/",
    "publishedAt": "2025-11-21T16:24:21+00:00",
    "category": "aew"
  },
  {
    "title": "Karl Anderson Refutes Reports Of Andrade Leaving Crash Lucha Libre Show Angry",
    "summary": "On the Talk’n Shop podcast, Karl Anderson addressed reports that Andrade, the Crash Lucha Libre Heavyweight Champion, had been seen leaving a recent Tijuana show “in a heap” and angry. Anderson...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/karl-anderson-refutes-reports-andrade-leaving-crash-lucha-libre-show-angry/",
    "publishedAt": "2025-11-21T16:22:05+00:00",
    "category": "general"
  },
  {
    "title": "CM Punk Says This WWE Star Is The Future Of The Business ‘Whether I Like It Or Not’",
    "summary": "CM Punk has hailed a fellow WWE Superstar as the future of the industry, despite their ongoing feud. During a recent appearance on Barstool Sports’ Mostly Sports podcast, the current World...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591820-cm-punk-wwe-star-is-the-future-of-the-business",
    "publishedAt": "2025-11-21T16:16:12+00:00",
    "category": "wwe"
  },
  {
    "title": "Alexa Bliss Reacts To Comments About Her Recent Appearance",
    "summary": "Alexa Bliss has shared her thoughts about the comments about her recent appearance. Former WWE Women’s Champion Alexa Bliss took to X/Twitter to react to comments some fans made about her recent...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591942-alexa-bliss-reacts-comments-about-recent-appearance",
    "publishedAt": "2025-11-21T16:11:45+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW's Tony Khan Comments On Women's Blood & Guts Match, Whether There Will Be Another",
    "summary": "AEW President Tony Khan has praised the women who took part in the recent Blood and Guts match, as well revealing if there will be another one.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2032581/aew-tony-khan-women-blood-and-guts-another/",
    "publishedAt": "2025-11-21T16:08:35+00:00",
    "category": "aew"
  },
  {
    "title": "Mike Santana Explains Why He Was Late To TNA Turning Point",
    "summary": "Mike Santana pulled from his real-life experiences to explain his brief storyline absence at a TNA event last week. Santana was advertised for a tag team match at last Friday’s Turning Point live...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591957-mike-santana-why-he-was-late-tna-turning-point",
    "publishedAt": "2025-11-21T16:06:57+00:00",
    "category": "tna"
  },
  {
    "title": "Ricky Steamboat Reflects On Relationship With FTR Following AEW Dynamite Attack",
    "summary": "Wrestling legend Ricky Steamboat has discussed his recent appearance on AEW and how his relationship with FTR goes back a long way.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2032352/ricky-steamboat-reflects-relationship-ftr-aew-dynamite-attack/",
    "publishedAt": "2025-11-21T16:00:00+00:00",
    "category": "aew"
  },
  {
    "title": "Eric Bischoff Predicts Which Superstar Will Be The Next Face Of WWE",
    "summary": "As John Cena prepares for his retirement tour in 2025, Eric Bischoff has identified the superstar he believes will fill the void left by the “Doctor of Thuganomics.” While speaking with the Action...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/eric-bischoff-predicts-which-superstar-next-face-wwe/",
    "publishedAt": "2025-11-21T15:58:41+00:00",
    "category": "wwe"
  },
  {
    "title": "Matt Jackson Comments On Young Bucks Possibly Using ‘Carry On Wayward Son’ As Their Theme Music Again",
    "summary": "Young Bucks could be returning to their Kansas days. From late 2022 to early 2023, the Young Bucks and Kenny Omega used ‘Carry On Wayward Son’ as their theme music in AEW. The song was debuted by the...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/matt-jackson-comments-on-young-bucks-possibly-using-carry-on-wayward-son-as-their-theme-music-again",
    "publishedAt": "2025-11-21T15:50:27+00:00",
    "category": "aew"
  },
  {
    "title": "AEW's Tony Khan Talks Okada Returning To NJPW For Tanahashi Match At Wrestle Kingdom",
    "summary": "AEW President Tony Khan explains how the match between Kazuchika Okada and Hiroshi Tanahashi came together for NJPW Wrestle Kingdom.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2032553/tony-khan-okada-njpw-tanahashi-wrestle-kingdom/",
    "publishedAt": "2025-11-21T15:32:17+00:00",
    "category": "aew"
  },
  {
    "title": "New TNA Signee Mila Moore Has Goal In Mind To Show Up On WWE NXT: \"I Would Love To Go Back There & Be Like, This Is What You Lost Out On\"",
    "summary": "Moore said it is a 'top goal' of hers. One of the newest additions to TNA Wrestling's talent roster is Mila Moore. She was signed to the promotion during the summer of 2025 and made her official...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/new-tna-signee-mila-moore-has-goal-in-mind-to-show-up-on-wwe-nxt-i-would-love-to-go-back-there-be-like-this-is-what-you-lost-out-on",
    "publishedAt": "2025-11-21T15:30:24+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW's Tony Khan Comments On Possibility Of Another Wrestle Dynasty Heading Into 2026",
    "summary": "AEW CEO Tony Khan has discussed Wrestle Dynasty and whether the pay-per-view -- which debuted earlier this year -- will return in 2026.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2032349/aew-tony-khan-another-wrestle-dynasty-2026/",
    "publishedAt": "2025-11-21T15:30:00+00:00",
    "category": "aew"
  },
  {
    "title": "Mark Henry Pitches Ridiculous Idea For Joe Hendry To Be John Cena’s Last Match",
    "summary": "Mark Henry has a unique idea for Joe Hendry to be a part of John Cena’s last match. WWE announced the 16-man Last Time Is Now Tournament to decide John Cena’s final opponent at Saturday Night’s Main...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591934-mark-henry-ridiculous-idea-joe-hendry-john-last-match",
    "publishedAt": "2025-11-21T15:29:19+00:00",
    "category": "wwe"
  },
  {
    "title": "Frankie Kazarian’s First Challenge for TNA World Title Set For Final Resolution",
    "summary": "TNA Impact confirmed the new number one contender for Frankie Kazarian’s TNA World Title at Final Resolution. On TNA Impact, Frankie Kazarian had a heated backstage confrontation with JDC. The...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591909-major-name-confirmed-tna-world-title-final-resolution",
    "publishedAt": "2025-11-21T15:27:08+00:00",
    "category": "tna"
  },
  {
    "title": "Mila Moore Details Signing With TNA, Was Originally Supposed To Debut At Post-Turning Point TV Taping",
    "summary": "The new signee speaks about her journey to TNA. It was over the summer of 2025 that TNA Wrestling offered contracts to Mila Moore and Jada Stone after their singles match for a taping of TNA...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/mila-moore-details-signing-with-tna-was-originally-supposed-to-debut-at-post-turning-point-tv-taping",
    "publishedAt": "2025-11-21T15:16:00+00:00",
    "category": "tna"
  },
  {
    "title": "AEW Full Gear 2025 Predictions: Wrestling Inc. Picks The Winners",
    "summary": "AEW Full Gear 2025 comes your way this weekend from Newark, New Jersey, and as always, Wrestling Inc. is here to pick the winners of every match!",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2032342/aew-full-gear-2025-predictions-wrestling-inc-picks-winners/",
    "publishedAt": "2025-11-21T15:00:00+00:00",
    "category": "aew"
  },
  {
    "title": "Shelly Martinez Reveals Details Of Scrapped “New Brood” Faction In WWE",
    "summary": "Former WWE and TNA star Shelly Martinez recently joined “The Velvet Ropes with SoCal Val” for an exclusive interview. During the discussion, Martinez provided new details about a planned WWE faction...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/shelly-martinez-reveals-details-scrapped-new-brood-faction-wwe/",
    "publishedAt": "2025-11-21T14:50:29+00:00",
    "category": "wwe"
  },
  {
    "title": "Saraya Responds To Claims She Is Begging For WWE Return",
    "summary": "Saraya has addressed recent fan criticism regarding her potential return to WWE. Speaking to The Toronto Sun, the wrestling veteran rebutted claims that she has been publicly campaigning for a job...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/saraya-responds-claims-she-begging-wwe-return/",
    "publishedAt": "2025-11-21T14:49:06+00:00",
    "category": "wwe"
  },
  {
    "title": "Bully Ray Hopes Maxxine Dupri's Title Win Leads To A Rivalry With This WWE Star",
    "summary": "WWE legend Bully Ray has commented on Maxxine Dupri's win, praising the growth she has shown in the ring and discussing whom she could face next.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2032340/wwe-bully-ray-maxxine-dupri-natalya-rivalry/",
    "publishedAt": "2025-11-21T14:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "11/22 AAA Alianzas event to air live for free on YouTube",
    "summary": "The AAA Alianzas event taking place Saturday night at Arena CDMX in Mexico City, will air live for… The post 11/22 AAA Alianzas event to air live for free on YouTube appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/367697-11-22-aaa-alianzas-event-to-air-live-for-free-on-youtube/",
    "publishedAt": "2025-11-21T14:22:39+00:00",
    "category": "wwe"
  },
  {
    "title": "Trish Stratus Doubted Working WWE Evolution Due To Her Mother’s Health",
    "summary": "WWE Hall of Famer Trish Stratus looked back on her mother’s passing and reflected on her decision to wrestle at Evolution 2025. In an interview with Bill Apter, Trish Stratus explained what she was...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591914-trish-stratus-unsure-wwe-ple-mothers-health",
    "publishedAt": "2025-11-21T14:15:02+00:00",
    "category": "wwe"
  },
  {
    "title": "NXT viewership and key demo up for Gold Rush Week One Special",
    "summary": "This past Tuesday’s NXT Gold Rush Week One Special, live on the CW came in with 650,000 viewers… The post NXT viewership and key demo up for Gold Rush Week One Special appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/367693-nxt-viewership-and-key-demo-up-for-gold-rush-week-one-special/",
    "publishedAt": "2025-11-21T14:11:43+00:00",
    "category": "wwe"
  },
  {
    "title": "Top AEW Star Could Be Close To Free Agency – Report",
    "summary": "A new report says Anna Jay’s AEW contract is set to expire in the next few months. According to Fightful Select, many within the company believe Anna Jay’s deal is coming up soon, and AEW is expected...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591919-major-aew-star-contract-expiring-soon",
    "publishedAt": "2025-11-21T14:11:23+00:00",
    "category": "aew"
  },
  {
    "title": "WWE SmackDown Preview: The Last Time Is Now Tournament, More!",
    "summary": "WWE SmackDown airs live tonight on the USA Network in the United States and Netflix Internationally, from the… The post WWE SmackDown Preview: The Last Time Is Now Tournament, More! appeared first on...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/top-story/367686-wwe-smackdown-preview-the-last-time-is-now-tournament-more/",
    "publishedAt": "2025-11-21T14:02:09+00:00",
    "category": "wwe"
  },
  {
    "title": "Nick Jackson: Chris Jericho Is “A Founding Father. So Of Course We Want Him To Stay” In AEW",
    "summary": "The Young Bucks have commented on the uncertainty surrounding Chris Jericho’s future with All Elite Wrestling. Speaking with Adam’s Apple ahead of Full Gear, Matt and Nick Jackson addressed rumors...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/nick-jackson-chris-jericho-founding-father-course-want-him-stay-aew/",
    "publishedAt": "2025-11-21T13:24:40+00:00",
    "category": "aew"
  },
  {
    "title": "Mark Henry: It Is ‘Impossible’ For WWE Not To Use Matt Cardona And Nic Nemeth Again",
    "summary": "Mark Henry believes WWE would be making a mistake if it did not bring back Matt Cardona and Nic Nemeth full-time. Both former champions recently appeared for WWE, with Cardona on NXT and SmackDown,...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/mark-henry-impossible-wwe-not-use-matt-cardona-nic-nemeth-again/",
    "publishedAt": "2025-11-21T13:12:05+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE SmackDown Preview: ‘Last Time Is Now’ Tournament Continues, Chelsea Green Celebrates",
    "summary": "WWE Friday Night SmackDown takes place tonight from the Ball Arena in Denver, Colorado, continuing the build toward Survivor Series: WarGames. With just eight days remaining until John Cena defends...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-smackdown-preview-last-time-now-tournament-continues-chelsea-green-celebrates/",
    "publishedAt": "2025-11-21T12:55:35+00:00",
    "category": "wwe"
  },
  {
    "title": "TNA IMPACT Results – 11/20/25 (Fallout From Turning Point)",
    "summary": "TNA Wrestling IMPACT results are courtesy of tnawrestling.com. We kick things off with the former TNA World Champion,… The post TNA IMPACT Results – 11/20/25 (Fallout From Turning Point) appeared...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/impact-news/367681-tna-impact-results-11-20-25-fallout-from-turning-point/",
    "publishedAt": "2025-11-21T04:55:00+00:00",
    "category": "tna"
  },
  {
    "title": "Three major entities make bids for AEW’s media right partner",
    "summary": "According to The Hollywood Reporter, Paramount, Comcast and Netflix have each submitted bids for some or all of Warner Bros. Discovery on Thursday,… The post Three major entities make bids for AEW’s...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/aew-news/367669-three-bids-made-from-major-entities-for-aews-media-right-partner/",
    "publishedAt": "2025-11-21T04:54:21+00:00",
    "category": "aew"
  },
  {
    "title": "CW comments on Nielsen changes affecting WWE NXT viewership data",
    "summary": "Wrestlenomics has reported that wrestling viewership has taken a noticeable dip since the rollout on Nielsen’s Big Data… The post CW comments on Nielsen changes affecting WWE NXT viewership data...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/367670-cw-comments-on-nielsen-changes-affecting-wwe-nxt-viewership-data/",
    "publishedAt": "2025-11-21T04:49:40+00:00",
    "category": "wwe"
  },
  {
    "title": "Report: Contract for AEW talent set to expire soon",
    "summary": "According to Fightful Select, an AEW source has indicated that Anna Jay’s contract with the company is believed… The post Report: Contract for AEW talent set to expire soon appeared first on WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/aew-news/367661-report-contract-for-aew-talent-set-to-expire-soon/",
    "publishedAt": "2025-11-21T04:11:21+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE couple reveals timeframe for upcoming wedding",
    "summary": "In an interview with TV Insider, Kelani Jordan revealed that she and Carmelo Hayes are preparing to have… The post WWE couple reveals timeframe for upcoming wedding appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/367658-wwe-couple-reveals-timeframe-for-upcoming-wedding/",
    "publishedAt": "2025-11-21T01:41:49+00:00",
    "category": "wwe"
  }
]