[
  {
    "title": "NXT Champion Says TNA Put Them On The Map As A Singles Wrestler",
    "summary": "A current NXT Champion has credited TNA Wrestling for putting her on the map as a singles performer. Reigning NXT Women’s Champion Jacy Jayne appeared on the Battleground Podcast and addressed her...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586234-nxt-champion-says-tna-put-them-on-the-map-as-a-singles-wrestler",
    "publishedAt": "2025-10-23T18:08:01+00:00",
    "category": "general"
  },
  {
    "title": "TJ Charles: It Wasn't Luck That Zozaya Got Signed, He Put In The Hours And It's Completely 100% Deserved",
    "summary": "TJ Charles says that Zozaya has earned his way to signing with WWE. Earlier this year, prior to WrestleMania, WWE would host European tryouts in London that featured several pro wrestlers. Coming out...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/tj-charles-it-wasnt-luck-that-zozaya-got-signed-he-put-in-the-hours-and-its-completely-100-deserved",
    "publishedAt": "2025-10-23T18:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "What These Famous 80s Wrestlers Are Doing Today",
    "summary": "From the convention circuit to continued appearances with WWE, many of the most famous wrestlers from the 1980s are still working today.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2004389/what-famous-80s-wrestlers-doing-today/",
    "publishedAt": "2025-10-23T18:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Backstage News On Liv Morgan’s Expected WWE Return Timeline",
    "summary": "There is an update on the status of injured WWE star Liv Morgan, according to a report from PWInsiderElite.com. Morgan has been out of action since suffering a separated shoulder earlier this year....",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/backstage-news-liv-morgans-expected-wwe-return-timeline/",
    "publishedAt": "2025-10-23T17:47:29+00:00",
    "category": "wwe"
  },
  {
    "title": "TNA World Champion Mike Santana vs. Sheldon Jean Added To MLP's 10/27 Event",
    "summary": "The TNA Champion is making his debut. On the docket for Scott D'Amore's Maple Leaf Pro Wrestling promotion is their October 27th show titled 'Reena Rumble.' It is taking place in Toronto, Ontario,...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/tna-world-champion-mike-santana-vs-sheldon-jean-added-to-mlps-10-27-event",
    "publishedAt": "2025-10-23T17:44:25+00:00",
    "category": "general"
  },
  {
    "title": "Scott D’Amore Explains Why CM Punk Winning The World Title Would Be A Mistake",
    "summary": "Scott D’Amore assesses the upcoming WWE World Heavyweight Championship match between Jey Uso and CM Punk. Due to a shoulder injury, Seth Rollins relinquished the WWE World Heavyweight Championship...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586222-scott-damore-explains-why-cm-punk-winning-the-world-title-would-be-a-mistake",
    "publishedAt": "2025-10-23T17:43:44+00:00",
    "category": "general"
  },
  {
    "title": "Billy Dixson Says A Current NXT Writer Told Him To Be A Wrestler That Happens To Be Gay As Opposed To A Gay Wrestler",
    "summary": "Billy Dixson reveals some baffling advice that he received from someone in NXT. Responding to a question prompt on social media, the 30 year old independent star revealed that a current writer for...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/billy-dixson-says-a-current-nxt-writer-told-him-to-be-a-wrestler-that-happens-to-be-gay-as-opposed-to-a-gay-wrestler",
    "publishedAt": "2025-10-23T17:38:32+00:00",
    "category": "wwe"
  },
  {
    "title": "D-Von Dudley: ‘I Just Don’t Like The Way’ AEW Is Run",
    "summary": "WWE Hall of Famer D-Von Dudley recently completed his in-ring retirement tour, culminating in a match alongside Bubba Ray Dudley against The Hardys at TNA Bound For Glory. In an interview with Video...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/von-dudley-just-dont-like-way-aew-run/",
    "publishedAt": "2025-10-23T17:37:28+00:00",
    "category": "tna"
  },
  {
    "title": "WWE SmackDown viewership and key demo up for Crown Jewel fallout",
    "summary": "According to Programming Insider, last Friday’s episode of WWE SmackDown, live on the USA Network came in with… The post WWE SmackDown viewership and key demo up for Crown Jewel fallout appeared...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/365227-wwe-smackdown-viewership-and-key-demo-up-for-crown-jewel-fallout/",
    "publishedAt": "2025-10-23T17:25:41+00:00",
    "category": "wwe"
  },
  {
    "title": "NJPW Super Junior Tag League 2025 Standings And Results Archive",
    "summary": "New Japan Pro-Wrestling kicked off its NJPW Super Junior Tag League tournament on October 23. The event runs through November 2nd where the finals will be held at Hiroshi Tanahashi Final Homecoming....",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/njpw-super-junior-tag-league-2025-standings-and-results-archive",
    "publishedAt": "2025-10-23T17:21:17+00:00",
    "category": "njpw"
  },
  {
    "title": "Kurt Angle Shares Key Role Vince McMahon Played In His Success In WWE",
    "summary": "Kurt Angle has revealed the vital role Vince McMahon played in the development of his character in WWE and its success. Speaking on the Ariel Helwani Show, WWE Hall of Famer and Olympic Gold Medalist...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586226-kurt-angle-shares-key-role-vince-mcmahon-played-in-his-success-in-wwe",
    "publishedAt": "2025-10-23T17:10:15+00:00",
    "category": "wwe"
  },
  {
    "title": "AJ Styles Reflects On WWE Crown Jewel Match With John Cena",
    "summary": "Reflecting on their WWE Crown Jewel match in a recent interview, SAJ tyles shared what he really thinks of John Cena following their final rivalry.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2005387/aj-styles-wwe-crown-jewel-match-john-cena/",
    "publishedAt": "2025-10-23T17:06:40+00:00",
    "category": "wwe"
  },
  {
    "title": "Willow Nightingale And Harley Cameron Reveal Tag Team Name",
    "summary": "Willow Nightingale and Harley Cameron are bringing the wrath. In a social exclusive, Nightingale and Cameron attempted to come up with their tag team name before the start of the AEW Women’s Tag Team...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/willow-nightingale-and-harley-cameron-reveal-tag-team-name",
    "publishedAt": "2025-10-23T17:00:58+00:00",
    "category": "aew"
  },
  {
    "title": "Former WWE Writer Reveals Charles Manson Wanted To Meet Bray Wyatt, WWE 'Immediately' Shut Idea Down",
    "summary": "Stories about the late Windham Rotunda. The newest episode of Freddie Prinze Jr.'s Wrestling with Freddie podcast featured former WWE writer Nick Manfredini. Manfredini worked closely with the late...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/former-wwe-writer-reveals-charles-manson-wanted-to-meet-bray-wyatt-wwe-immediately-shut-idea-down",
    "publishedAt": "2025-10-23T16:55:26+00:00",
    "category": "wwe"
  },
  {
    "title": "Karrion Kross Addresses Whether Post-Mania Rant Affected WWE Contract Negotiations",
    "summary": "Karrion Kross addresses whether or not his viral post-WrestleMania rant affected his contract negotiations with WWE in the months that followed",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2005366/wwe-wrestlemania-karrion-kross-viral-rant-contract-negotiations/",
    "publishedAt": "2025-10-23T16:52:22+00:00",
    "category": "wwe"
  },
  {
    "title": "Jelly Roll Says His Dream Scenario Is To Have A Six To Nine Month Run In WWE",
    "summary": "Jelly Roll caught the wrestling bug at WWE SummerSlam, making his in-ring debut in a tag team match alongside Randy Orton against Logan Paul and Drew McIntyre. While it is unknown when he will return...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/jelly-roll-says-his-dream-scenario-is-to-have-a-six-to-nine-month-run-in-wwe",
    "publishedAt": "2025-10-23T16:39:58+00:00",
    "category": "wwe"
  },
  {
    "title": "RAW GM Adam Pearce Teases Having Some Fun In Match With SmackDown Star",
    "summary": "WWE Raw General Manager Adam Pearce has teased an interesting match with a SmackDown star. During a recent appearance on Gorilla Position, Raw General Manager and former five-time NWA World’s...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586209-raw-gm-adam-pearce-teases-fun-match-with-smackdown-star",
    "publishedAt": "2025-10-23T16:29:13+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE's Naomi Shares Sonogram In Which Baby Appears To Be Imitating Uncle Jey Uso",
    "summary": "Naomi's baby is seen \"yeeting\" in recent photo from her sonogram this week.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2005337/wwe-naomi-sonogram-baby-imitating-jey-uso-yeet/",
    "publishedAt": "2025-10-23T16:25:14+00:00",
    "category": "wwe"
  },
  {
    "title": "D-Von Dudley Claims A ‘Higher Up’ Said He Didn’t Like Him Due To The Color Of His Skin",
    "summary": "WWE Hall of Famer D-Von Dudley opens up about a major challenge he endured during his original run in WWE. Inside the ring, D-Von Dudley is widely regarded as one of the best tag team wrestlers of...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586207-d-von-dudley-claims-higher-up-didnt-like-him-color-of-skin",
    "publishedAt": "2025-10-23T16:08:22+00:00",
    "category": "wwe"
  },
  {
    "title": "Bishop Dyer Recalls Initial Reaction To MLW Reviving Classic Name",
    "summary": "Bishop Dyer and Donovan Dijak are dominating MLW’s Tag Team division as The Skyscrapers. The name is well-known to longtime wrestling fans as a team in WCW. The team saw Sid Vicious and Dan Spivey...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584980-bishop-dyer-recalls-initial-reaction-to-mlw-reviving-classic-name",
    "publishedAt": "2025-10-23T15:53:43+00:00",
    "category": "general"
  },
  {
    "title": "Scott D'Amore: WWE Cutting Wes Lee Was A Mistake, Watch For Him To Prove That Very Soon",
    "summary": "Scott D'Amore talks Wes Lee's release. On Friday, October 10, Wes Lee was released from WWE alongside other names like Stevie Turner, Lance Anoa’i, Jin Tala, and Drako Knox. The departure came as a...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/scott-damore-wes-lee-wwe-263977",
    "publishedAt": "2025-10-23T15:52:03+00:00",
    "category": "wwe"
  },
  {
    "title": "D-Von Dudley: I’ve Had Three Meetings With Tony Khan “And All Three Were A Bust”",
    "summary": "Following his departure from a backstage role in WWE in 2023, D-Von Dudley explored potential opportunities elsewhere, including discussions with AEW President Tony Khan. However, Dudley revealed in...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/von-dudley-ive-had-three-meetings-tony-khan-all-three-bust/",
    "publishedAt": "2025-10-23T15:41:29+00:00",
    "category": "aew"
  },
  {
    "title": "Jelly Roll Reveals Original Pitch For Him To Win SummerSlam Match",
    "summary": "Jelly Roll recalls the original plans for him at WWE SummerSlam 2025. Unlike most celebrities, Jelly Roll marked his WWE in-ring debut with a loss, courtesy of a Frog Splash from Logan Paul at WWE...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586193-jelly-roll-reveals-original-pitch-for-him-to-win-summerslam-match",
    "publishedAt": "2025-10-23T15:31:05+00:00",
    "category": "wwe"
  },
  {
    "title": "Zaria Reflects On One Year With WWE, Upcoming Singles PLE Debut At NXT Halloween Havoc",
    "summary": "Ahead of her match at WWE NXT Halloween Havoc this weekend, Zaria took to social media to look back on her first year with the company.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2005258/zaria-one-year-wwe-singles-ple-debut-halloween-havoc/",
    "publishedAt": "2025-10-23T15:30:12+00:00",
    "category": "wwe"
  },
  {
    "title": "ESPN Saw A Spike In Sign-ups From WWE Wrestlepalooza",
    "summary": "During a recent episode of the SBJ Sports Media Podcast featuring John Ourand of Puck News and Andrew Marchand of The Athletic, WWE’s recent Wrestlepalooza event was mentioned as a positive driver...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/espn-unlimited-saw-spike-sign-ups-wwe-wrestlepalooza/",
    "publishedAt": "2025-10-23T15:24:24+00:00",
    "category": "wwe"
  },
  {
    "title": "D-Von Dudley: Tony Khan Pushed Me To Wrestle For AEW, Wouldn’t Take No For An Answer",
    "summary": "D-Von Dudley says he reached out to AEW for a producer’s role, but Tony Khan had other plans for him. Dudley recently spoke with Video Gamer, who asked how many times AEW had contacted him to try to...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586199-d-von-dudley-tony-khan-pushed-me-to-wrestle-for-aew",
    "publishedAt": "2025-10-23T15:22:55+00:00",
    "category": "aew"
  },
  {
    "title": "Former AEW Star Is Now Working As Car Salesman",
    "summary": "Retired former AEW star Marko Stunt has embarked on a new career path following his time in professional wrestling. Stunt, whose real name is Noah Nelms, is now working as a car salesman. He is...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/former-aew-star-now-working-car-salesman/",
    "publishedAt": "2025-10-23T15:21:01+00:00",
    "category": "aew"
  },
  {
    "title": "AEW Women's Division Throws Surprise Backstage Birthday Party For Timeless Toni Storm",
    "summary": "Led by Queen Aminata and Mina Shirakawa, the AEW Women's division threw a surprise birthday party for Timeless Toni Storm and Karen Jarrett last week",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2005247/aew-womens-division-surprise-backstage-birthday-party-timeless-toni-storm/",
    "publishedAt": "2025-10-23T15:18:59+00:00",
    "category": "aew"
  },
  {
    "title": "Goldberg Throws Shade At WWE For Letting ‘Some Girl’ Break His Win Streak Record",
    "summary": "Goldberg still isn’t pleased with his record being shattered. Amongst Goldberg’s most memorable accomplishments is his undefeated streak, which spanned a reported 173 wins in WCW. Fast forward to the...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586183-goldberg-throws-shade-wwe-asuka-break-win-streak-record",
    "publishedAt": "2025-10-23T15:04:22+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Wrestlepalooza Results In Massive Spike In ESPN Subscribers",
    "summary": "It sounds like WWE Wrestlepalooza is one of the factors in ESPN’s new app finding early success. This week’s episode of the Sports Business Journal’s The Sports Media Podcast featured host and SBJ...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586192-wwe-wrestlepalooza-massive-spike-in-espn-subscribers",
    "publishedAt": "2025-10-23T15:03:13+00:00",
    "category": "wwe"
  },
  {
    "title": "Jelly Roll: “I Will Wrestle Again”",
    "summary": "Country music star Jelly Roll has confirmed his intention to step back into a WWE ring following his in-ring debut at SummerSlam this past August. The longtime wrestling fan, who teamed with Randy...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/jelly-roll-wrestle-again/",
    "publishedAt": "2025-10-23T14:38:14+00:00",
    "category": "wwe"
  },
  {
    "title": "AJ Lee Explains WWE Absence Since Wrestlepalooza, Promises Becky Lynch She'll Be Back",
    "summary": "AJ Lee shares update on her recent hiatus from the ring on social media, claims that she's coming for Becky Lynch's Women's Intercontinental Championship.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2005206/aj-lee-wwe-absence-wrestlepalooza-becky-lynch/",
    "publishedAt": "2025-10-23T14:35:14+00:00",
    "category": "general"
  },
  {
    "title": "Kevin Nash Loved This WWE Raw Detail Leading Up To The Vision Attacking Seth Rollins",
    "summary": "As The Vision turned on Seth Rollins during an episode of \"WWE Raw\" earlier this month, one detail stood out to Kevin Nash and helped elevate the segment.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2005142/kevin-nash-loved-wwe-raw-detail-leading-vision-attacking-seth-rollins/",
    "publishedAt": "2025-10-23T13:21:24+00:00",
    "category": "wwe"
  },
  {
    "title": "Backstages News On Expected Return Timeline For Injured AEW Star Swerve Strickland",
    "summary": "Swerve Strickland has been off TV after getting surgery on his injured meniscus, and a new backstage report sheds light on when he may return to AEW.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2005132/expected-return-timeline-injured-aew-star-swerve-strickland/",
    "publishedAt": "2025-10-23T13:10:00+00:00",
    "category": "aew"
  },
  {
    "title": "Kurt Angle Reveals Key Role Vince McMahon Played In His WWE Success",
    "summary": "Kurt Angle recently credited former WWE Chairman Vince McMahon for the development of his on-screen character. Despite Angle’s real-life heroic background, a specific character direction from McMahon...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/kurt-angle-reveals-key-role-vince-mcmahon-played-his-wwe-success/",
    "publishedAt": "2025-10-23T13:03:48+00:00",
    "category": "wwe"
  },
  {
    "title": "The Rock Addresses Inauthentic Part Of Early WWE Character, Vince McMahon's Direction",
    "summary": "The Rock talks about his match at WrestleMania 13 and why his early WWE character, directed by Vince McMahon, felt inauthentic to who he was.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2001637/wwe-rock-inauthentic-smile-vince-mcmahon/",
    "publishedAt": "2025-10-23T12:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Jelly Roll Reveals Triple H’s Condition For Him To Have WWE Match",
    "summary": "After delivering a chokeslam to Austin Theory at WWE SummerSlam 2024, Jelly Roll immediately sought out WWE Chief Content Officer Triple H backstage to share his desire to compete in a match....",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/jelly-roll-reveals-triple-condition-him-have-wwe-match/",
    "publishedAt": "2025-10-23T12:20:10+00:00",
    "category": "wwe"
  },
  {
    "title": "Nigel McGuinness: My AEW Contract Was “Re-Upped When It Became Clear That I Was Gonna Be Wrestling Again”",
    "summary": "AEW commentator and occasional wrestler Nigel McGuinness recently clarified his contract status with the company, particularly regarding his dual role. McGuinness serves as part of the commentary...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/nigel-mcguinness-aew-contract-upped-when-became-clear-gonna-wrestling-again/",
    "publishedAt": "2025-10-23T12:19:18+00:00",
    "category": "general"
  },
  {
    "title": "Jelly Roll Explains Why He Requested To Lose In His WWE Debut",
    "summary": "Unlike many celebrities who participate in wrestling matches, Jelly Roll actively pushed to lose his debut tag team match at WWE SummerSlam, where he and Randy Orton lost to Logan Paul and Drew...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/jelly-roll-explains-why-requested-lose-his-wwe-debut/",
    "publishedAt": "2025-10-23T10:50:00+00:00",
    "category": "wwe"
  },
  {
    "title": "CMLL and Stardom announce partnership",
    "summary": "On the most recent edition of CMLL Informa, Taro Okada of Stardom and Kounosuke Izui Lady’s Ring made… The post CMLL and Stardom announce partnership appeared first on WWE News, WWE Results, AEW...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/misc-news/365224-cmll-and-stardom-announce-partnership/",
    "publishedAt": "2025-10-23T06:48:23+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW Collision SPOILERS: Matches taped 10/22 to air 10/25",
    "summary": "AEW taped this Saturday’s episode of Collision at Boeing Tech Port in San Antonio, Texas after Dynamite went… The post AEW Collision SPOILERS: Matches taped 10/22 to air 10/25 appeared first on WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/aew-news/365211-aew-collision-spoilers-matches-taped-10-22-to-air-10-25/",
    "publishedAt": "2025-10-23T04:12:42+00:00",
    "category": "aew"
  },
  {
    "title": "Update on the status of former AEW Champion",
    "summary": "According to a new report from Fightful Select, the hope within AEW over this past weekend, is that… The post Update on the status of former AEW Champion appeared first on WWE News, WWE Results, AEW...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/aew-news/365196-update-on-the-status-of-former-aew-champion/",
    "publishedAt": "2025-10-23T01:37:45+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW Dynamite Results – 10/22/25 (WrestleDream Fallout)",
    "summary": "AEW Dynamite ResultsOctober 22, 2025San Antonio, Texas (Boeing Center at Tech Port)Results by: Alex Kahrs of Wrestleview.com It… The post AEW Dynamite Results – 10/22/25 (WrestleDream Fallout)...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/top-story/365163-aew-dynamite-results-10-22-25-wrestledream-fallout/",
    "publishedAt": "2025-10-23T00:00:00+00:00",
    "category": "aew"
  },
  {
    "title": "Former WWE champion reveals ‘Yeeting’ ultrasound in new update",
    "summary": "Naomi shared an update on her pregnancy via social media, revealing her child ‘Yeeting’ at sixteen weeks. The… The post Former WWE champion reveals ‘Yeeting’ ultrasound in new update appeared first...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/365160-former-wwe-champion-reveals-yeeting-ultrasound-in-new-update/",
    "publishedAt": "2025-10-22T23:54:47+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Hall of Famer feels like ‘a doting uncle’ with success of Cody Rhodes",
    "summary": "During an appearance on Busted Open Radio, Arn Anderson was asked it was like as a viewer to… The post WWE Hall of Famer feels like ‘a doting uncle’ with success of Cody Rhodes appeared first on WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/365156-wwe-hall-of-famer-feels-like-a-doting-uncle-with-success-of-cody-rhodes/",
    "publishedAt": "2025-10-22T23:24:57+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE releases behind-the-scenes video of AJ Styles saying goodbye to Japan",
    "summary": "WWE has released a new video, taking a behind-the-scenes look at AJ Styles saying goodbye to Japan. Last… The post WWE releases behind-the-scenes video of AJ Styles saying goodbye to Japan appeared...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/365149-wwe-releases-behind-the-scenes-video-of-aj-styles-saying-goodbye-to-japan/",
    "publishedAt": "2025-10-22T20:11:18+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW coach and producer announces he’s engaged",
    "summary": "AEW coach and producer Scott Garland announced on social media, he is engaged. Garland is best known from… The post AEW coach and producer announces he’s engaged appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/aew-news/365143-aew-coach-and-producer-announces-hes-engaged/",
    "publishedAt": "2025-10-22T19:57:52+00:00",
    "category": "wwe"
  }
]