[
  {
    "title": "Ex-WWE Star Disappointed Over Release: I Always Thought Triple H Believed in Me",
    "summary": "Professional wrestling is a competitive and unpredictable business. From time to time, the talent might get let go from the promotion for various reasons. There are times when the wrestlers...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1581422-ex-wwe-star-disappointed-over-release-i-always-thought-triple-h-believed-in-me",
    "publishedAt": "2025-09-26T17:58:06+00:00",
    "category": "general"
  },
  {
    "title": "Ryback Calls Brock Lesnar The ‘Perfect Guy’ To End The Undertaker’s WrestleMania Streak",
    "summary": "Ryback has weighed in on one of pro wrestling’s most notorious questions concerning Brock Lesnar and The Undertaker. On a recent episode of his Six Feet Under podcast, The Undertaker reflected on the...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1581418-ryback-calls-brock-lesnar-the-perfect-guy-to-end-the-undertakers-wrestlemania-streak",
    "publishedAt": "2025-09-26T17:53:05+00:00",
    "category": "general"
  },
  {
    "title": "The Miz Was Surprised By CM Punk’s Apology, Says He Seems Very Happy",
    "summary": "One of the veterans in the wrestling business is former WWE World Champion The Miz. A couple of years ago, the Second City Saint CM Punk was present outside an arena during one of WWE’s Monday Night...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1581426-the-miz-was-surprised-by-cm-punks-apology-says-he-seems-very-happy",
    "publishedAt": "2025-09-26T17:48:43+00:00",
    "category": "general"
  },
  {
    "title": "Report: Drew McIntyre To Join Fellow WWE Name On Cast Of Highlander Reboot",
    "summary": "Former WWE Champion Drew McIntyre will reportedly join another WWE-related name on the set of the \"Highlander\" reboot.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1979510/wwe-drew-mcintyre-highlander-angus-macleod-henry-cavill-dave-bautista/",
    "publishedAt": "2025-09-26T17:45:27+00:00",
    "category": "wwe"
  },
  {
    "title": "Update on What WWE Offered Jazmyn Nyx and Current NXT Pay Rate",
    "summary": "Reports have revealed the details of the new contract offered to Jazmyn Nyx on WWE NXT. Jazmyn Nyx is set to leave WWE NXT after rejecting a new contract offer. This week, she was written out of the...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1581429-wwe-offer-jazmyn-nyx-nxt-pay-update",
    "publishedAt": "2025-09-26T17:45:06+00:00",
    "category": "wwe"
  },
  {
    "title": "Booker T Offers to Fill in for Injured Corey Graves After Brock Lesnar Attack",
    "summary": "Booker T is ready to step in for commentary after Brock Lesnar attacked Corey Graves. On the 19th September edition of WWE SmackDown, Brock Lesnar attacked commentator Corey Graves. The incident...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1581447-booker-t-fills-in-corey-graves-brock-lesnar-attack",
    "publishedAt": "2025-09-26T17:44:36+00:00",
    "category": "wwe"
  },
  {
    "title": "Eric Bischoff: Hulk Hogan Nixed Biopic To Avoid An ‘Off-Balance Relationship With WWE’",
    "summary": "On a recent episode of his 83 Weeks podcast, Eric Bischoff provided the definitive inside story on why the highly anticipated Hulk Hogan biopic, which was set to star Chris Hemsworth, was ultimately...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/eric-bischoff-hulk-hogan-nixed-biopic-avoid-off-balance-relationship-wwe/",
    "publishedAt": "2025-09-26T17:43:47+00:00",
    "category": "wwe"
  },
  {
    "title": "The Rock Claims a Top UFC Champion Would Be a Great WWE Performer",
    "summary": "Last week, UFC Heavyweight Champion Tom Aspinall shared his experience when he attended a WWE show via Kiss Xtra. He also shared that he wanted to have a match with The Rock. “I went to a WWE (show)...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1581420-the-rock-claims-a-top-ufc-champion-would-be-a-great-wwe-performer",
    "publishedAt": "2025-09-26T17:43:39+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE HOFer Kevin Nash Reportedly Underwent Minor Heart Procedure This Week",
    "summary": "After some reported health concerns, WWE Hall of Famer Kevin Nash underwent a successful heart procedure earlier this week.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1979495/wwe-kevin-nash-heart-procedure/",
    "publishedAt": "2025-09-26T17:38:36+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE SmackDown Announcer Mark Nash Explains Why He Doesn't Want To Know Match Results In Advance",
    "summary": "New WWE SmackDown ring announcer Mark Nash explains why he prefers a spoiler-free viewing experience of the WWE shows he announces. Mark Nash is the latest voice of WWE Friday Night SmackDown. He...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/wwe-smackdown-announcer-mark-nash-explains-why-he-doesnt-want-to-know-match-results-in-advance",
    "publishedAt": "2025-09-26T17:30:33+00:00",
    "category": "wwe"
  },
  {
    "title": "Title Match Added To Tonight’s WWE SmackDown",
    "summary": "WWE has announced a new match for tonight’s episode of Friday Night SmackDown, which will emanate from the Kia Center in Orlando, Florida. The show will feature two major championship matches and an...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/title-match-added-tonights-wwe-smackdown/",
    "publishedAt": "2025-09-26T17:25:28+00:00",
    "category": "wwe"
  },
  {
    "title": "Report Details Reasoning Behind Unusual Build For Upcoming WWE Match",
    "summary": "The build for John Cena's match with AJ Styles at WWE Crown Jewel caught fan's attention online, but there are a few reasons why the match was built that way.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1979448/wwe-crown-jewel-2025-perth-build-john-cena-aj-styles/",
    "publishedAt": "2025-09-26T17:13:14+00:00",
    "category": "wwe"
  },
  {
    "title": "Cody Rhodes Segment, Sami Zayn Open Challenge Added To 9/26 WWE SmackDown",
    "summary": "Cody Rhodes will be in the building for Friday's WWE SmackDown, addressing his WWE Crown Jewel match against Seth Rollins. Plus, Sami Zayn will hold another open challenge for the WWE United States...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/cody-rhodes-segment-sami-zayn-open-challenge-added-to-9-26-wwe-smackdown",
    "publishedAt": "2025-09-26T16:55:28+00:00",
    "category": "wwe"
  },
  {
    "title": "Matt Cardona Thinks He And Chelsea Green Could Beat CM Punk And AJ Lee Or Seth Rollins And Becky Lynch",
    "summary": "Matt Cardona wants to team with his wife, Chelsea Green, in WWE, and even thinks that they could beat the two couples that just battled each other at WWE Wrestlepalooza. Matt Cardona has not been shy...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/matt-cardona-thinks-he-and-chelsea-green-could-beat-cm-punk-and-aj-lee-or-seth-rollins-and-becky-lynch",
    "publishedAt": "2025-09-26T16:54:56+00:00",
    "category": "wwe"
  },
  {
    "title": "Backstage Report On AEW Star Taking Time Off & One Returning",
    "summary": "One top AEW star is set for some time off following their recent All Out match, while another significant wrestler should be back soon.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1979406/aew-time-off-mjf-return-kenny-omega/",
    "publishedAt": "2025-09-26T16:50:38+00:00",
    "category": "aew"
  },
  {
    "title": "Bishop Dyer Says He'd Pay Money To Be In The Ring With This 'Explosive' AEW Star",
    "summary": "Former WWE star Bishop Dyer says he's so impressed by an AEW star that he'd pay money to be in the ring with them.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1979379/aew-bishop-dyer-pay-money-kyle-fletcher-explosive/",
    "publishedAt": "2025-09-26T16:28:21+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE's IYO SKY Announced For Upcoming Marigold Show",
    "summary": "Former WWE Women's World Champion IYO SKY will make her second appearance for an upcoming Marigold show in Japan next month.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1979368/wwe-iyo-sky-marigold-grand-destoiny-2025-mayu-iwatani/",
    "publishedAt": "2025-09-26T16:18:23+00:00",
    "category": "wwe"
  },
  {
    "title": "Drew McIntyre To Star Alongside Henry Cavill In “Highlander”",
    "summary": "Drew McIntyre is set to make a move to the big screen, as he has officially joined the cast of the upcoming “Highlander” reboot from Amazon MGM Studios. The two-time former WWE Champion will star...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/drew-mcintyre-star-alongside-henry-cavill-highlander/",
    "publishedAt": "2025-09-26T16:13:54+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE NXT Viewership & Ratings Report: 9/23/25",
    "summary": "\"WWE NXT\" posts one of its lowest ratings of the year following Homecoming episode last week.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1979349/wwe-nxt-viewership-ratings-september-23-2025/",
    "publishedAt": "2025-09-26T16:09:46+00:00",
    "category": "wwe"
  },
  {
    "title": "Eddie Kingston Returning To Beyond At Novembercanrana",
    "summary": "Eddie Kingston will return to Beyond Wrestling at Novembercanrana on November 14. This would be Kingston's first match at Beyond in 2022. No opponent was announced for Kingston. Kingston was...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/eddie-kingston-returning-to-beyond-at-novembercanrana",
    "publishedAt": "2025-09-26T16:09:33+00:00",
    "category": "general"
  },
  {
    "title": "Ricky Saints On Cody Rhodes: To Me, He’s Just My Friend",
    "summary": "Ricky Saints speaks about his relationship with Cody Rhodes, admitting that he doesn't brag too much about being close to the top guy in WWE. Ricky Saints and Cody Rhodes have been close for years....",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/ricky-saints-on-cody-rhodes-to-me-hes-just-my-friend",
    "publishedAt": "2025-09-26T16:04:51+00:00",
    "category": "wwe"
  },
  {
    "title": "Chris Bey Reflects On Recovery Journey: 'Every Day Above Ground Is A Good Day'",
    "summary": "Chris Bey discusses his recovery and expresses his gratitude for the fan support he continues to receive. Chris Bey suffered an unfortunate injury following TNA Bound for Glory 2024. He took a...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/chris-bey-reflects-on-recovery-journey-every-day-above-ground-is-a-good-day",
    "publishedAt": "2025-09-26T16:00:00+00:00",
    "category": "tna"
  },
  {
    "title": "Ricky Saints Praises CM Punk, Bryan Danielson, Cody Rhodes, And More For Helping Him Grow",
    "summary": "Ricky Saints praises several top stars and some unsung heroes in wrestling for helping him reach the position he's in today. Ricky Saints, formerly known as Ricky Starks, is set to headline his first...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/ricky-saints-praises-cm-punk-bryan-danielson-cody-rhodes-and-more-for-helping-him-grow",
    "publishedAt": "2025-09-26T15:45:48+00:00",
    "category": "general"
  },
  {
    "title": "Top WWE Star Says He Won’t Do a Year-Long Retirement Tour Like John Cena",
    "summary": "CM Punk says he can’t do a year-long retirement tour like John Cena due to injuries and physical strain. John Cena began his retirement tour earlier this year, which featured 36 dates, with only five...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1581468-top-wwe-star-wont-do-john-cena-style-retirement-tour",
    "publishedAt": "2025-09-26T15:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW's Darby Allin Set To Wrestle As Part Of Upcoming Art Exhibition",
    "summary": "Next month, AEW star Darby Allin will take part in an exhibition that's set to include live wrestling in addition to artwork from Raymond Pettibon.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1979300/aew-darby-allin-wrestle-art-exhibition/",
    "publishedAt": "2025-09-26T15:27:20+00:00",
    "category": "aew"
  },
  {
    "title": "Bully Ray Details Head-Scratching Aspect Of Cena-Lesnar At WWE Wrestlepalooza",
    "summary": "WWE Hall of Famer Bully Ray reveals the aspect of the recent John Cena and Brock Lesnar match that left him scratching his head.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1979299/wwe-wrestlepalooza-bully-ray-head-scratching-john-cena-brock-lesnar/",
    "publishedAt": "2025-09-26T15:25:14+00:00",
    "category": "wwe"
  },
  {
    "title": "Backstage Report On The Outcome Of The Cena-Lesnar Match At WWE Wrestlepalooza",
    "summary": "The finish to John Cena and Brock Lesnar's match at WWE Wrestlepalooza caught people by surprise, but Dave Meltzer has revealed what was meant to happen.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1979297/wwe-wrestlepalooza-john-cena-brock-lesnar-finish/",
    "publishedAt": "2025-09-26T15:21:26+00:00",
    "category": "wwe"
  },
  {
    "title": "The Miz: Triple H “Has One Of The Best Minds In The Business”",
    "summary": "With WWE WrestleMania 42 in Las Vegas on the horizon, The Miz has shared his complete faith in the creative direction of Paul “Triple H” Levesque. In a recent interview with The Schmo to promote the...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/miz-triple-one-best-minds-business/",
    "publishedAt": "2025-09-26T15:01:05+00:00",
    "category": "wwe"
  },
  {
    "title": "The Miz: Triple H Has One Of The Best Wrestling Minds I've Ever Seen",
    "summary": "The Miz would like to be a major fixture at WrestleMania 42 in Las Vegas, but no matter what happens, he trusts Triple H's vision. The Miz has been a top WWE star for over a decade. However, he is...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/the-miz-triple-h-has-one-of-the-best-wrestling-minds-ive-ever-seen",
    "publishedAt": "2025-09-26T14:44:44+00:00",
    "category": "wwe"
  },
  {
    "title": "The Miz Says WWE In 2025 Is Bigger Than The Attitude Era",
    "summary": "The Miz believes that WWE is stronger as a brand today than they were in the Attitude Era. Miz also says that he thinks the storylines are stronger. The Miz has been in WWE for 21 years, and during...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/the-miz-says-wwe-in-2025-is-bigger-than-the-attitude-era",
    "publishedAt": "2025-09-26T14:32:02+00:00",
    "category": "wwe"
  },
  {
    "title": "The Miz: “It Pisses Me Off” That WWE Fans Aren’t Demanding “The Miz Vs. John Cena”",
    "summary": "In a recent interview with The Schmo, The Miz voiced his frustration and anger at being excluded from John Cena’s ongoing retirement tour. The former WWE Champion believes his extensive history with...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/miz-pisses-off-wwe-fans-arent-demanding-miz-john-cena/",
    "publishedAt": "2025-09-26T14:22:01+00:00",
    "category": "wwe"
  },
  {
    "title": "Stephanie Vaquer Was Nearly Pulled From WWE WrestlePalooza Due To Illness",
    "summary": "Stephanie Vaquer’s illness almost cost La Primera her WWE WrestlePalooza appearance. Vaquer made history by becoming the first Chilean woman to win a WWE World Championship. She defeated IYO SKY to...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1581432-stephanie-vaquer-was-nearly-pulled-from-wwe-wrestlepalooza-due-to-illness",
    "publishedAt": "2025-09-26T14:00:00+00:00",
    "category": "general"
  },
  {
    "title": "YouTube TV subscribers could lose the ability to watch WWE SmackDown over carriage dispute with NBCU",
    "summary": "According to Deadline, NBCUniversal is warning YouTube TV subscribers its programming could soon go dark on the pay-TV service due to the latest… The post YouTube TV subscribers could lose the...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/362685-youtube-tv-subscribers-could-lose-the-ability-to-watch-wwe-smackdown-over-carriage-dispute-with-nbcu/",
    "publishedAt": "2025-09-26T13:47:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Absent WWE Star Is Returning To TV “Imminently”",
    "summary": "Former WWE United States Champion Jacob Fatu is expected to make his return to WWE television imminently, according to a new report. In the latest edition of the Wrestling Observer Newsletter, Dave...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/absent-wwe-star-returning-imminently/",
    "publishedAt": "2025-09-26T13:24:30+00:00",
    "category": "general"
  },
  {
    "title": "Rumor Killer On Brock Lesnar Vs. John Cena Match Finish",
    "summary": "New details are out regarding the booking of the Brock Lesnar vs. John Cena match at WWE Wrestlepalooza, clarifying that Lesnar’s dominant victory was always the intended outcome. In the latest...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/rumor-killer-brock-lesnar-john-cena-match-finish/",
    "publishedAt": "2025-09-26T13:21:41+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Star Calls Out Former Champion For A “Big Match”",
    "summary": "WWE NXT’s Lola Vice is dreaming big, and she has her sights set on a “big match” with a recently returned WWE Hall of Famer. In a new interview with Sports Illustrated, the former Bellator fighter...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-star-calls-out-former-champion-big-match/",
    "publishedAt": "2025-09-26T13:00:55+00:00",
    "category": "wwe"
  },
  {
    "title": "Triple Threat Women’s Title Match set for tonight’s WWE SmackDown",
    "summary": "WWE SmackDown airs live tonight on the USA Network in the United States and Netflix internationally, beginning at… The post Triple Threat Women’s Title Match set for tonight’s WWE SmackDown appeared...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/top-story/362664-triple-threat-womens-title-match-set-for-tonights-wwe-smackdown/",
    "publishedAt": "2025-09-26T13:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "MVP Shares Update On In-Ring Future After AEW All Out",
    "summary": "MVP opens up about his in-ring return at AEW All Out. At AEW All Out, MVP made his long-awaited return to in-ring action. He teamed up with The Hurt Syndicate members Bobby Lashley and Shelton...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1581476-mvp-not-just-manager-aew-return",
    "publishedAt": "2025-09-26T12:22:21+00:00",
    "category": "aew"
  },
  {
    "title": "David Otunga On The Infamous SummerSlam Loss: It ‘Completely Cut The Legs Out From Under Us’",
    "summary": "On a recent episode of TMZ Inside The Ring, former WWE Superstar David Otunga confirmed one of the most debated rumors in modern wrestling history: that John Cena was personally responsible for...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/david-otunga-infamous-summerslam-loss-completely-cut-legs-out-under/",
    "publishedAt": "2025-09-26T11:46:38+00:00",
    "category": "wwe"
  },
  {
    "title": "Report: Backstage update on Logan Paul’s WWE status",
    "summary": "WrestleVotes Radio has provided a new update on Logan Paul following his match against John Cena at WWE… The post Report: Backstage update on Logan Paul’s WWE status appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/362682-report-backstage-update-on-logan-pauls-wwe-status/",
    "publishedAt": "2025-09-26T04:39:56+00:00",
    "category": "wwe"
  },
  {
    "title": "TNA IMPACT Results – 9/25/25 (Final Show Before Victory Road)",
    "summary": "TNA IMPACT results are courtesy of tnawrestling.com. Trey Miguel and Zachary Wentz of The Rascalz battle X-Division Champion… The post TNA IMPACT Results – 9/25/25 (Final Show Before Victory Road)...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/impact-results/362679-tna-impact-results-9-25-25-final-show-before-victory-road/",
    "publishedAt": "2025-09-26T02:56:57+00:00",
    "category": "tna"
  },
  {
    "title": "AJ Styles addresses plans to retire ‘within the next year’",
    "summary": "In an interview with Tokyo Sports, AJ Styles shared a timeline on when he intends to retire from… The post AJ Styles addresses plans to retire ‘within the next year’ appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/top-story/362674-aj-styles-addresses-plans-to-retire-within-the-next-year/",
    "publishedAt": "2025-09-26T01:17:40+00:00",
    "category": "wwe"
  },
  {
    "title": "WWF Raw Results – 9/25/95 (Fallout from In Your House, The Undertaker vs. The British Bulldog)",
    "summary": "WWF Monday Night RawSeptember 25, 1995Grand Rapids, Michigan (Civic Auditorium)Commentary: Vince McMahon and Jerry “The King” LawlerResults by:… The post WWF Raw Results – 9/25/95 (Fallout from In...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/retro/362669-wwf-raw-results-september-25-1995-grand-rapids/",
    "publishedAt": "2025-09-26T01:08:30+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW Dynamite viewership and key demo up for the All Out Fallout episode",
    "summary": "This past Wednesday’s AEW Dynamite All Out Fallout episode on TBS, came in with 638,000 viewers and a… The post AEW Dynamite viewership and key demo up for the All Out Fallout episode appeared first...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/aew-news/362653-aew-dynamite-viewership-and-key-demo-up-for-the-all-out-fallout-episode/",
    "publishedAt": "2025-09-25T23:56:56+00:00",
    "category": "aew"
  },
  {
    "title": "Backstage details on Jazmyn Nyx’s departure from WWE, the offer she turned down",
    "summary": "Fightful Select has provided backstage details on the departure of Jazmyn Nyx, including how much WWE was offering… The post Backstage details on Jazmyn Nyx’s departure from WWE, the offer she turned...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/362656-backstage-details-on-jazmyn-nyxs-departure-from-wwe-the-offer-she-turned-down/",
    "publishedAt": "2025-09-25T22:25:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Masha Slamovich issues statement on domestic violence allegations",
    "summary": "TNA Masha Slamovich took to X on Wednesday, issuing a statement on the recent domestic violence allegations, which… The post Masha Slamovich issues statement on domestic violence allegations appeared...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/impact-wrestling-news/362641-masha-slamovich-issues-statement-on-domestic-violence-allegations/",
    "publishedAt": "2025-09-25T03:50:00+00:00",
    "category": "tna"
  }
]