[
  {
    "title": "Paul Walter Hauser Believes That Chris Pratt, Charlize Theron, Ken Jeong, Others Would Succeed In Wrestling",
    "summary": "Paul Walter Hauser believes that some big Hollywood names could succeed in wrestling. Hauser has quickly established himself as an exciting name in the world of wrestling, as he's balancing his work...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/paul-walter-hauser-chris-pratt-260116",
    "publishedAt": "2025-10-07T18:00:23+00:00",
    "category": "general"
  },
  {
    "title": "Dave Meltzer Weighs In On WWE's Plans For WrestleMania 42",
    "summary": "Dave Meltzer weighs in on what he feels will be some of WWE's plans for WrestleMania 42 regarding Roman Reigns and WWE World Heavyweight Champion Seth Rollins",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1989854/wwe-wrestlemania-42-dave-meltzer-plans-build-roman-reigns-seth-rollins/",
    "publishedAt": "2025-10-07T17:59:17+00:00",
    "category": "wwe"
  },
  {
    "title": "Tag Title Bout At WWE NXT Showdown With TNA To Have Intriguing Spectators Front Row",
    "summary": "Two WWE Hall Of Famers will be seated front row for Winners Take All Match between The Hardys and DarkState at Showdown.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1989849/wwenxt-showdown-tna-tag-team-titles-hardys-darkstate-dudleys/",
    "publishedAt": "2025-10-07T17:55:24+00:00",
    "category": "wwe"
  },
  {
    "title": "Kevin Nash Says Triple H And Shawn Michaels Try To Get Him To 'Come Back And Announce': I Don't Want A Job",
    "summary": "Kevin Nash comments on Triple H and Shawn Michaels working creative in WWE. Triple H and Shawn Michaels have been longtime friends for their pro wrestling careers, being part of 'The Kliq' alongside...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/kevin-nash-says-triple-h-and-shawn-michaels-try-to-get-him-to-come-back-and-announce-i-dont-want-a-job",
    "publishedAt": "2025-10-07T17:43:44+00:00",
    "category": "general"
  },
  {
    "title": "Je'Von Evans Recalls Telling His Teachers, 'All I Need To Know Is How To Count Money And Read Contracts'",
    "summary": "Je'Von Evans kept it straight with his teachers. At the young age of 21, Je'Von Evans is considered to be one of the fastest rising stars in all of professional wrestling. Evans will get a huge...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/jevon-evans-wwe-260106",
    "publishedAt": "2025-10-07T17:36:25+00:00",
    "category": "general"
  },
  {
    "title": "Backstage Update On Santos Escobar's WWE Departure",
    "summary": "Additional details have emerged regarding Santos Escobar's WWE departure, with his contract having reportedly expired early this morning.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1989801/wwe-santos-escobar-departure-contract/",
    "publishedAt": "2025-10-07T17:34:05+00:00",
    "category": "wwe"
  },
  {
    "title": "John Cena Thinks He Can Address His Failed Heel Turn After His WWE Retirement Tour",
    "summary": "John Cena is focused on the present. At WWE Elimination Chamber, John Cena shocked fans when he turned heel and attacked Undisputed WWE Champion Cody Rhodes. What started as an exciting new creative...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1583644-john-cena-speak-more-heel-turn-after-wwe-retirement-tour",
    "publishedAt": "2025-10-07T17:33:14+00:00",
    "category": "wwe"
  },
  {
    "title": "Raja Jackson Set To Face Two Charges For Syko Stu Attack",
    "summary": "Raja Jackson, the son of UFC legend Quinton “Rampage” Jackson, will face two charges, including a felony, for his legitimate in-ring attack on independent wrestler Syko Stu (Stuart Smith) at a KnokX...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/other/raja-jackson-set-face-two-charges-syko-stu-attack/",
    "publishedAt": "2025-10-07T17:23:46+00:00",
    "category": "aew"
  },
  {
    "title": "Gail Kim Thinks Kenny Omega's 'Gift Basket' Comment Made AEW Fans Feel It Was Okay To Come At Her",
    "summary": "Gail Kim created headlines online by sharing her opinion on Riho, saying she was uncomfortable with the camera shooting up her skirt and that Riho's size made things less believable. Kim made the...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/gail-kim-thinks-kenny-omegas-gift-basket-comment-made-aew-fans-feel-it-was-okay-to-come-at-her",
    "publishedAt": "2025-10-07T17:22:53+00:00",
    "category": "aew"
  },
  {
    "title": "Killer Kross and Scarlett React To Potential Interest From AEW",
    "summary": "Killer Kross and Scarlett contemplate a potential run in AEW. Following the expiration of their WWE contracts, Killer Kross and Scarlett are now free agents, with multiple independent wrestling...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1583604-killer-kross-and-scarlett-react-to-potential-interest-from-aew",
    "publishedAt": "2025-10-07T17:21:54+00:00",
    "category": "wwe"
  },
  {
    "title": "TNA’s Carlos Silva Comments On Ash By Elegance’s Future, NXT Showdown",
    "summary": "TNA wants to show NXT whose turf they are stepping on. NXT Showdown is set to take place on Tuesday night. The lineup features several NXT/TNA crossover matches, including a men’s and women’s...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582641-tna-carlos-silva-ash-by-elegance-status-nxt-showdown",
    "publishedAt": "2025-10-07T17:20:27+00:00",
    "category": "wwe"
  },
  {
    "title": "Je'Von Evans Says WWE Originally Wasn't Going To Sign Him After 2023 Tryout, Credits Shawn Michaels For Seeing Something In Him",
    "summary": "Je'Von Evans says Shawn Michaels pushed for him to be signed. Evans signed with WWE in late 2023 after taking part in a tryout with other names like Brogan Finlay (Uriah Connors) and Lucky Ali...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/jevonevanswwe260101",
    "publishedAt": "2025-10-07T17:17:45+00:00",
    "category": "wwe"
  },
  {
    "title": "Stephanie McMahon Among Upcoming WWE Names To Be Deposed In Shareholder Lawsuit",
    "summary": "A new court filing reveals Stephanie McMahon, along with several other WWE/TKO names, will be deposed as part of the ongoing shareholder lawsuit",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1989737/wwe-shareholder-lawsuit-stephanie-mcmahon-deposition-tkoari-emanuel/",
    "publishedAt": "2025-10-07T17:06:40+00:00",
    "category": "wwe"
  },
  {
    "title": "Wrestling Contract Expiration Dates: WWE, AEW, NJPW, TNA",
    "summary": "Below is an ongoing resource list featuring confirmed contract expirations reported by respected news outlets or the talent. You can also find Fightful's constantly updated injury report at this...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/confirmed-wrestling-contract-expirations-wwe-njpw-roh-gfw-lu",
    "publishedAt": "2025-10-07T17:03:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Lio Rush Is 'Disgusted' With The Idea Of Other Wrestlers Pulling Off CRU's Fashion Style",
    "summary": "Lio Rush and Action Andretti want others to stay out of their lane. Since debuting as a tag team in 2024, Rush and Andretti have stood out in AEW's crowded division, often wowing fans with their...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/lio-rush-action-andretti-243803",
    "publishedAt": "2025-10-07T17:00:00+00:00",
    "category": "aew"
  },
  {
    "title": "Full WWE Rosters For WWE Raw & Smackdown, Free Agents",
    "summary": "Since Wikipedia does a rough job updating rosters and status', Fightful will keep an ongoing, updated list of Raw and SmackDown rosters as best we can. Also, check out our contract updates, injury...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/full-wwe-roster",
    "publishedAt": "2025-10-07T16:58:00+00:00",
    "category": "wwe"
  },
  {
    "title": "JBL Finally Reveals The Real Reason A Legendary WWE Storyline Flopped",
    "summary": "On the latest episode of the Something to Wrestle With podcast, WWE Hall of Famer John Bradshaw Layfield (JBL) reflected on the 25th anniversary of one of the Attitude Era’s most controversial...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/jbl-finally-reveals-real-reason-legendary-wwe-storyline-flopped/",
    "publishedAt": "2025-10-07T16:18:49+00:00",
    "category": "wwe"
  },
  {
    "title": "Danielle Fishel Does WWE Entrances Backstage At Dancing with the Stars",
    "summary": "While the ballroom is typically reserved for dance practice, Danielle Fishel is also using it to practice her favorite WWE Superstar entrances. Danielle Fishel, famous for her role as Topanga...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1583586-danielle-fishel-does-wwe-entrances-backstage-at-dancing-with-the-stars",
    "publishedAt": "2025-10-07T16:02:11+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW Dynamite Title Tuesday Preview: 2.5 Hour Special!",
    "summary": "AEW Dynamite Title Tuesday airs live tonight on TBS and HBO Max from Daily’s Place in Jacksonville, Florida… The post AEW Dynamite Title Tuesday Preview: 2.5 Hour Special! appeared first on WWE News,...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/top-story/363573-aew-dynamite-title-tuesday-preview-2-5-hour-special/",
    "publishedAt": "2025-10-07T16:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Top WWE RAW Stars Featured On New Netflix Posters",
    "summary": "Netflix is WWE Raw. On January 6, WWE Raw made its official Netflix debut, both in the United States and several international markets. For viewers in the United States, Raw streams live every Monday...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1583577-top-wwe-raw-stars-featured-on-new-netflix-posters",
    "publishedAt": "2025-10-07T15:59:22+00:00",
    "category": "wwe"
  },
  {
    "title": "Matt Riddle Highlights One Thing He Liked About Working With Vince McMahon",
    "summary": "Ex-WWE star Matt Riddle praised Vince McMahon and pointed out one thing he liked about working for the former WWE Chairman. Riddle discussed Vince McMahon’s work habits during a recent interview with...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1583366-matt-riddle-one-thing-he-liked-vince-mcmahon-wwe",
    "publishedAt": "2025-10-07T15:58:08+00:00",
    "category": "wwe"
  },
  {
    "title": "Maven Thinks WWE Ruthless Aggression Character Would Be 'Canceled' Today",
    "summary": "The inaugural Tough Enough winner doesn't think this character from a bygone WWE era would make it in the modern social climate.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1989440/maven-thinks-wwe-ruthless-aggression-character-would-be-canceled-today/",
    "publishedAt": "2025-10-07T15:45:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Kevin Nash Names The One Female WWE Superstar He Believes Would Fit In The NWO",
    "summary": "The New World Order was a predominantly male faction, but the group’s attitude and rebellious swagger have often led fans to speculate which female wrestlers, past or present, would have been a...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/kevin-nash-names-one-female-wwe-superstar-believes-would-fit-nwo/",
    "publishedAt": "2025-10-07T15:34:15+00:00",
    "category": "wwe"
  },
  {
    "title": "Dave Meltzer Weighs In On How New Ratings System Affects WWE & AEW Shows",
    "summary": "Dave Meltzer analyzes how Nielsen's new viewership model will specifically impact \"WWE NXT\" and \"AEW Dynamite\" going forward.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1989497/wwe-aew-dave-meltzer-new-nielsen-ratings-system/",
    "publishedAt": "2025-10-07T15:07:58+00:00",
    "category": "wwe"
  },
  {
    "title": "Scarlett Felt WWE Negotiation Tactics With Killer Kross Were A Massive Red Flag And Misogynistic",
    "summary": "Killer Kross and Scarlett wanted to stay with WWE, but they say they had a good feeling that things would end up the way they did. Kross and Scarlett spoke with Chris Van Vliet on his Insight podcast...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1583574-scarlett-killer-kross-wwe-negotiation-tactics-massive-red-flag-misogynistic",
    "publishedAt": "2025-10-07T15:02:29+00:00",
    "category": "wwe"
  },
  {
    "title": "Many In People In WWE Expect Former Star To Join AEW",
    "summary": "The future of the now-former WWE Superstar Santos Escobar is a hot topic in the wrestling world, and a new report suggests that many within WWE expect him to land in AEW. On a recent episode of...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/many-people-wwe-expect-former-star-join-aew/",
    "publishedAt": "2025-10-07T14:24:16+00:00",
    "category": "wwe"
  },
  {
    "title": "Matt Hardy Opens Up About 'Wild' Experience On Kai Cenat's Twitch Stream",
    "summary": "TNA star Matt Hardy and his brother Jeff recently appeared on Kai Cenat's livestream, with Matt offering some details of the experience.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1989391/matt-hardy-wild-kai-cenat-twitch-stream/",
    "publishedAt": "2025-10-07T14:12:19+00:00",
    "category": "tna"
  },
  {
    "title": "Santos Escobar Moved To WWE Alumni Section",
    "summary": "Former NXT Cruiserweight Champion Santos Escobar is officially a free agent, as his WWE contract expired at midnight on Tuesday, October 7. The news was confirmed when Escobar was moved to the alumni...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/santos-escobar-moved-wwe-alumni-section/",
    "publishedAt": "2025-10-07T14:11:14+00:00",
    "category": "wwe"
  },
  {
    "title": "What Could Have Been: What If WWE Strapped Up AEW Star Samoa Joe At Crown Jewel 2018?",
    "summary": "What if Vince McMahon pulled the trigger on Samoa Joe at Crown Jewel 2018, making him WWE Champion and properly getting behind him as a major player?",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1989007/what-could-have-been-wwe-aew-samoa-joe-crown-jewel-2018-aew/",
    "publishedAt": "2025-10-07T14:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "AJ Styles Says His Match With John Cena Doesn’t Need A Story",
    "summary": "AJ Styles says his history with John Cena speaks for itself. Styles appeared on Monday night’s episode of WWE RAW for a six-man tag team match. Styles teamed with Penta and Dragon Lee against The...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1583568-aj-styles-match-with-john-cena-doesnt-need-a-story",
    "publishedAt": "2025-10-07T13:52:25+00:00",
    "category": "wwe"
  },
  {
    "title": "CM Punk References AEW Star During WWE RAW Promo",
    "summary": "CM Punk cleverly referenced one of his best adversaries from AEW on RAW this week. During his promo on this week’s episode of WWE RAW, CM Punk acknowledged a sign in the crowd that said he deserved...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1583562-cm-punk-references-aew-star-wwe-raw",
    "publishedAt": "2025-10-07T13:32:49+00:00",
    "category": "wwe"
  },
  {
    "title": "Scarlett Calls WWE’s Negotiation Tactics ‘Misogynistic’",
    "summary": "In a revealing interview on Insight with Chris Van Vliet, the recently departed WWE duo of Karrion Kross and Scarlett detailed the “bizarre” and “shocking” contract negotiations that led to their...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/scarlett-calls-wwes-negotiation-tactics-misogynistic/",
    "publishedAt": "2025-10-07T13:28:17+00:00",
    "category": "wwe"
  },
  {
    "title": "Major Star Criticizes WWE Over John Cena’s Retirement Tour Booking",
    "summary": "John Cena’s retirement tour has drawn criticism from Paul Walter Hauser, who expressed disappointment with how WWE is handling it. Speaking on TMZ Inside The Ring, actor and wrestling personality...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1583551-paul-walter-hauser-slams-wwe-john-cena-retirement-tour",
    "publishedAt": "2025-10-07T13:05:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Bully Ray Doesn't Know Why He Should Care About This WWE Crown Jewel 2025 Match",
    "summary": "WWE legend Bully Ray has explained why he doesn't think there's any sense in a clash between two former WWE Champions at Crown Jewel.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1989124/wwe-crown-jewel-2025-bully-ray-john-cena-aj-styles/",
    "publishedAt": "2025-10-07T13:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "The Miz Reveals Biggest Things That Changed About CM Punk Since Initial WWE Departure",
    "summary": "The Miz reveals what has changed about CM Punk since his return to the company and what it was like the night he unexpectedly showed at \"Raw\" before leaving AEW",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1985152/miz-biggest-things-changed-cm-punk-initial-wwe-departure/",
    "publishedAt": "2025-10-07T12:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Jeff Jarrett Reveals “Multiple Conversations” To Bring Bret Hart To TNA",
    "summary": "On the latest episode of the My World podcast, Jeff Jarrett revealed that there were numerous discussions over the years to bring WWE Hall of Famer Bret “The Hitman” Hart to TNA Wrestling. Jarrett...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/tna-news/jeff-jarrett-reveals-multiple-conversations-bring-bret-hart-tna/",
    "publishedAt": "2025-10-07T12:20:26+00:00",
    "category": "wwe"
  },
  {
    "title": "Scarlett: “If We Ever Go To AEW, We’re Going To Be Flying The AEW Flag. That Is Going To Be Our Home Forever”",
    "summary": "Now that they are free agents, Karrion Kross and Scarlett are carefully considering their next move. Speaking on Insight with Chris Van Vliet, the duo discussed their creative priorities, their...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/scarlett-ever-aew-going-flying-aew-flag-going-our-home-forever/",
    "publishedAt": "2025-10-07T10:38:14+00:00",
    "category": "aew"
  },
  {
    "title": "AEW Dynamite Preview: Title Matches, Hangman Page-Samoa Joe Confrontation",
    "summary": "All Elite Wrestling is returning to its home base of Daily’s Place in Jacksonville, Florida, for a special “Title Tuesday” edition of AEW Dynamite, and the card is loaded with championship matches....",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/aew-dynamite-preview-title-matches-hangman-page-samoa-joe-confrontation/",
    "publishedAt": "2025-10-07T10:23:56+00:00",
    "category": "aew"
  },
  {
    "title": "10/6 WWE Raw Highlights: Go-Home Show For Crown Jewel",
    "summary": "WWE has posted highlights from Monday’s episode of Raw, which was the go-home show for this Saturday’s Crown… The post 10/6 WWE Raw Highlights: Go-Home Show For Crown Jewel appeared first on WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/363568-10-6-wwe-raw-highlights-go-home-show-for-crown-jewel/",
    "publishedAt": "2025-10-07T04:12:08+00:00",
    "category": "wwe"
  },
  {
    "title": "Former WWE tag team to debut at NWA’s SAMHAIN Part 3",
    "summary": "The National Wrestling Alliance has announced that Karl Anderson and Doc Gallows, better known as The Good Brothers,… The post Former WWE tag team to debut at NWA’s SAMHAIN Part 3 appeared first on...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/misc-news/363540-former-wwe-tag-team-to-debut-at-nwas-samhain-part-3/",
    "publishedAt": "2025-10-07T03:38:35+00:00",
    "category": "wwe"
  },
  {
    "title": "Dwayne Johnson reportedly took a big cut in pay for ‘The Smashing Machine’",
    "summary": "According to Deadline, Dwayne “The Rock” Johnson took a big cut in pay to do the Mark Kerr… The post Dwayne Johnson reportedly took a big cut in pay for ‘The Smashing Machine’ appeared first on WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/363535-dwayne-johnson-reportedly-took-a-big-cut-in-pay-for-the-smashing-machine/",
    "publishedAt": "2025-10-07T03:33:55+00:00",
    "category": "wwe"
  },
  {
    "title": "Report: Hulk Hogan’s family files petition over potential malpractice claim",
    "summary": "Brandon Thurston of POST Wrestling has reported that the family of Hulk Hogan has filed a petition in… The post Report: Hulk Hogan’s family files petition over potential malpractice claim appeared...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/363525-report-hulk-hogans-family-files-petition-over-potential-malpractice-claim/",
    "publishedAt": "2025-10-07T02:03:18+00:00",
    "category": "general"
  },
  {
    "title": "Tommy Dreamer to induct Beautiful People into 2025 TNA Wrestling Hall of Fame",
    "summary": "While speaking with Gabby LaSpisa on Gabby AF, TNA Head of Creative Tommy Dreamer revealed he will be… The post Tommy Dreamer to induct Beautiful People into 2025 TNA Wrestling Hall of Fame appeared...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/impact-wrestling-news/363520-tommy-dreamer-to-induct-beautiful-people-into-tna-wrestling-hall-of-fame/",
    "publishedAt": "2025-10-07T01:54:35+00:00",
    "category": "tna"
  },
  {
    "title": "WWE Raw Results – 10/6/25 (Roman Reigns kicks off the show, CM Punk returns, Crown Jewel build)",
    "summary": "WWE Raw ResultsOctober 6, 2025Dallas, Texas (American Airlines Center)Commentary: Joe Tessitore and Wade BarrettResults by: Mike Tedesco of… The post WWE Raw Results – 10/6/25 (Roman Reigns kicks off...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-raw-results/363488-live-wwe-raw-results-october-6-2025-dallas/",
    "publishedAt": "2025-10-07T00:01:46+00:00",
    "category": "wwe"
  },
  {
    "title": "Paul Heyman’s Looking4Larry merges with MCM Studios, looks to expand production in New York",
    "summary": "In speaking with The Hollywood Reporter, WWE Hall of Famer Paul Heyman revealed that his creative studio that… The post Paul Heyman’s Looking4Larry merges with MCM Studios, looks to expand production...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/363468-paul-heymans-looking4larry-merges-with-mcm-studios-looks-to-expand-production-in-new-york/",
    "publishedAt": "2025-10-06T18:36:16+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE female star holding free women’s wrestling seminar this December",
    "summary": "WWE’s Bayley took to social media, announcing she is holding a free three-day women’s wrestling seminar in Orlando,… The post WWE female star holding free women’s wrestling seminar this December...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/363465-wwe-female-star-holding-free-womens-wrestling-seminar-this-december/",
    "publishedAt": "2025-10-06T18:19:24+00:00",
    "category": "wwe"
  }
]