[
  {
    "title": "Health Update On AEW Star Billy Gunn",
    "summary": "Hall of Famer Billy Gunn hasn't been on AEW programming in a while. New reports clear up the speculation as to why.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2006342/health-update-aew-billy-gunn/",
    "publishedAt": "2025-10-24T18:12:16+00:00",
    "category": "aew"
  },
  {
    "title": "Dave Meltzer Offers Update On Reported AI Integration In WWE",
    "summary": "Following up on a report from last week, Dave Meltzer reiterated that people within WWE believe AI will be used to generation creative pitches in the future.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2006337/dave-meltzer-update-ai-integration-wwe/",
    "publishedAt": "2025-10-24T18:04:51+00:00",
    "category": "wwe"
  },
  {
    "title": "AJ Styles Says He’s Nearly Collapsed During His Entrance ‘More Than Once’",
    "summary": "AJ Styles has revealed that he almost collapsed during his entrances on more than one occasion. Former two-time WWE Champion AJ Styles reacted to a clip on X/Twitter, which showed Seth Rollins...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586364-aj-styles-nearly-collapsed-during-entrance-more-than-once",
    "publishedAt": "2025-10-24T18:03:45+00:00",
    "category": "wwe"
  },
  {
    "title": "Charles Manson Wanted To Meet Bray Wyatt, Says Ex-WWE Writer",
    "summary": "It appears Bray Wyatt’s flawless portrayal of his original Wyatt Family character caught the attention of a real cult leader. Former WWE writer Nick Manfredini was a guest on Freddie Prinze Jr’s...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586354-charles-manson-wanted-to-meet-bray-wyatt-says-ex-wwe-writer",
    "publishedAt": "2025-10-24T18:02:45+00:00",
    "category": "wwe"
  },
  {
    "title": "The Boogeyman Jump Scares Chelsea Green, Jacob Fatu, Damian Priest, Michin, More",
    "summary": "The Boogeyman is still coming to get you. As of publish time, we are just one week away from the spookiest day of the year, Halloween. To celebrate, WWE uploaded a video of Boogeyman scaring the...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/the-boogeyman-jump-scares-chelsea-green-jacob-fatu-damian-priest-michin-more",
    "publishedAt": "2025-10-24T17:39:23+00:00",
    "category": "wwe"
  },
  {
    "title": "Report Details Plans For WWE Survivor Series WarGames 2025 After Seth Rollins' Injury",
    "summary": "Dave Meltzer provides an update on the Men's WarGames Match at Survivor Series following Seth Rollins being injured an unable to compete at the event.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2006290/report-details-plans-wwe-survivor-series-wargames-2025-seth-rollins-injury/",
    "publishedAt": "2025-10-24T17:30:54+00:00",
    "category": "wwe"
  },
  {
    "title": "Titus O'Neil Open To WWE TV Return",
    "summary": "Titus O'Neil has been on WWE TV since WrestleMania 39 when he was a guest commentator during the event. He hasn't wrestled since 2020, undergoing a knee procedure in 2022. Speaking to TMZ, Titus was...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/titus-oneil-open-to-wwe-tv-return",
    "publishedAt": "2025-10-24T17:10:23+00:00",
    "category": "wwe"
  },
  {
    "title": "Netflix May Have Spoiled AJ Lee’s Next WWE Appearance",
    "summary": "A potential spoiler regarding AJ Lee’s return to WWE programming may have come from an unlikely source: Netflix. The streaming platform, which now carries Monday Night Raw, is reportedly listing the...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/netflix-may-have-spoiled-lees-next-wwe-appearance/",
    "publishedAt": "2025-10-24T17:06:29+00:00",
    "category": "wwe"
  },
  {
    "title": "Jacy Jayne Recalls What Shawn Michaels Said To Her After NXT Women’s Championship Win",
    "summary": "Jacy Jayne recalls chatting with Shawn Michaels after her big title win. Jayne was able to capture the NXT Women’s Championship back in May, defeating Stephanie Vaquer in a shock victory. Speaking...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/shawn-michaels-jacy-jayne-264179",
    "publishedAt": "2025-10-24T17:00:07+00:00",
    "category": "general"
  },
  {
    "title": "Elijah Says He's Not Currently Cleared, Is Healthy Enough To Smash A Guitar",
    "summary": "Elijah made a surprise return at TNA Bound For Glory, smashing a guitar over the head of Nic Nemeth, who was looking to cash in his Call Your Shot Gauntlet trophy on Mike Santana. Elijah had been off...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/elijah-says-hes-not-currently-cleared-is-healthy-enough-to-smash-a-guitar",
    "publishedAt": "2025-10-24T16:43:52+00:00",
    "category": "tna"
  },
  {
    "title": "Former WWE Star Marc Mero Announces Engagement",
    "summary": "Former WWE Intercontinental Champion Marc Mero has announced his engagement to his partner, Malissa. Mero shared the news on his social media platforms. In an emotional post revealing that Malissa...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/former-wwe-star-marc-mero-announces-engagement/",
    "publishedAt": "2025-10-24T16:42:17+00:00",
    "category": "wwe"
  },
  {
    "title": "Health Update On AEW Star Kota Ibushi Following Leg Fracture",
    "summary": "Following Kota Ibushi's successful surgery, new reports are being made on the recovery of the AEW star.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2006196/health-update-aew-kota-ibushi-leg-fracture/",
    "publishedAt": "2025-10-24T16:34:39+00:00",
    "category": "aew"
  },
  {
    "title": "D-Von Dudley Reveals Why He Never Joined AEW Despite Multiple Meetings With Tony Khan",
    "summary": "D-Von Dudley had lengthy conversations with Tony Khan about joining AEW at one point, but the two disagreed on what his role would be.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2006180/dvon-dudley-never-joined-aew-multiple-meetings-tony-khan/",
    "publishedAt": "2025-10-24T16:26:23+00:00",
    "category": "aew"
  },
  {
    "title": "Tom Lawlor: Dealing With Jon Moxley Inside Of The Ring Is Like Dealing With A Wild Animal",
    "summary": "Tom Lawlor reflects on his match with Jon Moxley. In April 2022, Jon Moxley made his return to DEFY Wrestling to face Tom Lawlor in a singles contest. This match, which was highly praised by...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/tom-lawlor-jon-moxley-264169",
    "publishedAt": "2025-10-24T16:18:40+00:00",
    "category": "general"
  },
  {
    "title": "Abdullah The Butcher Hospitalized",
    "summary": "There has been a concerning update about WWE legend Abdullah the Butcher. WWE Hall of Famer Abdullah the Butcher has been hospitalized due to serious health issues. His long-time booking agent, Steve...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586344-abdullah-the-butcher-hospitalized",
    "publishedAt": "2025-10-24T16:07:07+00:00",
    "category": "wwe"
  },
  {
    "title": "Elijah Gives Update On His In-Ring Return From Injury",
    "summary": "Elijah has not been in the ring for several months, but he’s hopeful that changes soon. WrestleZone Managing Editor Bill Pritchard spoke with Elijah to promote TNA’s upcoming television tapings in...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586345-elijah-update-in-ring-return-injury-tna",
    "publishedAt": "2025-10-24T15:44:29+00:00",
    "category": "tna"
  },
  {
    "title": "Titus O’Neil Defends WWE’s Event Deal With Saudi Arabia",
    "summary": "Titus O’Neil has addressed the controversy surrounding WWE’s partnership with Saudi Arabia and their decision to host WrestleMania 43 in the country. WWE Global Ambassador and former Tag Team...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586338-titus-oneil-defends-wwe-deal-with-saudi-arabia",
    "publishedAt": "2025-10-24T15:43:47+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE And Dr. Squatch Team Up For Limited Edition Soaps And Deodorant",
    "summary": "WWE x Dr. Squatch is here. After weeks of teases and leaks, Dr. Squatch officially launched their WWE-branded line of products on Thursday, October 25. Fans have the option to purchase a two-pack of...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/wwe-and-dr-squatch-team-up-for-limited-edition-soaps-and-deodorant",
    "publishedAt": "2025-10-24T15:38:04+00:00",
    "category": "wwe"
  },
  {
    "title": "Nic Nemeth Wouldn’t Mind Seeing Matt Cardona Wrestle John Cena At MSG Episode of WWE Raw",
    "summary": "Nic Nemeth wants John Cena to face some more of his old foes. As of publish time, John Cena has four dates remaining with WWE before he retires from in-ring competition . Cena is set for the November...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/nic-nemeth-john-cena-matt-cardona-264159",
    "publishedAt": "2025-10-24T15:15:49+00:00",
    "category": "wwe"
  },
  {
    "title": "Tommy Dreamer Calls Fans 'Fickle' Over Live Reaction To WWE Raw Match",
    "summary": "Tommy Dreamer was surprised by the fans' reaction to the WWE Raw main event, criticizing the crowd for being fickle in their support.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2005845/tommy-dreamer-calls-fans-fickle-live-reaction-wwe-raw-match-jimmy-jey-uso/",
    "publishedAt": "2025-10-24T15:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Nic Nemeth Says Vince McMahon Paid The Half Million Dollar Fine To Let Him And John Cena Go Over The Curfew Time At 2012 MSG Live Event",
    "summary": "Nic Nemeth recalls tearing the house down with John Cena. On December 27, 2012, the former Dolph Ziggler and John Cena headlined WWE’s annual Madison Square Garden live event, facing each other in a...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/nic-nemeth-john-cena-wwe-264155",
    "publishedAt": "2025-10-24T14:44:41+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Is Reportedly Planning To Build A New Performance Center",
    "summary": "According to the Wrestling Observer Newsletter, WWE has plans to construct a new Performance Center (PC) facility in Orlando, Florida. The report dismisses any speculation that the company might...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-reportedly-planning-build-new-performance-center/",
    "publishedAt": "2025-10-24T14:44:10+00:00",
    "category": "wwe"
  },
  {
    "title": "Velvet Sky Reflects On The Beautiful People’s Failed Babyface Run In TNA",
    "summary": "Former TNA Knockouts Champion Velvet Sky discussed her early babyface run as The Beautiful People. During her appearance on Velvet Ropes with SoCal Val, Velvet Sky answered a fan who asked when she...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586306-velvet-sky-recalls-failed-babyface-run-in-tna",
    "publishedAt": "2025-10-24T14:36:44+00:00",
    "category": "tna"
  },
  {
    "title": "Becky Lynch Blames Ref Jessika Carr For WWE Raw Loss To Maxxine Dupri, Carr Responds",
    "summary": "WWE Women's Intercontinental Champion Becky Lynch has accused Maxxine Dupri of using illegal means in their match and feels she should have been disqualified.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2005867/becky-lynch-jessika-carr-wwe-raw-maxxine-dupri/",
    "publishedAt": "2025-10-24T14:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "D-Von Dudley Explains Why Logan Paul Wouldn’t Fit In With Another Era Of Wrestling",
    "summary": "D-Von Dudley claims Logan Paul would not have survived in WWE in a different era. During an exclusive interview with VideoGamer, WWE Hall of Famer D-Von Dudley was asked how he feels about Logan...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586285-logan-paul-wouldnt-fit-in-another-era-wrestling-d-von-dudley",
    "publishedAt": "2025-10-24T14:13:04+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE’s Plan For WarGames After Seth Rollins’ Injury Revealed",
    "summary": "An update has emerged regarding WWE’s plans for the men’s WarGames match at Survivor Series, following the injury sustained by Seth Rollins. Rollins’ shoulder injury, suffered at Crown Jewel, forced...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwes-plan-wargames-after-seth-rollins-injury-revealed/",
    "publishedAt": "2025-10-24T14:12:51+00:00",
    "category": "wwe"
  },
  {
    "title": "Chelsea Green Talks Conflict Between WWE Career And Wanting To Start A Family",
    "summary": "WWE star Chelsea Green opens up about the conflict between wanting to start a family of her own and maintaining her career in the wrestling ring.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2006018/chelsea-green-conflict-wwe-career-family/",
    "publishedAt": "2025-10-24T14:09:14+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE NXT Halloween Havoc 2025 Predictions: Wrestling Inc. Picks The Winners",
    "summary": "WWE NXT Halloween Havoc comes your way this Saturday from Arizona, and as always, the Wrestling Inc. staff are here to predict the winners of every match!",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2005723/wwe-nxt-halloween-havoc-2025-predictions-winners/",
    "publishedAt": "2025-10-24T14:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Braun Strowman’s New Show Is For Redneck Foodies And Forgotten Wrestling Fans",
    "summary": "Former WWE star Braun Strowman says his new food show, Everything on the Menu, is for the people who normally aren’t the audience of a food-focused TV series. In an interview with The New York Times...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1586314-braun-strowman-new-show-for-rednecks-wrestling-fans-foodies",
    "publishedAt": "2025-10-24T13:57:05+00:00",
    "category": "wwe"
  },
  {
    "title": "REPORT: WWE Staff Nervous About AI Despite Assurances",
    "summary": "During a WWE production meeting discussing the integration of Artificial Intelligence (AI) into creative processes, Paul Levesque (Triple H) addressed the potential impact on jobs. He stated that AI...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/report-wwe-staff-nervous-about-despite-assurances/",
    "publishedAt": "2025-10-24T13:55:00+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE SmackDown Preview: Tiffany Stratton vs. Kiana James, Tag Team Action",
    "summary": "WWE SmackDown airs live tonight on the USA Network in the United States and Netflix for international fans,… The post WWE SmackDown Preview: Tiffany Stratton vs. Kiana James, Tag Team Action appeared...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/top-story/365264-wwe-smackdown-preview-tiffany-stratton-vs-kiana-james-tag-team-action/",
    "publishedAt": "2025-10-24T13:45:16+00:00",
    "category": "wwe"
  },
  {
    "title": "Update on Chris Jericho’s AEW status, WWE reportedly interested in signing him",
    "summary": "A new report from Fightful Select indicates there is interest from other national and global promotions in signing… The post Update on Chris Jericho’s AEW status, WWE reportedly interested in signing...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/365286-update-on-chris-jerichos-aew-status-wwe-reportedly-interested-in-signing-him/",
    "publishedAt": "2025-10-24T13:43:09+00:00",
    "category": "wwe"
  },
  {
    "title": "Injury Forced WWE To Reschedule Big Championship Match",
    "summary": "The Undisputed WWE Championship match between Cody Rhodes and Drew McIntyre, now scheduled for Saturday Night’s Main Event, was reportedly moved up from its original spot at Survivor Series....",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/injury-forced-wwe-reschedule-big-championship-match/",
    "publishedAt": "2025-10-24T13:30:51+00:00",
    "category": "wwe"
  },
  {
    "title": "Ex-WWE Star D-Von Dudley Confirms Retirement, Explains Why Career Didn't End In AEW",
    "summary": "WWE Hall of Famer D-Von Dudley has stated that he is retired following his match at Bound for Glory, and explained why that match didn't take place in AEW.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2005839/wwe-dvon-dudley-confirms-retirement-career-aew/",
    "publishedAt": "2025-10-24T13:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "REPORT: WWE Has Big Plans For Bron Breakker",
    "summary": "Following the vacation of the World Heavyweight Championship due to Seth Rollins’ shoulder injury, WWE held a Battle Royal on the October 20 episode of Raw to determine who would face CM Punk for the...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/report-wwe-big-plans-bron-breakker/",
    "publishedAt": "2025-10-24T13:23:17+00:00",
    "category": "wwe"
  },
  {
    "title": "Andrade May Be Returning To WWE After Release",
    "summary": "New details have emerged on the complicated status of Andrade, whose return to AEW has been halted by a non-compete clause from his WWE release. According to a report from PWInsider, Andrade...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/andrade-may-returning-wwe-after-release/",
    "publishedAt": "2025-10-24T11:48:13+00:00",
    "category": "wwe"
  },
  {
    "title": "Titus O’Neil Defends WWE’s Saudi Arabia Deal: “I Feel Safer In Saudi Arabia Than I Do In Most Places” In US",
    "summary": "WWE Global Ambassador Titus O’Neil addressed the mixed opinions regarding WWE’s partnership with Saudi Arabia, including hosting WrestleMania 43, during an appearance on TMZ Inside The Ring. O’Neil...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/titus-oneil-defends-wwes-saudi-arabia-deal-feel-safer-saudi-arabia-than-most-places/",
    "publishedAt": "2025-10-24T11:05:24+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Higher Ups Have Discussed Chris Jericho Amid Return Speculation",
    "summary": "Chris Jericho is currently on his longest absence from AEW television since joining the company, and there is speculation about his future. A report from Fightful Select states that as of now, Chris...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-higher-ups-have-discussed-chris-jericho-amid-return-speculation/",
    "publishedAt": "2025-10-24T10:42:58+00:00",
    "category": "wwe"
  },
  {
    "title": "Viewership and key demo down for NXT Halloween Havoc Go-Home Show",
    "summary": "This past Tuesday’s NXT, live on the CW came in with 525,000 viewers and 0.07 rating in the… The post Viewership and key demo down for NXT Halloween Havoc Go-Home Show appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/365275-viewership-and-key-demo-down-for-nxt-halloween-havoc-go-home-show/",
    "publishedAt": "2025-10-24T03:26:26+00:00",
    "category": "wwe"
  },
  {
    "title": "Video: Full Documentary – The Triumph & Tragedy of WCCW",
    "summary": "WWE Vault has posted the full documentary of The Triumph & Tragedy of World Class Championship Wrestling. In… The post Video: Full Documentary – The Triumph & Tragedy of WCCW appeared first on WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/365272-video-full-documentary-the-triumph-tragedy-of-wccw/",
    "publishedAt": "2025-10-24T03:18:43+00:00",
    "category": "general"
  },
  {
    "title": "WWE Hall of Famer hospitalized with serious health issues",
    "summary": "Book of Pro Wrestlers revealed on X, that WWE Hall of Famer Abdulla The Butcher (real name Lawrence… The post WWE Hall of Famer hospitalized with serious health issues appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/365259-wwe-hall-of-famer-hospitalized-with-serious-health-issues/",
    "publishedAt": "2025-10-24T01:37:56+00:00",
    "category": "wwe"
  },
  {
    "title": "Video: Former AEW star is now a car salesman",
    "summary": "Former AEW star Marko Stunt (real name Noah Nelms) is now selling cars. The 29-year old Stunt retired… The post Video: Former AEW star is now a car salesman appeared first on WWE News, WWE Results,...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/aew-news/365254-video-former-aew-star-is-now-a-car-salesman/",
    "publishedAt": "2025-10-24T01:22:44+00:00",
    "category": "wwe"
  },
  {
    "title": "WWF Raw Results – 10/23/95 (No. 1 Contender’s Battle Royal, History Corner on the Shawn Michaels incident in Syracuse)",
    "summary": "WWF Monday Night Raw ResultsOctober 23, 1995Brandon, Manitoba, Canada (Keystone Centre)Commentary: Vince McMahon and Jerry “The King” LawlerResults… The post WWF Raw Results – 10/23/95 (No. 1...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/retro/365250-wwf-raw-results-october-23-1995-brandon/",
    "publishedAt": "2025-10-24T00:53:33+00:00",
    "category": "wwe"
  },
  {
    "title": "Goldberg says ‘Some girl’ broke his streak, WWE ‘did it on purpose’",
    "summary": "During his appearance on the latest episode of the Real Talk with Mike Burke podcast, WWE Hall of… The post Goldberg says ‘Some girl’ broke his streak, WWE ‘did it on purpose’ appeared first on WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/365237-goldberg-says-some-girl-broke-his-streak-wwe-did-it-on-purpose/",
    "publishedAt": "2025-10-23T19:55:44+00:00",
    "category": "wwe"
  }
]