[
  {
    "title": "NXT Star Confirms Recent Injury Will Require Surgery",
    "summary": "Ridge Holland confirmed that an injury he sustained over the weekend will require surgery. Holland was in action at TNA’s Impact television tapings in Edmonton, Alberta, Canada over the weekend....",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582172-nxt-star-confirms-injury-will-require-surgery",
    "publishedAt": "2025-09-29T18:10:10+00:00",
    "category": "tna"
  },
  {
    "title": "AEW's Gates Of Agony, Toa Liona & Bishop Kaun, Offer Contract Status Updates",
    "summary": "AEW stars Bishop Kaun and Toa Liona of the Gates of Agony offer updates on their contractual status, confirming reports that the duo has re-signed",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1981873/aew-gates-of-agony-toa-liona-bishop-kaun-contract-status-updates/",
    "publishedAt": "2025-09-29T17:48:43+00:00",
    "category": "aew"
  },
  {
    "title": "AEW Executives Are Proud Of MJF, Even If Fans And The Roster Aren’t",
    "summary": "AEW President Tony Khan gives huge praise to MJF’s recent transition into movies. Former AEW World Champion MJF debuted as an actor this summer in Adam Sandler’s Happy Gilmore 2, where he played one...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582096-tony-khan-on-aew-star-mjf-movie-career",
    "publishedAt": "2025-09-29T17:44:31+00:00",
    "category": "aew"
  },
  {
    "title": "WWE Hall of Famer Calls Cody Rhodes The Best Interview In The Business",
    "summary": "One of the key skills required to be a professional wrestler is to be able to cut a promo. There are several stars in WWE who are considered to have the gift of the gab. Stars like Roman Reigns, Seth...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582162-wwe-hall-of-famer-calls-cody-rhodes-the-best-interview-in-the-business",
    "publishedAt": "2025-09-29T17:42:03+00:00",
    "category": "wwe"
  },
  {
    "title": "Bayley Reacts to Ricky Saints Becoming the New NXT World Champion",
    "summary": "This past Saturday night was one of NXT’s major Premium Live Events of the year, No Mercy. The show featured four Title matches. Three of the four champions managed to retain their championships. The...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582156-bayley-reacts-to-ricky-saints-becoming-the-new-nxt-world-champion",
    "publishedAt": "2025-09-29T17:39:45+00:00",
    "category": "general"
  },
  {
    "title": "“WWE Unreal” Season 2 Is Reportedly In Production",
    "summary": "The acclaimed docuseries “WWE Unreal” is officially in the works for a second season, with filming already underway. A new report from Fightful Select has confirmed what many fans had been hoping...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-unreal-season-reportedly-production/",
    "publishedAt": "2025-09-29T17:27:34+00:00",
    "category": "wwe"
  },
  {
    "title": "John Laurinaitis And Vince McMahon’s Assistants Subpoenaed In Shareholder Lawsuit",
    "summary": "In November 2023, WWE shareholders, led by the Ohio Laborers’ Pension Fund, filed a lawsuit alleging that Vince McMahon orchestrated WWE’s 2023 merger with Endeavor to ensure he remained in power,...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/john-laurinaitis-and-vince-mcmahons-assistants-subpoenaed-in-shareholder-lawsuit",
    "publishedAt": "2025-09-29T17:18:08+00:00",
    "category": "wwe"
  },
  {
    "title": "Bret Hart: Hulk Hogan Would Rather See A Company Sink Than Help The Next Guy",
    "summary": "When Bret Hart ascended to the top of WWE, it came after the old guard like Hulk Hogan, Ultimate Warrior, and Randy Savage were being phased down and out. Bret was given an initial push as a singles...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/bret-hart-hulk-hogan-would-rather-see-a-company-sink-than-help-the-next-guy",
    "publishedAt": "2025-09-29T17:05:49+00:00",
    "category": "wwe"
  },
  {
    "title": "Kevin Nash: When It Comes Down To It, Right Now, On A Week In, Week Out Basis, Cody Rhodes Is The Best Interview In Wrestling",
    "summary": "Kevin Nash believes Cody Rhodes is the best interview in wrestling. Since returning to WWE at WrestleMania 38, Cody Rhodes has kicked off many of his promos with 'what do you guys want to talk...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/kevin-nash-when-it-comes-down-to-it-right-now-on-a-week-in-week-out-basis-cody-rhodes-is-the-best-interview-in-wrestling",
    "publishedAt": "2025-09-29T16:53:49+00:00",
    "category": "wwe"
  },
  {
    "title": "Dave Meltzer Offers Injury Updates On AEW Stars",
    "summary": "Dave Meltzer provides an injury timeline for Jay White and Colten Gunn following Ace Austin's involvement with the Bang Bang Gang.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1981692/aew-dave-meltzer-injuries-jay-white-colten-gunn/",
    "publishedAt": "2025-09-29T16:46:51+00:00",
    "category": "aew"
  },
  {
    "title": "Kevin Nash On His Heart Procedure: ‘Total Time Until We Hit The IHOP Was Under An Hour’",
    "summary": "WWE Hall of Famer Kevin Nash has provided an update on his health following a recent heart procedure, detailing a quick and smooth recovery process. On the latest episode of his Kliq This podcast,...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/kevin-nash-his-heart-procedure-total-time-until-hit-ihop-under-hour/",
    "publishedAt": "2025-09-29T16:43:15+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE ID Title Bout Set For Beyond Wrestling Event",
    "summary": "The WWE ID Title will be defended at Beyond Wrestling Bound For The Floor on October 12. Cappuccino Jones will be defending the title against TJ Crawford. This will mark the first defense for Jones,...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/wwe-id-title-bout-set-for-beyond-wrestling-event",
    "publishedAt": "2025-09-29T16:41:48+00:00",
    "category": "wwe"
  },
  {
    "title": "Chelsea Green Defends Nia Jax Amidst Fan Criticism",
    "summary": "Chelsea Green has come to the defense of Nia Jax following a wave of online criticism directed at the former champion after an incident on the September 26 episode of Friday Night SmackDown. During a...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/chelsea-green-defends-nia-jax-amidst-fan-criticism/",
    "publishedAt": "2025-09-29T16:37:47+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Star Chelsea Green Defends 'Locker Room Leader' Nia Jax Following SmackDown Finish",
    "summary": "WWE's Chelsea Green comes to the defense of Nia Jax, calling her a \"locker room leader,\" following the disjointed SmackDown finish involving Jax",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1981675/wwe-smackdown-chelsea-green-nia-jax-match-botch-finish/",
    "publishedAt": "2025-09-29T16:37:17+00:00",
    "category": "wwe"
  },
  {
    "title": "Tony Khan Says Current AEW Star Has One of Wrestling’s Best Minds",
    "summary": "Tony Khan says former WWE star MVP has one of wrestling’s best minds. MVP joined AEW last year and reunited with Bobby Lashley and Shelton Benjamin to form the Hurt Syndicate. The faction has quickly...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582098-aew-tony-khan-former-wwe-star-best-minds",
    "publishedAt": "2025-09-29T16:36:42+00:00",
    "category": "aew"
  },
  {
    "title": "Natalya Credits Vince McMahon For WWE Women Wrestling In Saudi Arabia",
    "summary": "Natalya credits Vince McMahon for paving the way for female WWE superstars to compete in Saudi Arabia. WWE’s partnership with Saudi Arabia has reached unprecedented heights since 2018, when Vince...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582108-natalya-credits-vince-mcmahon-for-wwe-women-wrestling-in-saudi-arabia",
    "publishedAt": "2025-09-29T16:35:05+00:00",
    "category": "wwe"
  },
  {
    "title": "Bandido Begs Brody King To Apologize To Speedball Mike Bailey: I'm Sorry For Trying To End Your Life Speedball",
    "summary": "Bandido asks Brody King to apologize to Speedball Mike Bailey. At AEW All Out on September 20th, the AEW World Tag Team Championships would be on the line in a ladder match that amongst others,...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/bandido-begs-brody-king-to-apologize-to-speedball-mike-bailey-im-sorry-for-trying-to-end-your-life-speedball",
    "publishedAt": "2025-09-29T16:01:15+00:00",
    "category": "aew"
  },
  {
    "title": "Gabby Forza Shares Personal Connection To Cancer While Discussing C4 Fighting Back 14",
    "summary": "Gabby Forza discusses the personal significance of participating in a charity event that supports cancer research. Gabby Forza and Bear Bronson recently took part in C4's Fighting Back 14: Wrestling...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/gabby-forza-shares-personal-connection-to-cancer-while-discussing-c4-fighting-back-14",
    "publishedAt": "2025-09-29T16:00:00+00:00",
    "category": "general"
  },
  {
    "title": "WWE Accidentally Spoils Current NXT Storyline",
    "summary": "Oops — WWE inadvertently spoiled a new NXT storyline. This weekend’s NXT No Mercy event featured an NXT Women’s Championship match between Jacy Jayne, the current champion, and her latest challenger,...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582154-wwe-accidentally-spoils-nxt-storyline",
    "publishedAt": "2025-09-29T15:55:40+00:00",
    "category": "wwe"
  },
  {
    "title": "Undertaker Addresses Talk Of Using WWE Clout To Help Wife Michelle McCool's Career",
    "summary": "WWE Hall of Famer The Undertaker dispels any rumors that he used his backstage influence to advance his wife, Michelle McCool's career in WWE.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1981601/wwe-undertaker-rumors-clout-help-wife-michelle-mccool-career/",
    "publishedAt": "2025-09-29T15:53:20+00:00",
    "category": "wwe"
  },
  {
    "title": "Speedball Mike Bailey Says MJF vs Mistico Was 'Fantastic For Many Reasons'",
    "summary": "Speedball Mike Bailey says MJF vs Mistico was fantastic. At CMLL's 92nd Anniversary show in a title vs mask match, Mistico would defeat MJF to capture the CMLL World Light Heavyweight Championship...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/speedball-mike-bailey-says-mjf-vs-mistico-was-fantastic-for-many-reasons",
    "publishedAt": "2025-09-29T15:44:11+00:00",
    "category": "general"
  },
  {
    "title": "Former WWE Star Braun Strowman Says He's In Talks To Play Classic Horror Role",
    "summary": "According to former WWE wrestler Braun Strowman, he is being considered to take on the role of one of horror's most iconic villains.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1981574/wwe-braun-strowman-horror-role-jason-voorhees-friday-13th/",
    "publishedAt": "2025-09-29T15:36:51+00:00",
    "category": "wwe"
  },
  {
    "title": "Matt and Jeff Hardy Do Surprise Run-In On Kai Cenat Live Stream",
    "summary": "Matt and Jeff Hardy had a surprise up their sleeves. The current TNA Tag Team Champions made a surprise run-in during Kai Cenat’s Mafiathon 3 stream. The brothers’ iconic theme song, Loaded, cued up...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582146-matt-and-jeff-hardy-surprise-run-in-kai-cenat-live-stream",
    "publishedAt": "2025-09-29T15:31:54+00:00",
    "category": "tna"
  },
  {
    "title": "Bully Ray Thinks This Star Is Next For Lesnar After Squashing Cena At Wrestlepalooza",
    "summary": "Bully Ray has discussed who could face Brock Lesnar next in WWE, and how Lesnar's match against John Cena could set up his next opponent.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1981328/wwe-wresltepalooza-brock-lesnar-john-cena-next-gunther/",
    "publishedAt": "2025-09-29T15:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Sister Promotion Zuffa Boxing Lands Media Rights Deal",
    "summary": "WWE's sister promotion Zuffa Boxing has landed its first media rights deal with Paramount, which will become the home for the UFC and Zuffa in January 2026.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1981532/wwe-tko-zuffa-boxing-media-rights-paramount/",
    "publishedAt": "2025-09-29T15:09:20+00:00",
    "category": "wwe"
  },
  {
    "title": "Kevin Nash: Cody Rhodes Is The “Best Interview In Wrestling” Right Now",
    "summary": "WWE Hall of Famer Kevin Nash has declared Undisputed WWE Champion Cody Rhodes the “best interview in wrestling” on a week-in, week-out basis. Speaking on his Kliq This podcast, the wrestling legend...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/kevin-nash-cody-rhodes-best-interview-wrestling-right-now/",
    "publishedAt": "2025-09-29T15:00:11+00:00",
    "category": "wwe"
  },
  {
    "title": "OVW TV Show Moving Ahead, But Not On Netflix",
    "summary": "There will likely be another season of the Wrestlers docu series, which previously aired on Netflix, although it won't be available on the streamer's platform.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1981303/ovw-tv-show-moving-ahead-not-netflix/",
    "publishedAt": "2025-09-29T15:00:00+00:00",
    "category": "general"
  },
  {
    "title": "MLP Wrestling Announces REENA Rumble For October",
    "summary": "Maple Leaf Pro Wrestling announced MLP REENA Rumble for October 27. Matt Hardy, Carlito, Colt Cabana will be part of the event. The show will benefit REENA, a non-profit organization dedicated to...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/mlp-wrestling-announces-reena-rumble-for-october",
    "publishedAt": "2025-09-29T14:43:23+00:00",
    "category": "general"
  },
  {
    "title": "Tony Khan: Toni Storm “Is An Icon,” And “That Iconic Presence Was Always Inside Of Her”",
    "summary": "AEW President Tony Khan has some high praise for “Timeless” Toni Storm, calling the four-time former AEW Women’s World Champion an “icon” in the promotion. In a recent interview with Going Ringside,...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/tony-khan-toni-storm-icon-iconic-presence-always-inside-her/",
    "publishedAt": "2025-09-29T14:43:15+00:00",
    "category": "aew"
  },
  {
    "title": "Former WWE Star Confirms He’s Semi-Retired From Wrestling",
    "summary": "Braun Strowman says he is semi-retired from pro wrestling. In May, former WWE star Braun Strowman was released along with several other wrestlers. Since then, many of these stars have moved to the...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1582104-former-wwe-star-semi-retired-wrestling-braun-strowman",
    "publishedAt": "2025-09-29T14:35:04+00:00",
    "category": "general"
  },
  {
    "title": "Eric Bischoff Addresses Cultural Reason Behind WWE WrestleMania 43 Backlash",
    "summary": "Eric Bischoff has discussed why fans are dismayed by WWE's decision to move WrestleMania to Saudi Arabia, citing a cultural reason for it.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1981238/wwe-wrestlemania-43-eric-bischoff-backlash-american-culture-super-bowl/",
    "publishedAt": "2025-09-29T14:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE NXT Star Injured At TNA Taping",
    "summary": "A longtime WWE performer seemed to suffer an injury to his leg while wrestling at a \"TNA Impact\" taping over the weekend.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1981456/wwe-nxt-star-injured-tna-taping/",
    "publishedAt": "2025-09-29T14:15:19+00:00",
    "category": "wwe"
  },
  {
    "title": "Kevin Nash Explains The One Thing He Would Have Changed About AJ Lee’s Return",
    "summary": "On his Kliq This podcast, Kevin Nash offered a creative critique of AJ Lee’s recent return to WWE, suggesting that the moment would have been more effective if she had presented a completely...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/kevin-nash-explains-one-thing-would-have-changed-about-lees-return/",
    "publishedAt": "2025-09-29T13:55:12+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Raw Preview: IC Title Match, Tag Team Action, More!",
    "summary": "WWE Raw will air live today on Netflix and emanate from the Lenovo Center in Raleigh, North Carolina.… The post WWE Raw Preview: IC Title Match, Tag Team Action, More! appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/top-story/362898-wwe-raw-preview-ic-title-match-tag-team-action-more/",
    "publishedAt": "2025-09-29T13:06:39+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW Star Makes Surprise Return To The Ring",
    "summary": "AEW star Anthony Ogogo has made his return to the squared circle after more than a year away, but it was not in an AEW or ROH ring. The Olympic bronze medalist stepped into the ropeless ring of Josh...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/aew-star-makes-surprise-return-ring/",
    "publishedAt": "2025-09-29T12:12:02+00:00",
    "category": "aew"
  },
  {
    "title": "WWE Website Accidentally Spoils Big Storyline",
    "summary": "WWE’s own website accidentally spoiled a storyline development from this past weekend’s NXT No Mercy premium live event. During the NXT Women’s Championship match between champion Jacy Jayne and...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-website-accidentally-spoils-big-storyline/",
    "publishedAt": "2025-09-29T11:06:03+00:00",
    "category": "wwe"
  },
  {
    "title": "Former WWE Star Braun Strowman In Talks For “Friday The 13th” Role",
    "summary": "Former WWE Universal Champion Adam Scherr, known to wrestling fans as Braun Strowman, has his sights set on a new, terrifying role: Jason Voorhees. In a recent interview with Collider’s Perri...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/former-wwe-star-braun-strowman-talks-friday-13th-role/",
    "publishedAt": "2025-09-29T11:02:41+00:00",
    "category": "general"
  },
  {
    "title": "Backstage News On Start Times For Upcoming WWE Raw Episodes",
    "summary": "The start time for WWE’s flagship program, Monday Night Raw, has been fluctuating in recent weeks, and a new report has provided insight into the company’s strategy behind the changes. For the past...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/backstage-news-start-times-upcoming-wwe-raw-episodes/",
    "publishedAt": "2025-09-29T10:59:27+00:00",
    "category": "wwe"
  },
  {
    "title": "Former WWE Champion reveals he is ‘semi-retired’ from wrestling",
    "summary": "In an interview with Collider, Braun Strowman revealed his status in professional wrestling while discussing an upcoming role… The post Former WWE Champion reveals he is ‘semi-retired’ from wrestling...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/362894-former-wwe-champion-reveals-he-is-semi-retired-from-wrestling/",
    "publishedAt": "2025-09-29T05:34:45+00:00",
    "category": "wwe"
  },
  {
    "title": "MLW takes a shot at WWE for taking WM 43 to Saudi Arabia",
    "summary": "MLW took a shot at WWE during the Fury Road event on Saturday night. Cesar Duran, the on-screen… The post MLW takes a shot at WWE for taking WM 43 to Saudi Arabia appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/misc-news/362884-mlw-takes-a-shot-at-wwe-for-taking-wm-42-to-saudi-arabia/",
    "publishedAt": "2025-09-29T00:44:12+00:00",
    "category": "wwe"
  },
  {
    "title": "Chelsea Green would love to ‘see more’ with WWE women’s titles",
    "summary": "In an interview with CinemaBlend, Chelsea Green looked back on WWE introducing a Women’s United States and Intercontinental… The post Chelsea Green would love to ‘see more’ with WWE women’s titles...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/362882-chelsea-green-would-love-to-see-more-with-wwe-womens-titles/",
    "publishedAt": "2025-09-29T00:22:14+00:00",
    "category": "wwe"
  },
  {
    "title": "Gail Kim responds to report regarding contacting AEW for an opportunity",
    "summary": "Gail Kim took to social media, responding to a recent report from journalist B.J. Bethel about her contacting… The post Gail Kim responds to report regarding contacting AEW for an opportunity...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/362872-gail-kim-responds-report-contact-aew-opportunity/",
    "publishedAt": "2025-09-28T20:21:08+00:00",
    "category": "aew"
  },
  {
    "title": "NXT talent injured at Saturday night’s TNA IMPACT tapings, match stopped",
    "summary": "NXT talent Ridge Holland was injured during Saturday night’s TNA IMPACT tapings at the Edmonton Expo Centre in… The post NXT talent injured at Saturday night’s TNA IMPACT tapings, match stopped...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/362867-nxt-talent-injured-at-saturday-nights-tna-impact-tapings-match-stopped/",
    "publishedAt": "2025-09-28T20:05:25+00:00",
    "category": "tna"
  },
  {
    "title": "Update on the status of AEW’s Hologram",
    "summary": "AEW CEO, President and General Manager Tony Khan announced Saturday on social media that Hologram has significant injuries… The post Update on the status of AEW’s Hologram appeared first on WWE News,...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/362850-update-on-the-status-of-aews-hologram/",
    "publishedAt": "2025-09-28T13:57:49+00:00",
    "category": "wwe"
  },
  {
    "title": "TNA IMPACT SPOILERS: Titles change hands at TV tapings",
    "summary": "Below are the spoilers from the TNA IMPACT tapings that took place on Saturday night. The tapings took… The post TNA IMPACT SPOILERS: Titles change hands at TV tapings appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/impact-wrestling-news/362841-tna-impact-spoilers-titles-change-hands-at-tv-tapings/",
    "publishedAt": "2025-09-28T03:52:30+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW Collision program note for 10/4; Lineup for Dynamite 6-Yr Anniversary – 2.5 hour special!",
    "summary": "It was announced during the 9/27 episode of AEW Collision, that next week’s show (which will be taped),… The post AEW Collision program note for 10/4; Lineup for Dynamite 6-Yr Anniversary – 2.5 hour...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/362834-aew-collision-programming-note-for-10-4-lineup-for-6-year-anniversary-of-dynamite-2-5-hour-special/",
    "publishedAt": "2025-09-28T03:37:03+00:00",
    "category": "aew"
  }
]