[
  {
    "title": "Lacey Lane Claps Back At ‘Idiots’ That Claim She Copied NXT Star’s Name",
    "summary": "Lacey Lane made her AEW debut this week, appearing during Dynamite‘s special Title Tuesday episode, but it wasn’t without some online controversy. Lane’s debut came in a match against Mercedes Moné,...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584017-lacey-lane-claps-back-at-idiots-that-claim-she-copied-nxt-stars-name",
    "publishedAt": "2025-10-09T00:50:46+00:00",
    "category": "aew"
  },
  {
    "title": "Carlos Silva Provides Update On TNA TV Deal: \"We’re Working With Lawyers To Get The Deal Together... We’re Gonna Be On A New Platform In 2026\"",
    "summary": "TNA President Carlos Silva had a new meeting this week. The subject of a new television deal for TNA Wrestling has come up as the promotion's President, Carlos Silva, has been making the media...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/carlos-silva-provides-update-on-tna-tv-deal-were-working-with-lawyers-to-get-the-deal-together-were-gonna-be-on-a-new-platform-in-2026",
    "publishedAt": "2025-10-09T00:49:29+00:00",
    "category": "tna"
  },
  {
    "title": "Spoiler: Former Try Guys Member And Internet Personality Wrestles At 10/8 AEW Collision Taping",
    "summary": "An influencer debuts for AEW. On Wednesday, October 8, All Elite Wrestling taped the October 11 episode of AEW Collision at Daily's Place in Jacksonville, Florida. In what was advertised as a bonus...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/spoiler-former-try-guys-member-and-internet-personality-wrestles-at-10-8-aew-collision-taping",
    "publishedAt": "2025-10-09T00:44:30+00:00",
    "category": "aew"
  },
  {
    "title": "Report: Details on new contract for former WWE Champion",
    "summary": "Following the news that Xavier Wood re-signed with WWE, Fightful Select has reported that Kofi Kingston quietly re-signed… The post Report: Details on new contract for former WWE Champion appeared...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/363709-report-details-on-new-contract-for-former-wwe-champion/",
    "publishedAt": "2025-10-09T00:42:01+00:00",
    "category": "wwe"
  },
  {
    "title": "Former WWE Superstar Expected To Guest Coach At The Performance Center — Report",
    "summary": "WWE continues to have former talents come to the Performance Center in guest coach roles. The WWE Performance Center opened in Orlando back in 2013. Since then, the facility has been used to produce...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584018-former-wwe-superstar-expected-to-guest-coach-at-the-performance-center-report",
    "publishedAt": "2025-10-09T00:37:16+00:00",
    "category": "wwe"
  },
  {
    "title": "Steve Maclin: It Felt Good To Go Back To The Performance Center As The Character I Created Outside Of The Performance Center",
    "summary": "Steve Maclin discusses his return to WWE NXT. In the lead-up to NXT x TNA Showdown, Steve Maclin appeared on WWE NXT as a part of the group of TNA stars that invaded the Orlando-based brand. This was...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/steve-maclin-wwe-nxt-260480",
    "publishedAt": "2025-10-09T00:22:57+00:00",
    "category": "wwe"
  },
  {
    "title": "Roman Reigns Believes Current Storyline With Jey Uso Is A ‘Beautiful Opportunity’",
    "summary": "It appears that Roman Reigns has been manipulating Jey Uso in recent weeks on WWE RAW. WWE Superstar Roman Reigns was a recent guest on The Pat McAfee Show. When asked about his current storyline...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584012-roman-reigns-believes-current-storyline-with-jey-uso-is-a-beautiful-opportunity",
    "publishedAt": "2025-10-09T00:14:01+00:00",
    "category": "wwe"
  },
  {
    "title": "Kevin Nash Says This WWE Star Checked Up On Him After Recent Heart Procedure",
    "summary": "Kevin Nash says the former AEW star checked-in on him after his recent procedure.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1991363/wwe-kevin-nash-heart-procedure-cody-rhodes-check-in/",
    "publishedAt": "2025-10-09T00:11:44+00:00",
    "category": "wwe"
  },
  {
    "title": "Je’Von Evans Reflects On Sharing The Ring With This WWE Legend",
    "summary": "WWE NXT star Je’Von Evans recently reflected on sharing the ring with veteran star Randy Orton. Je’Von is one of the rising young stars in WWE. In a short span of time, Evans has impressed everyone...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1583999-jevon-evans-reflects-on-sharing-the-ring-with-this-wwe-legend",
    "publishedAt": "2025-10-08T23:52:30+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE/ECW Legend Raven Diagnosed With Early-Onset Parkinson’s Disease",
    "summary": "On The Ariel Helwani Show, wrestling icon Raven (Scott Levy) spoke candidly about his current health, including a diagnosis of early-onset Parkinson’s disease and other issues stemming from his long...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-ecw-legend-raven-diagnosed-early-onset-parkinsons-disease/",
    "publishedAt": "2025-10-08T23:46:06+00:00",
    "category": "wwe"
  },
  {
    "title": "Roman Reigns: I Feel Like Crap, But We're Gonna Go Head Against The Wall, Goldberg-Style",
    "summary": "Roman Reigns is set to take on Bronson Reed at WWE Crown Jewel in an Australian Street Fight. Ahead of the event, Roman spoke to Pat McAfee, who asked how the \"Tribal Chief\" is feeling ahead of the...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/roman-reigns-i-feel-like-crap-but-were-gonna-go-head-against-the-wall-goldberg-style",
    "publishedAt": "2025-10-08T23:44:40+00:00",
    "category": "wwe"
  },
  {
    "title": "Stephanie Vaquer Reveals Illness That Almost Kept Her Off WWE Wrestlepalooza",
    "summary": "Stephanie Vaquer captured the Women’s World Championship at Wrestlepalooza, but an illness she suffered before Wrestlepalooza almost canceled the match. At WWE Wrestlepalooza, Vaquer managed to...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1583994-stephanie-vaquer-reveals-illness-that-almost-kept-her-off-wwe-wrestlepalooza",
    "publishedAt": "2025-10-08T23:41:29+00:00",
    "category": "general"
  },
  {
    "title": "TNA Announces The Hardy’s WWE NXT Tag Team Titles Are Also On The Line At Bound For Glory",
    "summary": "TNA Wrestling has announced that the scheduled bout between The Hardys and Team 3D at this Sunday’s Bound for Glory pay-per-view will now have both the TNA and NXT World Tag Team Championships on the...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/tna-announces-hardys-wwe-nxt-tag-team-titles-also-line-bound-glory/",
    "publishedAt": "2025-10-08T23:23:46+00:00",
    "category": "general"
  },
  {
    "title": "Kevin Nash Reacts To Claims That Roman Reigns Is Overrated",
    "summary": "WWE Hall of Famer Kevin Nash recently shared his opinion on claims that Roman Reigns is an overrated star. Since adopting the Tribal Chief persona, Roman Reigns has taken WWE to new heights. The OTC...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1583985-kevin-nash-reacts-to-claims-that-roman-reigns-is-overrated",
    "publishedAt": "2025-10-08T23:23:01+00:00",
    "category": "wwe"
  },
  {
    "title": "Godfather: Undertaker And I Blew $50,000 At A Casino One Night",
    "summary": "The Godfather and The Undertaker were often associated during their time in WWE, hanging out backstage as members of the BSK along with Yokozuna, Rikishi, Savio Vega, and the Godwins. Speaking to...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/godfather-undertaker-and-i-blew-50000-at-a-casino-one-night",
    "publishedAt": "2025-10-08T23:10:46+00:00",
    "category": "wwe"
  },
  {
    "title": "Mike Santana Pays Respect To Current Champion Following WWE NXT Showdown",
    "summary": "Potential future TNA World Champion Mike Santana has a lot of respect for a current WWE NXT Champion. Last night at WWE NXT Showdown, Mike Santana and Ricky Saints led their respective teams in the...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584003-mike-santana-pays-respect-to-current-champion-following-wwe-nxt-showdown",
    "publishedAt": "2025-10-08T23:05:56+00:00",
    "category": "wwe"
  },
  {
    "title": "Mercedes Moné Challenging For Title At Indie Show In Denmark",
    "summary": "Moné is looking to capture more gold. The reigning AEW TBS Champion Mercedes Moné is scheduled to be in action for the BODYSLAM Wrestling promotion in Denmark. It has been revealed that she'll be...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/mercedes-mone-challenging-for-title-at-indie-show-in-denmark",
    "publishedAt": "2025-10-08T22:47:54+00:00",
    "category": "general"
  },
  {
    "title": "WWE Locks Down A Former World Champion For The Rest Of The Decade",
    "summary": "Former WWE Champion Kofi Kingston has re-signed with WWE on a new long-term contract, according to a report from Fightful Select. The news comes just a day after his New Day stablemate, Xavier Woods,...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-locks-down-former-world-champion-rest-decade/",
    "publishedAt": "2025-10-08T22:36:22+00:00",
    "category": "wwe"
  },
  {
    "title": "Lacey Lane (Kayden Carter) Responds To Belief That She Copied Jacy Jayne's Name",
    "summary": "Lacey Lane responds to her doubters. AEW Dynamite Title Tuesday was a huge night for Lacey Lane, as she made her AEW debut by challenging Mercedes Mone for the TBS Championship. Despite being...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/lacey-lane-kayden-carter-responds-to-belief-that-she-copied-jacy-jaynes-name",
    "publishedAt": "2025-10-08T22:34:00+00:00",
    "category": "aew"
  },
  {
    "title": "Kevin Nash Explains Why Bret Hart Is So “Misunderstood” By Fans",
    "summary": "On the latest episode of the Kliq This podcast, WWE Hall of Famer Kevin Nash gave his perspective on the career and personality of his contemporary, Bret “The Hitman” Hart, addressing why he believes...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/kevin-nash-explains-why-bret-hart-misunderstood-fans/",
    "publishedAt": "2025-10-08T22:06:54+00:00",
    "category": "wwe"
  },
  {
    "title": "Roman Reigns talks Street Fighter prep, Jey Uso’s rise in WWE",
    "summary": "Roman Reigns appeared on the most recent edition of The Pat McAfee Show, with the conversation largely centered… The post Roman Reigns talks Street Fighter prep, Jey Uso’s rise in WWE appeared first...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/363705-roman-reigns-talks-street-fighter-prep-jey-usos-rise-in-wwe/",
    "publishedAt": "2025-10-08T22:06:34+00:00",
    "category": "wwe"
  },
  {
    "title": "Update On Kofi Kingston’s WWE Status — Report",
    "summary": "With Xavier Woods locking down a new WWE contract recently, what does that mean for his New Day tag team partner, Kofi Kingston? Yesterday, it was revealed that Xavier Woods had signed a new...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1583997-update-on-kofi-kingston-wwe-status-report",
    "publishedAt": "2025-10-08T22:06:23+00:00",
    "category": "wwe"
  },
  {
    "title": "Blake Monroe vs. Zaria Added To 10/14 WWE NXT",
    "summary": "Blake Monroe will battle Zaria on the October 14th episode of WWE NXT. The bout was confirmed on social media. Monroe confronted NXT Women's North American Champion Sol Ruca at WWE NXT Showdown....",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/blake-monroe-vs-zaria-added-to-10-14-wwe-nxt",
    "publishedAt": "2025-10-08T22:01:41+00:00",
    "category": "wwe"
  },
  {
    "title": "Cody Rhodes' October Schedule, Top WWE NXT Moments, More | Fight Size",
    "summary": "Here is your fight size update for Wednesday, October 8, 2025. - Cody Rhodes has revealed his schedule for the month of October: https://twitter.com/CodyRhodes/status/1976022892371685852 - Top 10 NXT...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/cody-rhodes-wwe-260444",
    "publishedAt": "2025-10-08T22:00:44+00:00",
    "category": "wwe"
  },
  {
    "title": "Tommy Dreamer Compares WWE NXT Vs. TNA To Other Wrestling Invasions",
    "summary": "Tommy Dreamer compares the ongoing WWE NXT vs. TNA invasion storyline to past wrestling invasions, including the infamous WWE Invasion angle Dreamer was part of",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1991303/tommy-dreamer-compares-nxt-tna-other-wrestling-invasions/",
    "publishedAt": "2025-10-08T21:58:22+00:00",
    "category": "wwe"
  },
  {
    "title": "Triple H Highlights Cody Rhodes’ Dedication Ahead Of WWE Crown Jewel",
    "summary": "Paul “Triple H” Levesque, WWE’s Chief Content Officer, took to social media to commend the work ethic of Undisputed WWE Champion Cody Rhodes. In a public post, Levesque detailed the demanding travel...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/triple-highlights-cody-rhodes-dedication-ahead-wwe-crown-jewel/",
    "publishedAt": "2025-10-08T21:35:09+00:00",
    "category": "wwe"
  },
  {
    "title": "New Stipulation Added To Major TNA Bound For Glory Match",
    "summary": "The stakes have been raised for an important matchup this weekend at TNA Bound For Glory. Tuesday night on WWE NXT vs. TNA Showdown, The Hardy Boyz defeated DarkState in a Winner Take All match to...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1583990-new-stipulation-added-to-major-tna-bound-for-glory-match",
    "publishedAt": "2025-10-08T21:34:51+00:00",
    "category": "wwe"
  },
  {
    "title": "Booker T: NXT And TNA Crossover Is “So Good For Both Sides”",
    "summary": "As a commentator for WWE NXT, Booker T has had a front-row seat for the brand’s ongoing crossover with TNA Wrestling. On his Hall of Fame podcast, the Hall of Famer shared his excitement for the...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/booker-nxt-tna-crossover-good-both-sides/",
    "publishedAt": "2025-10-08T21:18:52+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW Star MVP Details His Battle With Panic Attacks",
    "summary": "On the podcast Marking Out with MVP & Dwayne Swayze, professional wrestler MVP discussed his recent TED Talk at Lone Star College, titled “Real Men Get Help,” where he detailed his personal struggles...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/mvp-details-his-battle-panic-attacks-powerful-ted-talk/",
    "publishedAt": "2025-10-08T21:10:42+00:00",
    "category": "aew"
  },
  {
    "title": "WWE NXT Star Je’Von Evans Reveals How A Triple H Segment Inspired His Career",
    "summary": "On a special anniversary episode of the “No-Contest Wrestling” podcast, hosts O’Shea Jackson Jr. and TJ Jefferson were joined by NXT’s rising star, Je’Von Evans, who detailed his journey from a...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/nxts-jevon-evans-details-his-journey-indie-grind-wwe-stardom/",
    "publishedAt": "2025-10-08T21:07:08+00:00",
    "category": "wwe"
  },
  {
    "title": "Kevin Nash Thinks A Former WWE Star Helped Drew McIntyre Break Into Hollywood",
    "summary": "Besides competing in the WWE ring, Drew McIntyre is also making waves in Hollywood. Kevin Nash believes a former WWE star is helping him make his mark in Hollywood. McIntyre recently landed a role in...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1583978-kevin-nash-thinks-a-former-wwe-star-helped-drew-mcintyre-break-into-hollywood",
    "publishedAt": "2025-10-08T20:57:44+00:00",
    "category": "wwe"
  },
  {
    "title": "New Report Details AEW All In: Texas Funding & Attendance",
    "summary": "A new report details financial information regarding AEW All In: Texas, including funding, attendance figures, and other events that were originally planned",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1991250/new-report-details-aew-all-in-texas-funding-attendance/",
    "publishedAt": "2025-10-08T20:56:34+00:00",
    "category": "aew"
  },
  {
    "title": "John Cena Expected To Wrestle At WWE Survivor Series In San Diego",
    "summary": "As John Cena’s legendary career comes to a close, new details have emerged about his final scheduled appearances for WWE. On a recent episode of Wrestling Observer Radio, Dave Meltzer provided an...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/john-cena-expected-wrestle-wwe-survivor-series-san-diego/",
    "publishedAt": "2025-10-08T20:27:28+00:00",
    "category": "wwe"
  },
  {
    "title": "Blake Monroe: “To My Bones, I Am A Heel. I’m Not Likable”",
    "summary": "In a recent interview on Busted Open Radio, rising NXT star Blake Monroe discussed her journey in WWE thus far, her character’s evolution, and her deep-seated belief that she is a natural heel....",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/blake-monroe-bones-heel-not-likable/",
    "publishedAt": "2025-10-08T20:10:05+00:00",
    "category": "wwe"
  },
  {
    "title": "TNA Bound For Glory Match Updated Following Title Change At WWE NXT Showdown",
    "summary": "A match from last night's WWE NXT Showdown had ramifications on a bout planned for this weekend's TNA Bound for Glory, with the promotion announcing a change.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1991178/wwe-nxt-showdown-tna-bound-for-glory-2025-tag-team-championships/",
    "publishedAt": "2025-10-08T19:52:05+00:00",
    "category": "wwe"
  },
  {
    "title": "John Cena Doesn't Want To Analyze WWE Heel Run Yet: 'Hindsight Is A Waste Of Time'",
    "summary": "What would John Cena do differently about his heel turn or retirement tour? Now is not the time for such questions, according to the man himself.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1991138/wwe-john-cena-heel-turn-analysis-hindsight/",
    "publishedAt": "2025-10-08T19:14:18+00:00",
    "category": "wwe"
  },
  {
    "title": "Actual attendance for AEW All In Texas PPV revealed, reimbursement from state less",
    "summary": "AEW’s All In pay-per-view at Globe Life Field in Arlington, Texas this past July qualified for public reimbursement… The post Actual attendance for AEW All In Texas PPV revealed, reimbursement from...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/363698-actual-attendance-for-aew-all-in-texas-ppv-revealed-reimbursement-from-state-less/",
    "publishedAt": "2025-10-08T18:51:44+00:00",
    "category": "general"
  },
  {
    "title": "AEW Collision Viewership & Ratings Report: 10/4/25",
    "summary": "Much like WWE Raw, WWE SmackDown, WWE NXT, and \"AEW Dynamite, AEW Collision sees its ratings suffer in the wake of Nielsen's new ratings system",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1991108/aew-collision-viewership-ratings-october-4-2025/",
    "publishedAt": "2025-10-08T18:49:07+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW Collision viewership and key demo down for earlier timeslot",
    "summary": "Last Saturday’s taped episode of AEW Collision that aired coast-to-coast on TNT at 7:00 pm ET/4:00 pm, came… The post AEW Collision viewership and key demo down for earlier timeslot appeared first on...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/aew-news/363700-aew-collision-viewership-and-key-demo-down-for-earlier-timeslot/",
    "publishedAt": "2025-10-08T18:24:57+00:00",
    "category": "aew"
  },
  {
    "title": "AEW Broadcaster Taz Says He'll Be Away From Dynamite 'For Some Time'",
    "summary": "Taz has revealed that he's set to undergo a surgery that will keep him away from the commentary booth on \"AEW Dynamite\" for the time being.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1991068/aew-taz-dynamite-time-off-medical-shoulder-replacement-surgery/",
    "publishedAt": "2025-10-08T18:13:17+00:00",
    "category": "aew"
  },
  {
    "title": "Backstage Report On Santos Escobar's WWE Status After Being Moved To Alumni Section",
    "summary": "PWInsider Elite provides an update on Santos Escobar's future with WWE following contract expiry.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1991054/wwe-santos-escobar-contract-report-status-new-deal-extension/",
    "publishedAt": "2025-10-08T18:03:26+00:00",
    "category": "wwe"
  },
  {
    "title": "Matt Hardy Details How The WWE NXT Tag Champs Approach The Remainder Of Their Careers",
    "summary": "Matt Hardy details how he and his brother Jeff, the new WWE NXT Tag Team Championships, are approaching the remainder of their Hall of Fame careers",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1991051/tna-matt-hardy-approach-remaining-career-championships-legacy/",
    "publishedAt": "2025-10-08T18:01:23+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE talent reportedly re-signs with the company",
    "summary": "According to a new report from PWInsider Elite, Santos Escobar has reportedly re-signed with WWE. The report notes… The post WWE talent reportedly re-signs with the company appeared first on WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/top-story/363695-wwe-talent-reportedly-re-signs-with-the-company/",
    "publishedAt": "2025-10-08T17:36:47+00:00",
    "category": "wwe"
  },
  {
    "title": "Kevin Nash Thinks Drew McIntyre Is Getting Some Hollywood Help From A Former WWE Star",
    "summary": "WWE Hall of Famer Kevin Nash thinks that Drew McIntyre is getting some Hollywood help from a former WWE star turned certified box office draw",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1990948/wwe-kevin-nash-drew-mcintyre-movie-career-help-hollywood-dave-bautista/",
    "publishedAt": "2025-10-08T16:51:32+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE SmackDown viewership and key demo down",
    "summary": "Last Friday’s WWE SmackDown on the USA network came in with 1.030 million viewers and a 0.23 rating… The post WWE SmackDown viewership and key demo down appeared first on WWE News, WWE Results, AEW...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/363691-wwe-smackdown-viewership-and-key-demo-down-4/",
    "publishedAt": "2025-10-08T13:55:34+00:00",
    "category": "wwe"
  },
  {
    "title": "‘Wipeout’ with John Cena returning on TBS; Wrestling series renewed;",
    "summary": "TBS is advertising a new season of ‘Wipeout’ with John Cena and Nicole Byers as host. The new season is… The post ‘Wipeout’ with John Cena returning on TBS; Wrestling series renewed; appeared first...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/363685-wipeout-with-john-cena-returning-on-tbs-wrestling-series-renewed/",
    "publishedAt": "2025-10-08T03:46:28+00:00",
    "category": "general"
  },
  {
    "title": "3-Hour block of AEW TV on TBS and HBO Max next Wednesday",
    "summary": "During the special episode of Title Tuesday, AEW announced 3-hours of programming for next Wednesday. AEW will air… The post 3-Hour block of AEW TV on TBS and HBO Max next Wednesday appeared first on...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/aew-news/363682-3-hour-block-of-aew-tv-on-tbs-and-hbo-max-next-wednesday/",
    "publishedAt": "2025-10-08T03:16:28+00:00",
    "category": "aew"
  },
  {
    "title": "NXT Showdown Quick Results – 10/7/25 (NXT vs. TNA, New Champions Crowned)",
    "summary": "Below are the quick results with highlights from the Tuesday night’s NXT vs. TNA Showdown that aired live… The post NXT Showdown Quick Results – 10/7/25 (NXT vs. TNA, New Champions Crowned) appeared...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/363644-nxt-showdown-quick-results-10-7-25-nxt-vs-tna-new-champions-crowned/",
    "publishedAt": "2025-10-08T02:47:35+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW Dynamite Results – 10/7/25 (Title Tuesday: 2.5-Hour Special)",
    "summary": "AEW Dynamite ResultsOctober 7, 2025Jacksonville, Florida (Daily’s Place)Results by: Alex Kahrs of Wrestleview.com It is…Tuesday, my dudes…and you… The post AEW Dynamite Results – 10/7/25 (Title...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/top-story/363598-aew-dynamite-results-10-7-25-title-tuesday-2-5-hour-special/",
    "publishedAt": "2025-10-08T00:00:00+00:00",
    "category": "aew"
  }
]