[
  {
    "title": "Backstage Report On Plans For Seth Rollins At WWE WrestleMania 42 Prior To Recent Injury",
    "summary": "Dave Meltzer reveals who Seth Rollins was scheduled to face at WrestleMania 42 before he was reportedly written off television due to injury.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1996764/wwe-seth-rollins-match-planned-wrestlemania-42-injury-roman-reigns/",
    "publishedAt": "2025-10-14T18:17:58+00:00",
    "category": "wwe"
  },
  {
    "title": "TNA Star Hopes To See Ridge Holland In The Company After Injury Recovery",
    "summary": "A TNA star has expressed interest in seeing Ridge Holland join the company once he recovers from injury. Ridge Holland appears to be going through a streak of bad luck. The former Brawling Brute...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584806-tna-star-hopes-to-see-ridge-holland-in-the-company-after-injury-recovery",
    "publishedAt": "2025-10-14T18:15:55+00:00",
    "category": "wwe"
  },
  {
    "title": "Torrie Wilson Reveals Why Her Dog Chloe Stopped Traveling With Her In WWE",
    "summary": "Torrie Wilson says her dog, Chloe, loved making towns, but there’s a good reason she took her off the road. Chloe was a regular fixture on WWE TV during Torrie Wilson’s tenure with the company....",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1573343-torrie-wilson-why-her-dog-chloe-stopped-traveling-wwe",
    "publishedAt": "2025-10-14T18:11:39+00:00",
    "category": "wwe"
  },
  {
    "title": "Backstage Update On In-Ring Return Timeline For WWE HOFer Rey Mysterio",
    "summary": "PWInsider has put out a backstage update on the in-ring return of WWE Hall of Famer Rey Mysterio and what a potential timeline might look like.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1996751/in-ring-return-timeline-wwe-hofer-rey-mysterio/",
    "publishedAt": "2025-10-14T18:10:45+00:00",
    "category": "wwe"
  },
  {
    "title": "Darby Allin Baffles Ariel Helwani After Pouring Water On His Face During Interview",
    "summary": "Darby Allin embraces the extreme. Given his track record as a daredevil, the element of surprise is now relatively rare for former AEW TNT Champion Darby Allin. Still, he managed to stun journalist...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584791-darby-allin-baffles-ariel-helwani-after-pouring-water-on-his-face-during-interview",
    "publishedAt": "2025-10-14T18:10:14+00:00",
    "category": "aew"
  },
  {
    "title": "IYO SKY: My Debut Match Was Awful, Everything Was So Bad",
    "summary": "IYO SKY recalls her debut match in the world of pro wrestling. While IYO has only recently managed to make her way into the main event scene in WWE, SKY has been a pro wrestler for almost twenty...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/iyo-sky-my-debut-match-was-awful-everything-was-so-bad",
    "publishedAt": "2025-10-14T18:06:56+00:00",
    "category": "general"
  },
  {
    "title": "IYO SKY Says Her WrestleMania 41 Win Meant So Much To Her And 'Also So Much To Japanese People'",
    "summary": "IYO SKY discusses her WrestleMania 41 WWE Women's World Title victory. At WrestleMania 41 the WWE Women's World Title was on the line at the event in Las Vegas in a triple threat match featuring IYO...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/iyo-sky-says-her-wrestlemania-41-win-meant-so-much-to-her-and-also-so-much-to-japanese-people",
    "publishedAt": "2025-10-14T17:51:16+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE LFG Talent Confirms Release",
    "summary": "Summer Sorrell says goodbye to WWE, but hello to her next chapter. Over the weekend, WWE reportedly released several developmental talents, including WWE LFG season two competitor Summer Sorrell....",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584777-wwe-lfg-talent-confirms-release",
    "publishedAt": "2025-10-14T17:32:36+00:00",
    "category": "wwe"
  },
  {
    "title": "Darby Allin: I've Been Putting Myself Through Hell Training For This I Quit Match",
    "summary": "Darby Allin says that he's putting himself through hell preparing for his I Quit match with Jon Moxley. Darby is currently scheduled to take on Jon Moxley at AEW WrestleDream this weekend in an I...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/darby-allin-ive-been-putting-myself-through-hell-training-for-this-i-quit-match",
    "publishedAt": "2025-10-14T17:31:32+00:00",
    "category": "aew"
  },
  {
    "title": "Darby Allin: I’m So Grateful I’m At The Mental Spot I’m In Right Now",
    "summary": "Darby Allin is happy where he’s at. Earlier this year, Darby Allin conquered the lofty task of climbing Mount Everest, with the planting of an AEW flag as proof. Beyond the excitement, Allin says the...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584758-darby-allin-im-so-grateful-im-at-the-mental-spot-im-in-right-now",
    "publishedAt": "2025-10-14T17:30:58+00:00",
    "category": "aew"
  },
  {
    "title": "Report: WWE's Seth Rollins Might Need Surgery, Though Questions Linger Over Injury",
    "summary": "A new report from PWInsider sheds light on what the talk is around the WWE locker room amidst the Seth Rollins injury and what they're hearing.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1996663/wwe-seth-rollins-surgery-questions-injury/",
    "publishedAt": "2025-10-14T17:22:02+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW couple to open ‘Victory Roll’ board game cafe in Indiana, grand opening set for Thursday",
    "summary": "ABC57 in South Bend, Indiana is reporting that AEW’s Ruby Soho and “Cool Hand” Angelo Parker are set… The post AEW couple to open ‘Victory Roll’ board game cafe in Indiana, grand opening set for...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/364351-aew-couple-to-open-victory-roll-board-game-cafe-in-indiana-grand-opening-set-for-thursday/",
    "publishedAt": "2025-10-14T17:19:15+00:00",
    "category": "aew"
  },
  {
    "title": "Released WWE Star To Tony Khan: “Your Boy Is Ready…Call Me”",
    "summary": "His time in WWE may have come to an abrupt and unexpected end, but BJ Ray is already looking to his future, and he has his sights set on AEW. Just days after the news of his WWE release broke, the...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/released-wwe-star-tony-khan-your-boy-readycall/",
    "publishedAt": "2025-10-14T17:17:05+00:00",
    "category": "aew"
  },
  {
    "title": "Becky Lynch Reacts To Bron Breakker Spearing Seth Rollins: I'm Gone For One Week",
    "summary": "Becky Lynch reacts to The Vision's implosion. On the October 13th edition of WWE Monday Night RAW, CM Punk would earn himself the number one contendership for the WWE World Heavyweight Championship...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/becky-lynch-reacts-to-bron-breakker-spearing-seth-rollins-im-gone-for-one-week",
    "publishedAt": "2025-10-14T17:11:39+00:00",
    "category": "wwe"
  },
  {
    "title": "Googling '(Wrestler) Cagematch' Works Again",
    "summary": "Fans who often use Cagematch for research or other purposes probably got in the habit of simply googling \"(Wrestler) Cagematch\" and being greeted with the wrestler homepage on Cagematch or their...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/googling-wrestler-cagematch-works-again",
    "publishedAt": "2025-10-14T17:01:34+00:00",
    "category": "general"
  },
  {
    "title": "What Could Have Been: What If Adam Copeland Had Stayed In WWE Instead Of Going To AEW?",
    "summary": "As we approach the second anniversary of Adam Copeland's AEW WrestleDream debut, Wrestling Inc must ask: what if he had stayed in WWE as Edge?",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1996614/what-could-have-been-adam-copeland-wwe-instead-aew/",
    "publishedAt": "2025-10-14T16:59:14+00:00",
    "category": "wwe"
  },
  {
    "title": "Mike 'Cash Flo' Walden Reflects On Tulsa King Role, Getting Compliments From Sylvester Stallone",
    "summary": "Tulsa King, starring Sylvester Stallone on Paramount+, is in its third season. The series, which features Stallone and his daughter, also features professional wrestler Mike Walden, also known as...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/mike-cash-flo-walden-reflects-on-tulsa-king-role-getting-compliments-from-sylvester-stallone",
    "publishedAt": "2025-10-14T16:58:47+00:00",
    "category": "general"
  },
  {
    "title": "Darby Allin On AEW-DC Comics Crossover: Anything That's Cross-Promoting With Different Cultures Is Always Fun",
    "summary": "Darby Allin discusses the AEW-DC Comics Crossover event. Earlier this month, AEW and DC announced that there will be an upcoming two part crossover event where the heroes of the Justice League will...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/darby-allin-on-aew-dc-comics-crossover-anything-thats-cross-promoting-with-different-cultures-is-always-fun",
    "publishedAt": "2025-10-14T16:57:18+00:00",
    "category": "aew"
  },
  {
    "title": "Paul Walter Hauser Blasts WWE For Raising Ticket Prices: 'Be A Real Person, You D***'",
    "summary": "Golden Globe Award winner Paul Walter Hauser has slammed WWE for their rising ticket prices that are pricing out hardcore fans.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1996595/paul-walter-hauser-blasts-wwe-raising-ticket-prices-real-person/",
    "publishedAt": "2025-10-14T16:48:57+00:00",
    "category": "wwe"
  },
  {
    "title": "Booker T: WWE NXT Talent Have Around ‘Two And A Half Years’ To Make It",
    "summary": "During his Hall of Fame podcast, NXT commentator Booker T addressed the recent surprising release of Wes Lee and other NXT stars from WWE. He used the news as a stern warning for all talent currently...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/booker-wwe-nxt-talent-have-two-half-years-make/",
    "publishedAt": "2025-10-14T16:45:27+00:00",
    "category": "wwe"
  },
  {
    "title": "Orange Cassidy On What DC Comics Villain He'd Like To Fight: Probably Lex Luthor, Just Because He's Just A Smart Dude, Right?",
    "summary": "Orange Cassidy names what DC Comics villain he'd like to fight given the chance. Earlier this month, AEW and DC announced that there will be an upcoming two part crossover event where the heroes of...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/orange-cassidy-on-what-dc-comics-villain-hed-like-to-fight-probably-lex-luthor-just-because-hes-just-a-smart-dude-right",
    "publishedAt": "2025-10-14T16:29:38+00:00",
    "category": "aew"
  },
  {
    "title": "AEW Stars Opening Unique Business In Indiana",
    "summary": "Two AEW stars are set to open a unique business this week. ABC 57 profiled Ruby Soho and Angelo Parker’s new business, a wrestling and board game-themed café called Victory Roll. The couple, credited...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584768-aew-stars-opening-unique-business-in-indiana",
    "publishedAt": "2025-10-14T16:10:22+00:00",
    "category": "aew"
  },
  {
    "title": "Original Plans For Seth Rollins At WWE WrestleMania 42 — Report",
    "summary": "A blockbuster match between Seth Rollins and Roman Reigns was tentatively scheduled for WWE WrestleMania 42, according to a new report. Despite crossing paths on multiple occasions, Rollins and...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584781-original-plans-seth-rollins-wwe-wrestlemania-42",
    "publishedAt": "2025-10-14T16:09:09+00:00",
    "category": "wwe"
  },
  {
    "title": "Seth Rollins’ Injury Reportedly Legitimate, May Require Surgery",
    "summary": "The shocking betrayal of Seth Rollins by his own faction, The Vision, on this past week’s episode of Raw was reportedly not a long-term planned storyline, but a creative decision “necessitated” by a...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/seth-rollins-injury-reportedly-legitimate-may-require-surgery/",
    "publishedAt": "2025-10-14T16:03:59+00:00",
    "category": "wwe"
  },
  {
    "title": "The Usos On Hidden Talents In The Bloodline: We Can Draw, Paint, Play Piano",
    "summary": "Jimmy and Jey Uso speak on the hidden talents of their illustrious family. Jimmy Uso and Jey Uso are part of one of the greatest wrestling families of all time. With the recent focus on their...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/the-usos-on-hidden-talents-in-the-bloodline-we-can-draw-paint-play-piano",
    "publishedAt": "2025-10-14T16:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Female Wrestler Was Near-Death And In Coma, Now Chasing WWE Dream",
    "summary": "Bailey McRoberts has lived to tell her inspirational tale. In the ring, she’s known as Teagan Thorne, “The Eternal Enigma” filling the Midwest independent circuit with eerie energy. In real life,...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584747-female-wrestler-was-near-death-and-in-coma-now-chasing-wwe-dream",
    "publishedAt": "2025-10-14T15:16:54+00:00",
    "category": "wwe"
  },
  {
    "title": "Dave Meltzer Assesses Accuracy Of The Smashing Machine, Starring WWE Legend The Rock",
    "summary": "Dave Meltzer discussed whether The Smashing Machine accurately portrayed true stories about Mark Kerr and compared it to a pro wrestling movie.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1996076/wwe-rock-dave-meltzer-accuracy-smashing-machine-mark-kerr/",
    "publishedAt": "2025-10-14T15:00:00+00:00",
    "category": "general"
  },
  {
    "title": "WWE Evolve Talent Summer Sorrell Breaks Silence Following Release",
    "summary": "WWE EVOLVE/LFG talent Summer Sorrell breaks her silence following her release, and indicates that she will continue he wrestling career outside of WWE",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1996382/wwe-evolve-summer-sorrell-statement-release/",
    "publishedAt": "2025-10-14T14:53:41+00:00",
    "category": "wwe"
  },
  {
    "title": "AAA Star In Action, #1 Contender’s Battle Royal Added To 10/14 WWE NXT",
    "summary": "More matches have been announced for the October 14 episode of WWE NXT. First, a Battle Royal will take place to determine the number one contender for NXT Women’s Champion Jacy Jayne. The match will...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1584715-aaa-star-in-action-1-contenders-battle-royal-added-to-10-14-wwe-nxt",
    "publishedAt": "2025-10-14T14:48:55+00:00",
    "category": "wwe"
  },
  {
    "title": "Injured WWE Star Nearing An In-Ring Return?",
    "summary": "WWE Hall of Famer Rey Mysterio is expected to be at the WWE Performance Center this week as he continues to work towards being medically cleared for a return to the ring. According to a new report...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/injured-wwe-star-nearing-ring-return/",
    "publishedAt": "2025-10-14T14:45:50+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE CCO Triple H Calls This Crown Jewel 2025 Match 'A Love Letter To Pro Wrestling'",
    "summary": "Triple H shares his thoughts on the legendary final match between John Cena and AJ Styles at WWE Crown Jewel.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1996367/wwe-cco-triple-h-crown-jewel-2025-love-letter-pro-wrestling-john-cena-aj-styles/",
    "publishedAt": "2025-10-14T14:42:27+00:00",
    "category": "general"
  },
  {
    "title": "Stephanie Vaquer Teases WWE Women's World Title Defense Against Newly Returned AJ Lee",
    "summary": "WWE Women's World Champion Stephanie Vaquer has discussed the possibility of facing AJ Lee, as well as another former world champion.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1996062/stephanie-vaquer-wwe-womens-world-title-aj-lee-crown-jewel/",
    "publishedAt": "2025-10-14T14:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE's Penta Comments On Possibly Reuniting Former AEW Tag Team, Names Dream Opponents",
    "summary": "Though Penta is happy with his singles run in WWE, he believes it's inevitable that he'll reunite with his brother, Rey Fenix, at some point in the future.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/1996327/wwe-penta-reuniting-former-aew-tag-team-lucha-bros-rey-fenix-dream-opponents-usos/",
    "publishedAt": "2025-10-14T14:24:11+00:00",
    "category": "wwe"
  },
  {
    "title": "Top WWE Star Was Asked To Change Their Name Days Before Main Roster Debut",
    "summary": "On a recent episode of Insight with Chris Van Vliet, WWE superstar IYO SKY shared the surprising, last-minute story of how she changed her name from Io Shirai just days before her main roster debut...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/top-wwe-star-asked-change-their-name-days-before-main-roster-debut/",
    "publishedAt": "2025-10-14T14:19:31+00:00",
    "category": "wwe"
  },
  {
    "title": "Backstage News On Ridge Holland’s WWE Contract Before He Was Released",
    "summary": "A new report from Bryan Alvarez on Wrestling Observer Radio has clarified the contractual status of Ridge Holland, revealing that the recently released star was on an “NXT money” contract, not a more...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/backstage-news-ridge-hollands-wwe-contract-before-released/",
    "publishedAt": "2025-10-14T14:09:51+00:00",
    "category": "wwe"
  },
  {
    "title": "Robert Stone Says His Kids Would Be “Mortified” By His Old Robbie E Gimmick",
    "summary": "It’s been 15 years since Robert Stone made his TNA television debut as the loud, fist-pumping “Robbie E,” and looking back, he has some strong feelings about his early character work. In a recent...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/robert-stone-says-his-kids-would-mortified-his-old-robbie-gimmick/",
    "publishedAt": "2025-10-14T13:00:04+00:00",
    "category": "tna"
  },
  {
    "title": "JBL Names Several Referees Who Should Be In The WWE Hall Of Fame",
    "summary": "On his Something to Wrestle With podcast, JBL made a passionate and detailed case for why referees should be inducted into the WWE Hall of Fame, naming a list of candidates he believes are deserving...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/jbl-names-several-referees-who-should-wwe-hall-fame/",
    "publishedAt": "2025-10-14T13:00:03+00:00",
    "category": "wwe"
  },
  {
    "title": "IYO SKY’s Debut Match Was So ‘Awful’ She Wanted To Quit Wrestling",
    "summary": "During a recent appearance on Insight with Chris Van Vliet, WWE superstar IYO SKY revealed that she had never watched professional wrestling before her own debut. She described the match as so...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/iyo-skys-debut-match-awful-she-wanted-quit-wrestling/",
    "publishedAt": "2025-10-14T11:23:04+00:00",
    "category": "wwe"
  },
  {
    "title": "Big Match Planned For WWE WrestleMania 42",
    "summary": "The shocking implosion of The Vision on Monday Night Raw was a major turning point in WWE, and a new report from Dave Meltzer in the Wrestling Observer Newsletter has shed light on the long-term...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/big-match-planned-wwe-wrestlemania/",
    "publishedAt": "2025-10-14T10:48:31+00:00",
    "category": "wwe"
  },
  {
    "title": "Backstage news on the “shocking angle” done at the end of WWE Raw",
    "summary": "Fightful Select has published backstage news on what is being called the “shocking angle” at the end of… The post Backstage news on the “shocking angle” done at the end of WWE Raw appeared first on...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/top-story/364346-backstage-news-on-the-shocking-angle-done-at-the-end-of-wwe-raw/",
    "publishedAt": "2025-10-14T03:20:21+00:00",
    "category": "wwe"
  },
  {
    "title": "Report: WWE had ‘significant say’ in finish to match at TNA Bound For Glory",
    "summary": "According to an ‘exclusive’ report from The Takedown on SI, WWE “had a significant say in the booking… The post Report: WWE had ‘significant say’ in finish to match at TNA Bound For Glory appeared...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/364332-report-wwe-had-significant-say-in-finish-to-match-at-tna-bound-for-glory/",
    "publishedAt": "2025-10-13T21:25:31+00:00",
    "category": "tna"
  },
  {
    "title": "Ridge Holland’s contract not being renewed by WWE",
    "summary": "Ridge Holland, real name Luke Menzies, announced on his X account that WWE are not renewing his contract.… The post Ridge Holland’s contract not being renewed by WWE appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/364333-ridge-hollands-contract-not-being-renewed-by-wwe/",
    "publishedAt": "2025-10-13T21:17:27+00:00",
    "category": "wwe"
  },
  {
    "title": "Both WWE Intercontinental Titles will be on the line at 10/20 Raw",
    "summary": "Next Monday’s (10/20) episode of WWE will have three title matches on the show. The men’s and women’s… The post Both WWE Intercontinental Titles will be on the line at 10/20 Raw appeared first on WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/364326-both-wwe-intercontinental-titles-will-be-on-the-line-at-10-20-raw/",
    "publishedAt": "2025-10-13T19:28:51+00:00",
    "category": "wwe"
  },
  {
    "title": "Top AEW star crowned new IWGP World Heavyweight Champion",
    "summary": "AEW’s Konosuke Takeshita is the new IWGP World Heavyweight Champion. Takeshita defeated Zack Sabre Jr. at NJPW’s King of… The post Top AEW star crowned new IWGP World Heavyweight Champion appeared...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/aew-news/364321-top-aew-star-crowned-new-iwgp-world-heavyweight-champion/",
    "publishedAt": "2025-10-13T16:40:40+00:00",
    "category": "njpw"
  },
  {
    "title": "WWE Raw Highlights: Crown Jewel Fallout, Seth Rollins attacked by Bron Breakker and Bronson Reed",
    "summary": "WWE has posted highlights from Monday’s Raw, which aired at a special time of 8:00 am ET/5:00 am… The post WWE Raw Highlights: Crown Jewel Fallout, Seth Rollins attacked by Bron Breakker and Bronson...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/364314-wwe-raw-highlights-crown-jewel-fallout-seth-rollins-attacked-by-bron-breakker-and-bronson-reed/",
    "publishedAt": "2025-10-13T16:29:44+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Raw Results – 10/13/25 (LIVE from Perth, Australia)",
    "summary": "WWE Raw ResultsOctober 13, 2025RAC Arena in Perth, Western AustraliaResults by: Alex Kahrs of Wrestleview.com WWE: Then. Now.… The post WWE Raw Results – 10/13/25 (LIVE from Perth, Australia)...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/top-story/364008-wwe-raw-results-10-13-25-live-from-perth-australia/",
    "publishedAt": "2025-10-13T11:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Tony Khan visits Kota Ibushi in the hospital after surgery, leaves him a note",
    "summary": "Kota Ibushi revealed on Instagram Sunday, that Tony Khan visited him in the hospital, after undergoing successful surgery… The post Tony Khan visits Kota Ibushi in the hospital after surgery, leaves...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/aew-news/364241-tony-khan-visits-kota-ibushi-in-the-hospital-after-surgery-leaves-him-a-note/",
    "publishedAt": "2025-10-13T04:35:33+00:00",
    "category": "aew"
  }
]