[
  {
    "title": "Eddie Guerrero Day To Be Celebrated In El Paso, Texas",
    "summary": "November 18, 2025, is officially Eddie Guerrero Day in El Paso, Texas. The late WWE Hall of Famer Eddie Guerrero’s hometown, El Paso, Texas, will honor the legacy of the legendary superstar by...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1589915-eddie-guerrero-day-to-be-celebrated-in-el-paso-texas",
    "publishedAt": "2025-11-10T18:15:11+00:00",
    "category": "wwe"
  },
  {
    "title": "Report: John Cena Set For Action On Tonight's WWE Raw",
    "summary": "John Cena will reportedly challenge for a title on tonight's episode of \"WWE Raw\" from his hometown of Boston, Massachusetts.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2022218/wwe-raw-john-cena-action-dominik-mysterio/",
    "publishedAt": "2025-11-10T18:04:04+00:00",
    "category": "wwe"
  },
  {
    "title": "John Cena Says WWE Raw In Boston Is 'DEFINITELY ONE TO SEE'",
    "summary": "Fans may not be able to see John Cena, but Cena hopes fans will see WWE Raw in Boston on Monday. Cena posted the following message on social media: RAW. BOSTON. ONE LAST TIME. If you can be @TDGarden...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/john-cena-says-wwe-raw-in-boston-is-definitely-one-to-see",
    "publishedAt": "2025-11-10T17:52:57+00:00",
    "category": "wwe"
  },
  {
    "title": "Report On WWE Not Revealing Full John Cena 'Last Time Is Now' Tournament Bracket",
    "summary": "A new report reveals why WWE has not yet revealed all the participants, let alone the full brackets, for the ongoing John Cena \"Last Time is Now\" tournament",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2022186/wwe-not-revealing-full-john-cena-last-time-now-tournament-bracket/",
    "publishedAt": "2025-11-10T17:49:33+00:00",
    "category": "wwe"
  },
  {
    "title": "Luchasaurus Films (Mostly Silent) BTE Outro: Go Knicks!",
    "summary": "Luchasaurus has filmed an outro for BTE. Since Being The Elite returned, the series has featured several AEW stars, particularly in their outro, including Kazuchika Okada, who included a 'Go Knicks!'...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/luchasaurus-films-mostly-silent-bte-outro-go-knicks",
    "publishedAt": "2025-11-10T17:47:06+00:00",
    "category": "aew"
  },
  {
    "title": "John Cena reportedly challenging for IC Title on tonight’s WWE Raw",
    "summary": "Bodyslam.net and F4WOnline are reporting John Cena will be challenging Dominik Mysterio for the WWE Intercontinental Championship on tonight’s… The post John Cena reportedly challenging for IC Title...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/top-story/366646-john-cena-reportedly-challenging-for-ic-title-on-tonights-wwe-raw/",
    "publishedAt": "2025-11-10T17:26:53+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Has Big Plans For Injured Star’s Return — Report",
    "summary": "WWE reportedly has big plans for an injured superstar who has been out of action since May 2025. Zoey Stark landed awkwardly on her right knee during a Money in the Bank qualifying match against Rhea...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1589913-wwe-has-big-plans-for-injured-stars-return-report",
    "publishedAt": "2025-11-10T17:23:50+00:00",
    "category": "wwe"
  },
  {
    "title": "Ken Anderson Reflects on Working with Umaga in His Final Wrestling Match",
    "summary": "Former WWE star Ken Anderson recently shared his memories of being Umaga’s final opponent before his passing in 2009. After leaving WWE, Umaga joined Hulk Hogan’s “Hulkamania: Let The Battle Begin”...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1589887-former-wwe-star-ken-anderson-reflects-on-working-with-umaga",
    "publishedAt": "2025-11-10T17:19:33+00:00",
    "category": "wwe"
  },
  {
    "title": "More Details On Nixon Newell and Miranda Alize Walking Out Of AEW Collision",
    "summary": "More details have emerged on the Nixon Newell and Miranda Alize situation in AEW. PWInsider had reported that Nixon Newell (FKA Tegan Nox in WWE) and Miranda Alize walked out of the November 8 AEW...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1589909-more-details-on-nixon-newell-and-miranda-alize-walking-out-of-aew-collision",
    "publishedAt": "2025-11-10T17:19:05+00:00",
    "category": "aew"
  },
  {
    "title": "Luke Menzies (Ridge Holland) Shuts Down GoFundMe Campaign, Clarifies How Money Will Be Dispersed",
    "summary": "Former WWE Superstar Luke Menzies (Ridge Holland) has shut down the GoFundMe campaign launched to support him and his family and also clarified how the funds will be dispersed. Ridge Holland’s mother...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1589899-luke-menzies-ridge-holland-shuts-down-gofundme-campaign-clarifies-how-money-will-be-dispersed",
    "publishedAt": "2025-11-10T17:18:32+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW's Kazuchika Okada Makes The Case For Main Eventing NJPW WK With Hiroshi Tanahashi",
    "summary": "Kazuchika Okada thinks that his match with Hiroshi Tanahashi deserves the main event, despite not being a world title match.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2022102/aew-njpw-wrestle-kingdom-kazuchika-okada-hiroshi-tanahashi-main-event/",
    "publishedAt": "2025-11-10T17:16:10+00:00",
    "category": "aew"
  },
  {
    "title": "Sting, Kevin Nash, Victoria, RVD, Sgt. Slaughter And More Set For Massive Wrestling Convention This Weekend In Pryor, Oklahoma",
    "summary": "The “Wrestling for Heroes: BIG Wrestling Convention” is scheduled to take place in Pryor, Oklahoma. The three-day event will run from November 14-16, 2025, at the Mayes County Event Center. The event...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/sting-kevin-nash-victoria-rvd-sgt-slaughter-more-set-massive-wrestling-convention-weekend-pryor-oklahoma/",
    "publishedAt": "2025-11-10T17:10:15+00:00",
    "category": "general"
  },
  {
    "title": "Miranda Alize: The Moment You Start Standing Up For Yourself, Everything Shifts.",
    "summary": "Nixon Newell & Miranda Alize left AEW Collision on Saturday instead of competing in their scheduled match against TayJay (Tay Melo & Anna Jay). Fightful Select reported that Nixon and Miranda...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/miranda-alize-the-moment-you-start-standing-up-for-yourself-everything-shifts",
    "publishedAt": "2025-11-10T17:00:12+00:00",
    "category": "aew"
  },
  {
    "title": "Joey Janela: I'm Not The Asshole I Portray On The Internet, I'm A Worker",
    "summary": "Joey Janela is a worker. Janela has been a controversial figure in the world of wrestling for years at this point, as he often says exactly what is on his mind or pokes at fans on social media....",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/joey-janela-im-not-the-asshole-i-portray-on-the-internet-im-a-worker",
    "publishedAt": "2025-11-10T17:00:00+00:00",
    "category": "general"
  },
  {
    "title": "Update On Rhea Ripley's Status For WWE Survivor Series WarGames 2025",
    "summary": "Dave Meltzer discusses WWE's alternative plans for WarGames if Rhea Ripley is unable to compete at Survivor Series.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2022010/wwe-survivor-series-wargames-2025-rhea-ripley-status-stephanie-vaquer/",
    "publishedAt": "2025-11-10T16:41:31+00:00",
    "category": "wwe"
  },
  {
    "title": "Westside Gunn Airs Out Grievances After Being Kicked Out Of WWE Event",
    "summary": "Rapper Westside Gunn airs out grievances with WWE, accusing them of kicking him out of a show and sending legal notices over wrestling references in his music",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2021998/westside-gunn-airs-grievances-kicked-out-wwe-event/",
    "publishedAt": "2025-11-10T16:33:39+00:00",
    "category": "wwe"
  },
  {
    "title": "Bronson Reed Reflects On His Past Year In WWE: Start Acknowledging Your TRIBAL THIEF With Some DAMN RESPECT!",
    "summary": "Bronson Reed reflects on his past year in WWE. It has been a busy year for Bronson Reed for the past twelve months, despite suffering a serious injury at WWE Survivor Series during a War Games match....",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/bronson-reed-reflects-on-his-past-year-in-wwe-start-acknowledging-your-tribal-thief-with-some-damn-respect",
    "publishedAt": "2025-11-10T16:16:19+00:00",
    "category": "wwe"
  },
  {
    "title": "Big John Cena Match Planned For WWE Raw",
    "summary": "A major championship match is reportedly planned for tonight’s episode of Monday Night Raw in Boston. According to a new report from Bodyslam.net, John Cena will challenge Dominik Mysterio for the...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/big-john-cena-match-planned-wwe-raw/",
    "publishedAt": "2025-11-10T16:14:27+00:00",
    "category": "wwe"
  },
  {
    "title": "Backstage Report On Nixon Newell & Miranda Alize Walking Out Of AEW Collision Taping",
    "summary": "Nixon Newell and tag partner Miranda Alize walked out of Saturday's \"AEW Collision,\" with a report offering additional details on the situation.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2021953/aew-nixon-newell-tegan-nox-miranda-alize-walking-out-collision/",
    "publishedAt": "2025-11-10T16:07:39+00:00",
    "category": "aew"
  },
  {
    "title": "Northern Crown Show Seven Results (11/9): New Northern Crown Champion, Steve Maclin Competes",
    "summary": "Northern Crown held its NC Show Seven event on November 9 from Blood Brothers Brewery in Toronto, Canada. Full results (courtesy of Fightful's Joel Pearl) are below. Northern Crown Show Seven Results...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/northern-crown-show-seven-results-11-9-new-northern-crown-champion-steve-maclin-competes",
    "publishedAt": "2025-11-10T16:00:00+00:00",
    "category": "general"
  },
  {
    "title": "Alexa Bliss Would Like To Feature In A Disney Live Action Goofy Movie Remake If Given The Chance",
    "summary": "Alexa Bliss names the Disney live action remake she'd like to star in. For many pro wrestlers, they have outside interests as a distraction to the busy world of professional wrestling and in the...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/alexa-bliss-would-like-to-feature-in-a-disney-live-action-goofy-movie-remake-if-given-the-chance",
    "publishedAt": "2025-11-10T15:58:23+00:00",
    "category": "general"
  },
  {
    "title": "Ridge Holland Says WWE Is Paying For His Upcoming Neck Fusion Surgery",
    "summary": "Luke Menzies, formerly known as Ridge Holland in WWE, announced on Busted Open that WWE is paying for his upcoming neck fusion surgery. This procedure will keep him out of action until at least May...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/ridge-holland-says-wwe-paying-his-upcoming-neck-fusion-surgery/",
    "publishedAt": "2025-11-10T15:23:04+00:00",
    "category": "wwe"
  },
  {
    "title": "Ken Anderson Recalls This WWE Star Generating Massive Heat During His Entrance",
    "summary": "Former WWE star Ken Anderson recently shared a story about JBL getting one of the loudest and most hostile reactions he’s ever seen. Speaking on Elite Wrestle Talk on 99.9 Punk World Radio FM,...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1589890-ken-anderson-wwe-star-generating-massive-heat-entrance",
    "publishedAt": "2025-11-10T15:11:30+00:00",
    "category": "wwe"
  },
  {
    "title": "Former WWE Star Calls Shawn Michaels The Greatest In-Ring Performer Of All Time",
    "summary": "Former WWE star Donovan Dijak reveals why Shawn Michaels is the greatest in-ring performer of all time. Shawn Michaels has become one of the main figures behind the scenes, helping train and guide...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1589879-former-wwe-star-praises-shawn-michaels-as-greatest-in-ring-performer",
    "publishedAt": "2025-11-10T15:07:43+00:00",
    "category": "wwe"
  },
  {
    "title": "PHOTO: Chris Jericho Is Shredded Amid WWE Return Speculation",
    "summary": "Chris Jericho is currently on his longest absence from AEW television, and a new photo showing his shredded physical transformation has only fueled speculation about his future. A recent report from...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/photo-chris-jericho-shredded-amid-wwe-return-speculation/",
    "publishedAt": "2025-11-10T14:58:12+00:00",
    "category": "wwe"
  },
  {
    "title": "November 18 will be Eddie Guerrero Day in El Paso, Texas",
    "summary": "Next Tuesday, November 18 will be Eddie Guerrero Day in El Paso, Texas. The special ceremony will take… The post November 18 will be Eddie Guerrero Day in El Paso, Texas appeared first on WWE News,...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/366641-november-18-will-be-eddie-guerrero-day-in-el-paso-texas/",
    "publishedAt": "2025-11-10T14:55:58+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Star Had Interest In Being Hiroshi Tanahashi’s Final Opponent",
    "summary": "While AEW’s Kazuchika Okada has been set as Hiroshi Tanahashi’s final opponent, there was interest from a top WWE star to be in that spot. According to Dave Meltzer on Wrestling Observer Radio,...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-star-had-interest-being-hiroshi-tanahashis-final-opponent/",
    "publishedAt": "2025-11-10T14:48:55+00:00",
    "category": "wwe"
  },
  {
    "title": "Rikishi Recently Underwent Emergency Surgery",
    "summary": "WWE Hall of Famer Rikishi recently opened up about the emergency surgery he underwent a few weeks ago. A few weeks ago, PWInsider reported that Rikishi had undergone an unexpected medical procedure....",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1589881-wwe-legend-rikishi-shares-update-after-emergency-surgery",
    "publishedAt": "2025-11-10T14:40:18+00:00",
    "category": "wwe"
  },
  {
    "title": "Nixon Newell and Miranda Alize Explain Why They Left AEW Collision",
    "summary": "Former WWE star Tegan Nox, now known as Nixon Newell, and Miranda Alize were set to face TayJay on AEW Collision. However, that match ultimately didn’t happen, as the duo left the taping ahead of the...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1589883-nixon-newell-miranda-alize-explain-aew-collision-exit",
    "publishedAt": "2025-11-10T14:36:47+00:00",
    "category": "aew"
  },
  {
    "title": "Scott Steiner Reflects On Bond With Fellow WWE HOFer Dating Back To Before Wrestling",
    "summary": "Scott Steiner recalled that his friendship with a fellow WWE Hall of Famer began even before the latter entered the world of professional wrestling.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2019558/wwe-scott-steiner-kevin-nash-bond/",
    "publishedAt": "2025-11-10T13:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "REPORT: AEW Showing Interest In Former WWE ID Talent",
    "summary": "AEW President Tony Khan may have his eye on a former WWE ID talent. 22-year-old independent performer Zayda Steel opted out of her WWE ID contract last month in order to pursue other career...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/report-aew-showing-interest-former-wwe-talent/",
    "publishedAt": "2025-11-10T13:16:25+00:00",
    "category": "aew"
  },
  {
    "title": "WWE Raw Preview: John Cena Opens, ‘Last Time Is Now’ Tournament Begins",
    "summary": "WWE Monday Night Raw takes place tonight, November 10, 2025, from the TD Garden in Boston, Massachusetts. The show will feature the final Raw appearance of John Cena in his hometown, two championship...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/wwe-raw-preview-john-cena-opens-last-time-now-tournament-begins/",
    "publishedAt": "2025-11-10T13:11:12+00:00",
    "category": "wwe"
  },
  {
    "title": "John Cena to open tonight’s WWE Monday Night Raw",
    "summary": "WWE Raw airs live globally tonight on Netflix, which emanates from TD Garden in Boston, Massachusetts beginning at… The post John Cena to open tonight’s WWE Monday Night Raw appeared first on WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/top-story/366602-john-cena-to-kick-off-wwe-monday-night-raw/",
    "publishedAt": "2025-11-10T13:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Real Reason Why Drew McIntyre Was Written Off WWE TV",
    "summary": "Drew McIntyre received a storyline suspension on WWE SmackDown after a chaotic main event. According to Wrestling Observer Radio, McIntyre is being written off television as he is taking time off to...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/real-reason-why-drew-mcintyre-written-off-wwe/",
    "publishedAt": "2025-11-10T12:38:08+00:00",
    "category": "wwe"
  },
  {
    "title": "Sheamus Recalls Beating John Cena For WWE World Title: 'That's The Creme De La Creme'",
    "summary": "WWE veteran Sheamus recalls beating John Cena to win his first WWE Championship back at the 2009 TLC pay-per-view.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2019423/wwe-sheamus-john-cena-world-title-creme/",
    "publishedAt": "2025-11-10T04:59:00+00:00",
    "category": "general"
  },
  {
    "title": "Report: Update on WWE return for former champion",
    "summary": "Bodyslam has provided an update on Zoey Stark, following a knee injury she sustained in May. The former… The post Report: Update on WWE return for former champion appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/366634-report-update-on-wwe-return-for-former-champion/",
    "publishedAt": "2025-11-10T04:36:30+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE VAULT – FULL HOME VIDEO: Crunch Classic with “Rowdy” Roddy Piper, The Natural Disasters and more!",
    "summary": "WWE Vault has posted a classic Home Video with action from the Crunch Classic! “Rowdy” Roddy Piper presents… The post WWE VAULT – FULL HOME VIDEO: Crunch Classic with “Rowdy” Roddy Piper, The Natural...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/366629-wwe-vault-full-home-video-crunch-classic-with-rowdy-roddy-piper-the-natural-disasters-and-more/",
    "publishedAt": "2025-11-10T03:29:11+00:00",
    "category": "wwe"
  },
  {
    "title": "Nixon Newell, Miranda Alize give their side of AEW Collision situation",
    "summary": "During a livestream on her Twitch channel, Nixon Newell addressed the situation that developed over the weekend regarding… The post Nixon Newell, Miranda Alize give their side of AEW Collision...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/366622-nixon-newell-miranda-alize-give-their-side-of-aew-collision-situation/",
    "publishedAt": "2025-11-10T03:07:55+00:00",
    "category": "aew"
  },
  {
    "title": "AEW talent makes surprise appearance in Rome",
    "summary": "Mercedes Moné recently defended the BestYa Women’s Championship against Queen Maya at a show in Rome, Italy. Toward… The post AEW talent makes surprise appearance in Rome appeared first on WWE News,...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/aew-news/366617-aew-talent-makes-surprise-appearance-in-rome/",
    "publishedAt": "2025-11-09T23:09:27+00:00",
    "category": "wwe"
  },
  {
    "title": "John Cena Would Go Back In Time For WrestleMania Match With This WWE HOFer",
    "summary": "John Cena reveals that if he could, he would go back in time to have this WrestleMania match with a WWE Hall of Famer and one of the most famous wrestlers ever",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2018263/john-cena-wrestlemania-match-wwe-andre-the-giant/",
    "publishedAt": "2025-11-09T22:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Charlotte Flair Hilariously Reacts To Wardrobe Malfunction On WWE SmackDown",
    "summary": "Charlotte Flair had a hilarious reaction to a wardrobe malfunction that the star had in a recent appearance. During her match against Nia Jax on Friday’s episode of WWE SmackDown, the TV broadcast...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1589844-charlotte-flair-hilariously-reacts-to-wardrobe-malfunction-on-wwe-smackdown",
    "publishedAt": "2025-11-09T22:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Hall Of Famer Rates John Cena's Retirement Run, Speculates On Final Opponent",
    "summary": "WWE Hall of Famer Rikishi rates the retirement run of John Cena and further speculates on who his final opponent could be.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2019360/wwe-rikishi-john-cena-retirement-run-final-opponent/",
    "publishedAt": "2025-11-09T21:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Rap star says he is done supporting WWE over poor treatment, getting kicked out of Raw",
    "summary": "Rap star and longtime WWE fan, Westside Gunn posting a lengthy statement to X Sunday, saying his is… The post Rap star says he is done supporting WWE over poor treatment, getting kicked out of Raw...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/366611-rap-star-says-he-is-done-supporting-wwe-over-poor-treatment-getting-kicked-out-of-raw/",
    "publishedAt": "2025-11-09T20:54:49+00:00",
    "category": "wwe"
  },
  {
    "title": "Ridge Holland to donate money from GoFundMe, says he was not made aware of fundraiser",
    "summary": "Former WWE talent Ridge Holland (real name Luke Menzies) took to social media, releasing a statement regarding the… The post Ridge Holland to donate money from GoFundMe, says he was not made aware of...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/wwe-news/366597-ridge-holland-to-donate-money-from-gofundme-says-he-was-not-made-aware-of-fundraiser/",
    "publishedAt": "2025-11-09T15:30:17+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Hall of Famer speaks on recent six-hour surgery",
    "summary": "During his most recent podcast, WWE Hall of Famer Rikishi confirmed previous reports he underwent surgery. He did… The post WWE Hall of Famer speaks on recent six-hour surgery appeared first on WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/366593-wwe-hall-of-famer-speaks-on-recent-six-hour-surgery/",
    "publishedAt": "2025-11-09T15:18:16+00:00",
    "category": "wwe"
  }
]