[
  {
    "title": "REPORT: Big Names Expected To Be At WWE Raw",
    "summary": "Tonight’s episode of WWE Monday Night Raw is set to take place at the historic Madison Square Garden in New York City. WWE often likes to pack its MSG episodes with major names and events, and...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/report-big-names-expected-wwe-raw/",
    "publishedAt": "2025-11-17T18:17:52+00:00",
    "category": "wwe"
  },
  {
    "title": "Tatum Paxley: Me Having WWE NXT Women’s Title Shows People “You Can Overcome Your Own Thoughts”",
    "summary": "NXT Women’s Champion Tatum Paxley was a guest on SiriusXM’s The Nikki & Brie Show, where she discussed her journey to the title and what she wants her championship reign to represent. When asked by...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/tatum-paxley-having-wwe-nxt-womens-title-shows-people-you-can-overcome-your-own-thoughts/",
    "publishedAt": "2025-11-17T18:12:15+00:00",
    "category": "wwe"
  },
  {
    "title": "Kevin Nash: ‘I’m Just Not Feeling The Fu**ing Kabuki Warriors’",
    "summary": "On the Kliq This podcast, Kevin Nash gave his opinion on Becky Lynch’s heel run and the recent push of The Kabuki Warriors. A fan asked why WWE keeps pushing Lynch as a heel when her run “isn’t...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/kevin-nash-just-not-feeling-fuing-kabuki-warriors/",
    "publishedAt": "2025-11-17T18:11:50+00:00",
    "category": "wwe"
  },
  {
    "title": "Ricky Steamboat Calls AEW A 'First Class Operation'",
    "summary": "Ricky Steamboat feels like AEW is a 'first class operation'. Steamboat was recently part of AEW's Blood And Guts edition of AEW Dynamite earlier this week, featuring on television in a segment with...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/ricky-steamboat-calls-aew-a-first-class-operation",
    "publishedAt": "2025-11-17T18:11:36+00:00",
    "category": "aew"
  },
  {
    "title": "WWE Hall Of Famer Torrie Wilson Announces Birth Of First Child Via Surrogate",
    "summary": "Torrie Wilson is now a mother, with the former WWE star publicly revealing that she and her husband have welcomed their first child together.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2028836/wwe-torrie-wilson-announces-birth-first-child-surrogate/",
    "publishedAt": "2025-11-17T17:53:44+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE NXT Stars Invade TNA Again, Ruin Turning Point Main Event",
    "summary": "One day after invading TNA Impact, several stars from WWE decided to invade the promotion again, this time following the main event of Turning Point",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2028822/wwe-nxt-invade-tna-world-title-main-event-turning-point-nic-nemeth-kazarian/",
    "publishedAt": "2025-11-17T17:44:19+00:00",
    "category": "wwe"
  },
  {
    "title": "Bron Breakker: There Isn’t A Better Time To Bet On Me",
    "summary": "Bron Breakker says he felt completely calm on the day he decided to betray former WWE World Heavyweight Champion Seth Rollins. Last month, Bron Breakker teamed up with Bronson Reed and Paul Heyman on...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591019-wwe-bron-breakker-no-nerves-seth-rollins-split",
    "publishedAt": "2025-11-17T17:33:23+00:00",
    "category": "wwe"
  },
  {
    "title": "New Network Emerges As Potential Suitor For TNA Media Rights Deal",
    "summary": "A new network is reportedly looking to secure TNA Wrestling’s media rights. Amid ongoing speculations about a new media rights deal being in the works for TNA Wrestling, a new report from Jon Alba of...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591069-new-network-emerges-as-potential-suitor-for-tna-media-rights-deal",
    "publishedAt": "2025-11-17T17:33:03+00:00",
    "category": "tna"
  },
  {
    "title": "DDT's Masahiro Takanashi Discharged From Hospital After Completing Inpatient Treatment & Rehabilitation Period",
    "summary": "An official update on Takanashi. It was in March that Masahiro Takanashi suffered cervical vertebrae C5 and C6 fractures when he took a 'Praying Mantis Bomb' during a match in DDT Pro-Wrestling. He...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/ddts-masahiro-takanashi-discharged-from-hospital-after-completing-inpatient-treatment-rehabilitation-period",
    "publishedAt": "2025-11-17T17:26:52+00:00",
    "category": "general"
  },
  {
    "title": "GUNTHER Speaks Ahead Of WWE Raw Return, Confirming He Underwent Surgery",
    "summary": "GUNTHER takes to social media before returning to \"WWE Raw\" on Monday at Madison Square Garden and opens up about recent surgery.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2028786/wwe-raw-gunther-return-confirming-surgery-nose/",
    "publishedAt": "2025-11-17T17:22:52+00:00",
    "category": "wwe"
  },
  {
    "title": "Cody Rhodes Recounts Wrestlers Babysitting Him, Feels Stone Cold Steve Austin Was Only One Who Took It Seriously",
    "summary": "Rhodes shares a story about Steve Austin. A clip from Undisputed WWE Champion Cody Rhodes' appearance on Pardon My Take was posted onto social media, during which Rhodes spoke about the wrestlers who...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/cody-rhodes-recounts-wrestlers-babysitting-him-feels-stone-cold-steve-austin-was-only-one-who-took-it-seriously",
    "publishedAt": "2025-11-17T17:07:38+00:00",
    "category": "wwe"
  },
  {
    "title": "John Cena: “I Really Want To Pave The Way For The Future” Of WWE",
    "summary": "John Cena believes the current WWE roster is the most talented he’s ever seen, and he says he is ready to pass the torch to the next generation of superstars as his career winds down next month....",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/john-cena-really-want-pave-way-future-wwe/",
    "publishedAt": "2025-11-17T16:53:00+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW announces residency for Esports Stadium, return to Hammerstein Ballroom",
    "summary": "As first reported by The Dallas Morning News, AEW is returning for a month-long residency in Arlington, Texas… The post AEW announces residency for Esports Stadium, return to Hammerstein Ballroom...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/aew-news/367326-aew-announces-residency-for-esports-stadium-return-to-hammerstein-ballroom/",
    "publishedAt": "2025-11-17T16:46:10+00:00",
    "category": "aew"
  },
  {
    "title": "AEW Announces Dynamite & Collision Special Episodes For Hammerstein Ballroom Return",
    "summary": "The stars of AEW will be celebrating Christmas in New York City this year as the company will be returning to the Hammerstein Ballroom for two special shows.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2028713/aew-dynamite-collision-christmas-special-episodes-hammerstein-ballroom-nyc/",
    "publishedAt": "2025-11-17T16:40:51+00:00",
    "category": "aew"
  },
  {
    "title": "Torrie Wilson Welcomes A Baby Via Surrogacy",
    "summary": "Torrie Wilson is a mom! The WWE legend announced she and her husband, Justin, recently became parents. The couple welcomed a daughter, Poppi, via surrogacy. Wilson captioned a post of her holding her...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591068-torrie-wilson-welcomes-a-baby-via-surrogacy",
    "publishedAt": "2025-11-17T16:32:52+00:00",
    "category": "wwe"
  },
  {
    "title": "TNA Impact Spoilers From 11/15",
    "summary": "TNA taped content for future episodes of iMPACT and Xplosion on November 15 at Full Sail University in Winter Park, Florida. The spoilers courtesy of PWInsider.com are as follows: Taped for TNA...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591051-tna-impact-spoilers-from-11-15",
    "publishedAt": "2025-11-17T16:32:48+00:00",
    "category": "tna"
  },
  {
    "title": "TNA Apologizes To Fan After Ejection From Event",
    "summary": "Jacob Cohen, the wrestling fan who claimed he was unfairly removed from the recent TNA Turning Point taping, has provided an update on the situation. In a new post on X, Cohen revealed that TNA...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/tna-news/tna-apologizes-fan-after-ejection-event/",
    "publishedAt": "2025-11-17T16:32:06+00:00",
    "category": "tna"
  },
  {
    "title": "Je'Von Evans Explains Why WWE NXT Match Against Ilja Dragunov Is His Favorite",
    "summary": "Je'Von Evans has declared why his match against Ilja Dragunov is his favorite, even better than the one he had against WWE legend Randy Orton.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2028284/wwe-nxt-jevon-evans-ilja-dragunov-favorite-match/",
    "publishedAt": "2025-11-17T16:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "Kevin Nash Defends Triple H’s Role In John Cena’s WWE Raw Segment",
    "summary": "Kevin Nash shared his thoughts on the recent John Cena-focused episode of WWE Monday Night Raw, calling the show “fantastic” during the Kliq This podcast. The show featured John Cena saying his...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/kevin-nash-defends-triple-role-john-cenas-wwe-raw-segment/",
    "publishedAt": "2025-11-17T16:19:27+00:00",
    "category": "wwe"
  },
  {
    "title": "Bully Ray Names The AEW Performer That He Feels The Most Emotionally Invested In",
    "summary": "WWE legend Bully Ray has praised an AEW star, noting that she has recently begun to showcase some unique traits in her character.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2028264/aew-bully-ray-marina-shafir-emotionally-invested/",
    "publishedAt": "2025-11-17T16:00:00+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW Announces Two Shows At Hammerstein Ballroom In December",
    "summary": "All Elite Wrestling (AEW) will be returning to the Hammerstein Ballroom on December 20th and 21st. AEW Dynamite on 34th Street will take place on Saturday, December 20 and AEW Christmas Collision...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/aew-announces-two-shows-at-hammerstein-ballroom-in-december",
    "publishedAt": "2025-11-17T15:59:51+00:00",
    "category": "aew"
  },
  {
    "title": "AEW Announces Month-Long Residency In Texas",
    "summary": "AEW is headed back to Texas for another residency in January 2026. The Dallas Morning News‘ Joey Hayden reported that AEW will host a month-long residency at Esports Stadium in Arlington, Texas. The...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591052-aew-announces-month-long-residency-in-texas",
    "publishedAt": "2025-11-17T15:53:17+00:00",
    "category": "aew"
  },
  {
    "title": "AEW Star Rebel Opens Up About Serious Health Issues",
    "summary": "AEW star Rebel has made a heartbreaking announcement about her health issues and has asked for everyone’s prayers and support. Rebel, who’s known for being the on-screen personal assistant to former...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591043-aew-star-rebel-opens-up-about-serious-health-issues",
    "publishedAt": "2025-11-17T15:50:55+00:00",
    "category": "aew"
  },
  {
    "title": "Wrestling World Reacts To The Death Of Bob Caudle",
    "summary": "Many within the wrestling industry pay tribute to NWA announcer Bob Caudle, who passed away at the age of 95 this past weekend.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2028614/wrestling-world-reacts-death-bob-caudle/",
    "publishedAt": "2025-11-17T15:49:49+00:00",
    "category": "general"
  },
  {
    "title": "AEW Announces Residency At ESports Stadium In January",
    "summary": "All Elite Wrestling announced the promotion will return to the ESports Stadium in Arlington, TX in January 2026 for AEW Collision. Four episodes of AEW Collision will be aired from the stadium. Dates...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/aew-announces-residency-at-esports-arena-in-january-aew-collision",
    "publishedAt": "2025-11-17T15:41:45+00:00",
    "category": "aew"
  },
  {
    "title": "Former WWE NXT Champ Trick Williams Reflects On In-Ring Moment With The Undertaker",
    "summary": "WWE NXT Trick Williams has discussed about his segment with The Undertaker on NXT, expressing pride in being in the ring with the legendary star.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2028239/wwe-nxt-trick-williams-undertaker-reflects-in-ring-moment/",
    "publishedAt": "2025-11-17T15:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW Announces January 2026 Residency In Dallas, Texas",
    "summary": "All Elite Wrestling will be kicking off the new year with a return to North Texas. For the first time since AEW put more than 25,000 people inside Globe Life Field for “AEW All In: Texas“ over the...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/aew-news/aew-announces-january-2026-residency-dallas-texas/",
    "publishedAt": "2025-11-17T15:24:53+00:00",
    "category": "aew"
  },
  {
    "title": "Nor Diana Felt 'Really Blessed And Grateful' Following Her House Of Glory Match With Mercedes Mone",
    "summary": "Nor Diana reflects on her bout with Mercedes Mone at House Of Glory. At House Of Glory Superclash earlier this week, Nor Diana would defend the APAC Wrestling Women's Championship against someone who...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/nor-diana-felt-really-blessed-and-grateful-following-her-house-of-glory-match-with-mercedes-mone",
    "publishedAt": "2025-11-17T15:24:16+00:00",
    "category": "general"
  },
  {
    "title": "Individual WrestleMania 42 Tickets Go On Sale On November 28",
    "summary": "WWE issued the following: INDIVIDUAL EVENT TICKETS FOR WRESTLEMANIA® 42 AT ALLEGIANT STADIUM IN LAS VEGAS ON SALE ON BLACK FRIDAY Tickets for WrestleMania Saturday and WrestleMania Sunday On Sale...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/individual-wrestlemania-tickets-sale-november/",
    "publishedAt": "2025-11-17T15:20:07+00:00",
    "category": "wwe"
  },
  {
    "title": "Ricky Steamboat On Women’s Blood And Guts: ‘I Didn’t Care For It’",
    "summary": "WWE Hall of Famer Ricky “The Dragon” Steamboat made an appearance on the November 12 episode of AEW Dynamite, a special “Blood and Guts” show from Greensboro, North Carolina. Following his...",
    "source": "Wrestling News",
    "url": "https://wrestlingnews.co/wwe-news/ricky-steamboat-womens-blood-guts-didnt-care/",
    "publishedAt": "2025-11-17T15:00:34+00:00",
    "category": "aew"
  },
  {
    "title": "WINC Watchlist: Hangman Adam Page's First AEW World Championship Reign",
    "summary": "With Adam Page walking into AEW Full Gear 2025 as world champion, WINC Watchlist revisits his first world title reign, which began at Full Gear 2021!",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2020358/winc-watchlist-hangman-adam-page-first-aew-world-championship-reign/",
    "publishedAt": "2025-11-17T15:00:00+00:00",
    "category": "aew"
  },
  {
    "title": "Shayna Baszler On Her And Ronda Rousey Possibly Sharing A Wrestling Ring Again: Never Say Never",
    "summary": "Shayna Baszler comments on the possibility of she and Ronda Rousey being in a wrestling ring together again. While pro wrestling has it's own Four Horsewomen, there is also an MMA version of the...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/shayna-baszler-on-her-and-ronda-rousey-possibly-sharing-a-wrestling-ring-again-never-say-never",
    "publishedAt": "2025-11-17T14:58:47+00:00",
    "category": "general"
  },
  {
    "title": "Ric Flair makes apology for leaving last week’s AEW Dynamite early, confirms injury",
    "summary": "WWE Hall of Famer “The Nature Boy” Ric Flair took to social media, apologizing for leaving last Wednesday’s… The post Ric Flair makes apology for leaving last week’s AEW Dynamite early, confirms...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/aew-news/367320-ric-flair-makes-apology-for-leaving-last-weeks-aew-dynamite-early-confirms-injury/",
    "publishedAt": "2025-11-17T14:54:48+00:00",
    "category": "aew"
  },
  {
    "title": "Ric Flair Apologizes For Leaving AEW Taping Early",
    "summary": "Ric Flair was happy to be at last week’s AEW taping, despite needing to leave early. Flair and Ricky Steamboat were advertised to appear on the AEW Dynamite: Blood and Guts television special....",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591044-ric-flair-apologizes-for-leaving-aew-taping-early",
    "publishedAt": "2025-11-17T14:53:26+00:00",
    "category": "aew"
  },
  {
    "title": "Pro Wrestling Photographer George Tahinos Has Passed Away",
    "summary": "Wrestleview is sad to report that George Tahinos, a famed wrestling photographer in the Northeast area of the… The post Pro Wrestling Photographer George Tahinos Has Passed Away appeared first on WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/misc-news/367313-pro-wrestling-photographer-george-tahinos-has-passed-away/",
    "publishedAt": "2025-11-17T14:44:50+00:00",
    "category": "general"
  },
  {
    "title": "Shayna Baszler: Coaching Is Something That's Very Fulfilling For Me",
    "summary": "Shayna Baszler discusses wanting to be a coach. Earlier this year, Shayna would be listed as a producer from an episode of WWE NXT, something that led to fans speculating if she had taken on a new...",
    "source": "Fightful",
    "url": "https://www.fightful.com/wrestling/shayna-baszler-coaching-is-something-thats-very-fulfilling-for-me",
    "publishedAt": "2025-11-17T14:35:47+00:00",
    "category": "wwe"
  },
  {
    "title": "Dominik Mysterio Explains How He Won WWE’s Backstage Trust",
    "summary": "Dominik Mysterio says he gained WWE’s trust after joining The Judgment Day, which helped him grow more confident in the ring. Dominik Mysterio first worked as a babyface, teaming with his father, Rey...",
    "source": "Wrestlezone",
    "url": "https://www.wrestlezone.com/news/1591017-dominik-mysterio-earns-wwe-backstage-trust",
    "publishedAt": "2025-11-17T14:30:18+00:00",
    "category": "wwe"
  },
  {
    "title": "Triple H Posts Pic With One-Time Matt Cardona After WWE SmackDown Return Of Zack Ryder",
    "summary": "Triple H has commented about Matt Cardona's return to WWE, and teased how there could be more surprises in the Last Time Is Now tournament.",
    "source": "Wrestling Inc",
    "url": "https://www.wrestlinginc.com/2028231/triple-h-pic-matt-cardona-wwe-smackdown-return-zack-ryder/",
    "publishedAt": "2025-11-17T14:30:00+00:00",
    "category": "wwe"
  },
  {
    "title": "WWE Hall of Famer celebrates arrival of first child",
    "summary": "Torrie Wilson posted on Instagram in celebration of her first child with husband Justin Tupper, by way of… The post WWE Hall of Famer celebrates arrival of first child appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/367306-wwe-hall-of-famer-celebrates-arrival-of-first-child/",
    "publishedAt": "2025-11-17T02:58:58+00:00",
    "category": "wwe"
  },
  {
    "title": "Report: Update on TNA media rights future",
    "summary": "The Takedown on SI has reported that a new network has entered the conversation regarding a potential media… The post Report: Update on TNA media rights future appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/367303-report-update-on-tna-media-rights-future/",
    "publishedAt": "2025-11-17T00:43:30+00:00",
    "category": "wwe"
  },
  {
    "title": "John Cena to open Monday’s WWE Raw live from MSG",
    "summary": "WWE Raw General Manager Adam Pearce announced on social media, that John Cena will open Monday’s Raw, as… The post John Cena to open Monday’s WWE Raw live from MSG appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/top-story/367299-john-cena-to-open-mondays-wwe-raw-live-from-msg/",
    "publishedAt": "2025-11-16T20:40:44+00:00",
    "category": "wwe"
  },
  {
    "title": "AEW’s Rebel reveals she’s been diagnosed with lung cancer",
    "summary": "AEW’s Rebel (real name Tanea Brooks) revealed on social media in a posted on X, that she has… The post AEW’s Rebel reveals she’s been diagnosed with lung cancer appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/featured-top-story/367293-aews-rebel-reveals-shes-been-diagnosed-with-lung-cancer/",
    "publishedAt": "2025-11-16T20:16:51+00:00",
    "category": "wwe"
  },
  {
    "title": "TNA IMPACT SPOILERS: Matches taped 11/15/25",
    "summary": "TNA Wrestling taped matches on Saturday night at Full Sail University for future episodes of IMPACT on AXS… The post TNA IMPACT SPOILERS: Matches taped 11/15/25 appeared first on WWE News, WWE...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/impact-wrestling-news/367279-tna-impact-spoilers-matches-taped-11-15-25/",
    "publishedAt": "2025-11-16T15:30:42+00:00",
    "category": "wwe"
  },
  {
    "title": "Mercedes Mone’ captures 13th Championship on Saturday night",
    "summary": "Mercedes Mone’ captured her 13th Championship on Saturday night. Mone’ defeated Nor ‘Phoenix’ Diana to win the APAC… The post Mercedes Mone’ captures 13th Championship on Saturday night appeared...",
    "source": "Wrestleview",
    "url": "https://www.wrestleview.com/aew-news/367269-mercedes-mone-captures-13th-championship-on-saturday-night/",
    "publishedAt": "2025-11-16T04:56:32+00:00",
    "category": "general"
  }
]